MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:37 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_a_spi.asm                                                      PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Wed Nov 30 16:35:35 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../driverlib/MSP430FR2xx_4xx/eusci_a_spi.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ccs_challengespace\MSP430_LCD_display\Debug")
      12            ;       C:\ti\ccs1110\ccs\tools\compiler\ti-cgt-msp430_21.6.1.LTS\bin\acpia430.exe -@C:\\Users\\DAVID~
      13 000000               .sect   ".text:EUSCI_A_SPI_initMaster"
      14                    .clink
      15                    .global EUSCI_A_SPI_initMaster

    1308                    .dwfde $C$DW$CIE, EUSCI_A_SPI_remapPins
    1309            $C$DW$90        .dwtag  DW_TAG_formal_parameter
    1310                    .dwattr $C$DW$90, DW_AT_name("baseAddress")
    1311                    .dwattr $C$DW$90, DW_AT_TI_symbol_name("baseAddress")
    1312                    .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$28)
    1313                    .dwattr $C$DW$90, DW_AT_location[DW_OP_reg12]
    1314            
    1315            $C$DW$91        .dwtag  DW_TAG_formal_parameter
    1316                    .dwattr $C$DW$91, DW_AT_name("pinsSelect")
    1317                    .dwattr $C$DW$91, DW_AT_TI_symbol_name("pinsSelect")
    1318                    .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$26)
    1319                    .dwattr $C$DW$91, DW_AT_location[DW_OP_reg13]
    1320            
    1321            
    1322            ;*****************************************************************************
    1323            ;* FUNCTION NAME: EUSCI_A_SPI_remapPins                                      *
    1324            ;*                                                                           *
    1325            ;*   Regs Modified     : SP,SR                                               *
    1326            ;*   Regs Used         : SP,SR,r12,r13                                       *
    1327            ;*   Local Frame Size  : 0 Args + 4 Auto + 0 Save = 4 byte                   *
    1328            ;*****************************************************************************
    1329 000000       EUSCI_A_SPI_remapPins:
    1330            ;* --------------------------------------------------------------------------*
    1331                    .dwcfi  cfa_offset, 4
    1332                    .dwcfi  save_reg_to_mem, 16, -4
    1333 000000 8221          SUB.W     #4,SP                 ; [] 
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:37 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_a_spi.asm                                                      PAGE   27

    1334                    .dwcfi  cfa_offset, 8
    1335            $C$DW$92        .dwtag  DW_TAG_variable
    1336                    .dwattr $C$DW$92, DW_AT_name("baseAddress")
    1337                    .dwattr $C$DW$92, DW_AT_TI_symbol_name("baseAddress")
    1338                    .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$28)
    1339                    .dwattr $C$DW$92, DW_AT_location[DW_OP_breg1 0]
    1340            
    1341            $C$DW$93        .dwtag  DW_TAG_variable
    1342                    .dwattr $C$DW$93, DW_AT_name("pinsSelect")
    1343                    .dwattr $C$DW$93, DW_AT_TI_symbol_name("pinsSelect")
    1344                    .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$26)
    1345                    .dwattr $C$DW$93, DW_AT_location[DW_OP_breg1 2]
    1346            
    1347 000002 4DC1          MOV.B     r13,2(SP)             ; [] |191| 
         000004 0002 
    1348 000006 4C81          MOV.W     r12,0(SP)             ; [] |191| 
         000008 0000 
    1349                    .dwpsn  file "../driverlib/MSP430FR2xx_4xx/eusci_a_spi.c",line 199,column 1,is_stmt,isa 0
    1350 00000a 5221          ADD.W     #4,SP                 ; [] 
    1351                    .dwcfi  cfa_offset, 4
    1352            $C$DW$94        .dwtag  DW_TAG_TI_branch
    1353                    .dwattr $C$DW$94, DW_AT_low_pc(0x00)
    1354                    .dwattr $C$DW$94, DW_AT_TI_return
    1355            
    1356 00000c 0110          RETA      ; [] 
    1357                    ; [] 
    1358                    .dwattr $C$DW$89, DW_AT_TI_end_file("../driverlib/MSP430FR2xx_4xx/eusci_a_spi.c")
    1359                    .dwattr $C$DW$89, DW_AT_TI_end_line(0xc7)
    1360                    .dwattr $C$DW$89, DW_AT_TI_end_column(0x01)
    1361                    .dwendentry
    1362                    .dwendtag $C$DW$89
    1363            
    1364            ;*****************************************************************************
    1365            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    1366            ;*****************************************************************************
    1367                    .global __mspabi_divul
    1368            
    1369            ;******************************************************************************
    1370            ;* BUILD ATTRIBUTES                                                           *
    1371            ;******************************************************************************
    1372                    .battr "TI", Tag_File, 1, Tag_LOCKIO_INFO(1)
    1373                    .battr "TI", Tag_File, 1, Tag_WAITSTATE_INFO(2)
    1374                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    1375                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
    1376                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    1377            
    1378            ;******************************************************************************
    1379            ;* TYPE INFORMATION                                                           *
    1380            ;******************************************************************************
    1381            
    1382            $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1383                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    1384            $C$DW$95        .dwtag  DW_TAG_member
    1385                    .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$14)
    1386                    .dwattr $C$DW$95, DW_AT_name("__max_align1")
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:37 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_a_spi.asm                                                      PAGE   28

    1387                    .dwattr $C$DW$95, DW_AT_TI_symbol_name("__max_align1")
    1388                    .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1389                    .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1390                    .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
    1391                    .dwattr $C$DW$95, DW_AT_decl_line(0x7b)
    1392                    .dwattr $C$DW$95, DW_AT_decl_column(0x0c)
    1393            
    1394            $C$DW$96        .dwtag  DW_TAG_member
    1395                    .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$18)
    1396                    .dwattr $C$DW$96, DW_AT_name("__max_align2")
    1397                    .dwattr $C$DW$96, DW_AT_TI_symbol_name("__max_align2")
    1398                    .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1399                    .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1400                    .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
    1401                    .dwattr $C$DW$96, DW_AT_decl_line(0x7c)
    1402                    .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1403            
    1404                    .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1405                    .dwattr $C$DW$T$21, DW_AT_decl_line(0x7a)
    1406                    .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1407                    .dwendtag $C$DW$T$21
    1408            
    1409            $C$DW$T$31      .dwtag  DW_TAG_typedef
    1410                    .dwattr $C$DW$T$31, DW_AT_name("__max_align_t")
    1411                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$21)
    1412                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1413                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1414                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x7d)
    1415                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    1416            
    1417            
    1418            $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1419                    .dwattr $C$DW$T$24, DW_AT_name("EUSCI_A_SPI_changeMasterClockParam")
    1420                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
    1421            $C$DW$97        .dwtag  DW_TAG_member
    1422                    .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$23)
    1423                    .dwattr $C$DW$97, DW_AT_name("clockSourceFrequency")
    1424                    .dwattr $C$DW$97, DW_AT_TI_symbol_name("clockSourceFrequency")
    1425                    .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1426                    .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1427                    .dwattr $C$DW$97, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1428                    .dwattr $C$DW$97, DW_AT_decl_line(0x22)
    1429                    .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1430            
    1431            $C$DW$98        .dwtag  DW_TAG_member
    1432                    .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$23)
    1433                    .dwattr $C$DW$98, DW_AT_name("desiredSpiClock")
    1434                    .dwattr $C$DW$98, DW_AT_TI_symbol_name("desiredSpiClock")
    1435                    .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1436                    .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1437                    .dwattr $C$DW$98, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1438                    .dwattr $C$DW$98, DW_AT_decl_line(0x24)
    1439                    .dwattr $C$DW$98, DW_AT_decl_column(0x0e)
    1440            
    1441                    .dwattr $C$DW$T$24, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:37 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_a_spi.asm                                                      PAGE   29

    1442                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x20)
    1443                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1444                    .dwendtag $C$DW$T$24
    1445            
    1446            $C$DW$T$32      .dwtag  DW_TAG_typedef
    1447                    .dwattr $C$DW$T$32, DW_AT_name("EUSCI_A_SPI_changeMasterClockParam")
    1448                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
    1449                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1450                    .dwattr $C$DW$T$32, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1451                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x25)
    1452                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    1453            
    1454            $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    1455                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1456                    .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    1457            
    1458            
    1459            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1460                    .dwattr $C$DW$T$29, DW_AT_name("EUSCI_A_SPI_initMasterParam")
    1461                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x12)
    1462            $C$DW$99        .dwtag  DW_TAG_member
    1463                    .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$26)
    1464                    .dwattr $C$DW$99, DW_AT_name("selectClockSource")
    1465                    .dwattr $C$DW$99, DW_AT_TI_symbol_name("selectClockSource")
    1466                    .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467                    .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1468                    .dwattr $C$DW$99, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1469                    .dwattr $C$DW$99, DW_AT_decl_line(0x52)
    1470                    .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1471            
    1472            $C$DW$100       .dwtag  DW_TAG_member
    1473                    .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$23)
    1474                    .dwattr $C$DW$100, DW_AT_name("clockSourceFrequency")
    1475                    .dwattr $C$DW$100, DW_AT_TI_symbol_name("clockSourceFrequency")
    1476                    .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1477                    .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1478                    .dwattr $C$DW$100, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1479                    .dwattr $C$DW$100, DW_AT_decl_line(0x54)
    1480                    .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1481            
    1482            $C$DW$101       .dwtag  DW_TAG_member
    1483                    .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$23)
    1484                    .dwattr $C$DW$101, DW_AT_name("desiredSpiClock")
    1485                    .dwattr $C$DW$101, DW_AT_TI_symbol_name("desiredSpiClock")
    1486                    .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1487                    .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1488                    .dwattr $C$DW$101, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1489                    .dwattr $C$DW$101, DW_AT_decl_line(0x56)
    1490                    .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1491            
    1492            $C$DW$102       .dwtag  DW_TAG_member
    1493                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$28)
    1494                    .dwattr $C$DW$102, DW_AT_name("msbFirst")
    1495                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("msbFirst")
    1496                    .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:37 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_a_spi.asm                                                      PAGE   30

    1497                    .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1498                    .dwattr $C$DW$102, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1499                    .dwattr $C$DW$102, DW_AT_decl_line(0x5b)
    1500                    .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    1501            
    1502            $C$DW$103       .dwtag  DW_TAG_member
    1503                    .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$28)
    1504                    .dwattr $C$DW$103, DW_AT_name("clockPhase")
    1505                    .dwattr $C$DW$103, DW_AT_TI_symbol_name("clockPhase")
    1506                    .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1507                    .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1508                    .dwattr $C$DW$103, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1509                    .dwattr $C$DW$103, DW_AT_decl_line(0x60)
    1510                    .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    1511            
    1512            $C$DW$104       .dwtag  DW_TAG_member
    1513                    .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$28)
    1514                    .dwattr $C$DW$104, DW_AT_name("clockPolarity")
    1515                    .dwattr $C$DW$104, DW_AT_TI_symbol_name("clockPolarity")
    1516                    .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1517                    .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1518                    .dwattr $C$DW$104, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1519                    .dwattr $C$DW$104, DW_AT_decl_line(0x65)
    1520                    .dwattr $C$DW$104, DW_AT_decl_column(0x0e)
    1521            
    1522            $C$DW$105       .dwtag  DW_TAG_member
    1523                    .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$28)
    1524                    .dwattr $C$DW$105, DW_AT_name("spiMode")
    1525                    .dwattr $C$DW$105, DW_AT_TI_symbol_name("spiMode")
    1526                    .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1527                    .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1528                    .dwattr $C$DW$105, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1529                    .dwattr $C$DW$105, DW_AT_decl_line(0x6b)
    1530                    .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
    1531            
    1532                    .dwattr $C$DW$T$29, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1533                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x4a)
    1534                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    1535                    .dwendtag $C$DW$T$29
    1536            
    1537            $C$DW$T$34      .dwtag  DW_TAG_typedef
    1538                    .dwattr $C$DW$T$34, DW_AT_name("EUSCI_A_SPI_initMasterParam")
    1539                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$29)
    1540                    .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1541                    .dwattr $C$DW$T$34, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1542                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x6c)
    1543                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x03)
    1544            
    1545            $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1546                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1547                    .dwattr $C$DW$T$35, DW_AT_address_class(0x10)
    1548            
    1549            
    1550            $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1551                    .dwattr $C$DW$T$30, DW_AT_name("EUSCI_A_SPI_initSlaveParam")
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:37 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_a_spi.asm                                                      PAGE   31

    1552                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    1553            $C$DW$106       .dwtag  DW_TAG_member
    1554                    .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$28)
    1555                    .dwattr $C$DW$106, DW_AT_name("msbFirst")
    1556                    .dwattr $C$DW$106, DW_AT_TI_symbol_name("msbFirst")
    1557                    .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1558                    .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1559                    .dwattr $C$DW$106, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1560                    .dwattr $C$DW$106, DW_AT_decl_line(0x31)
    1561                    .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1562            
    1563            $C$DW$107       .dwtag  DW_TAG_member
    1564                    .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$28)
    1565                    .dwattr $C$DW$107, DW_AT_name("clockPhase")
    1566                    .dwattr $C$DW$107, DW_AT_TI_symbol_name("clockPhase")
    1567                    .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1568                    .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1569                    .dwattr $C$DW$107, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1570                    .dwattr $C$DW$107, DW_AT_decl_line(0x36)
    1571                    .dwattr $C$DW$107, DW_AT_decl_column(0x0e)
    1572            
    1573            $C$DW$108       .dwtag  DW_TAG_member
    1574                    .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$28)
    1575                    .dwattr $C$DW$108, DW_AT_name("clockPolarity")
    1576                    .dwattr $C$DW$108, DW_AT_TI_symbol_name("clockPolarity")
    1577                    .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1578                    .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1579                    .dwattr $C$DW$108, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1580                    .dwattr $C$DW$108, DW_AT_decl_line(0x3b)
    1581                    .dwattr $C$DW$108, DW_AT_decl_column(0x0e)
    1582            
    1583            $C$DW$109       .dwtag  DW_TAG_member
    1584                    .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$28)
    1585                    .dwattr $C$DW$109, DW_AT_name("spiMode")
    1586                    .dwattr $C$DW$109, DW_AT_TI_symbol_name("spiMode")
    1587                    .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1588                    .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1589                    .dwattr $C$DW$109, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1590                    .dwattr $C$DW$109, DW_AT_decl_line(0x41)
    1591                    .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    1592            
    1593                    .dwattr $C$DW$T$30, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1594                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x2c)
    1595                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    1596                    .dwendtag $C$DW$T$30
    1597            
    1598            $C$DW$T$36      .dwtag  DW_TAG_typedef
    1599                    .dwattr $C$DW$T$36, DW_AT_name("EUSCI_A_SPI_initSlaveParam")
    1600                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$30)
    1601                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1602                    .dwattr $C$DW$T$36, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_spi.h")
    1603                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x42)
    1604                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
    1605            
    1606            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:37 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_a_spi.asm                                                      PAGE   32

    1607                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1608                    .dwattr $C$DW$T$37, DW_AT_address_class(0x10)
    1609            
    1610            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1611                    .dwattr $C$DW$T$2, DW_AT_name("void")
    1612            
    1613            
    1614            $C$DW$T$45      .dwtag  DW_TAG_subroutine_type
    1615                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1616                    .dwendtag $C$DW$T$45
    1617            
    1618            $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    1619                    .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1620                    .dwattr $C$DW$T$46, DW_AT_address_class(0x14)
    1621            
    1622            $C$DW$T$47      .dwtag  DW_TAG_typedef
    1623                    .dwattr $C$DW$T$47, DW_AT_name("__SFR_FARPTR")
    1624                    .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    1625                    .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1626                    .dwattr $C$DW$T$47, DW_AT_decl_file("C:\ti\ccs1110\ccs\ccs_base\msp430\include\msp430fr4133.h"
    1627                    .dwattr $C$DW$T$47, DW_AT_decl_line(0x46)
    1628                    .dwattr $C$DW$T$47, DW_AT_decl_column(0x11)
    1629            
    1630            $C$DW$T$4       .dwtag  DW_TAG_base_type
    1631                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1632                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    1633                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1634            
    1635            $C$DW$T$5       .dwtag  DW_TAG_base_type
    1636                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1637                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1638                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1639            
    1640            $C$DW$T$48      .dwtag  DW_TAG_typedef
    1641                    .dwattr $C$DW$T$48, DW_AT_name("__int8_t")
    1642                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$5)
    1643                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1644                    .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1645                    .dwattr $C$DW$T$48, DW_AT_decl_line(0x36)
