MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:38 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_a_uart.asm                                                     PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Wed Nov 30 16:35:35 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../driverlib/MSP430FR2xx_4xx/eusci_a_uart.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ccs_challengespace\MSP430_LCD_display\Debug")
      12            ;       C:\ti\ccs1110\ccs\tools\compiler\ti-cgt-msp430_21.6.1.LTS\bin\acpia430.exe -@C:\\Users\\DAVID~
      13 000000               .sect   ".text:EUSCI_A_UART_init"
      14                    .clink
      15                    .global EUSCI_A_UART_init

    1400                    .dwattr $C$DW$90, DW_AT_TI_begin_column(0x06)
    1401                    .dwattr $C$DW$90, DW_AT_decl_file("../driverlib/MSP430FR2xx_4xx/eusci_a_uart.c")
    1402                    .dwattr $C$DW$90, DW_AT_decl_line(0xe8)
    1403                    .dwattr $C$DW$90, DW_AT_decl_column(0x06)
    1404                    .dwattr $C$DW$90, DW_AT_TI_max_frame_size(0x08)
    1405                    .dwpsn  file "../driverlib/MSP430FR2xx_4xx/eusci_a_uart.c",line 233,column 1,is_stmt,address E
    1406            
    1407                    .dwfde $C$DW$CIE, EUSCI_A_UART_remapPins
    1408            $C$DW$91        .dwtag  DW_TAG_formal_parameter
    1409                    .dwattr $C$DW$91, DW_AT_name("baseAddress")
    1410                    .dwattr $C$DW$91, DW_AT_TI_symbol_name("baseAddress")
    1411                    .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$25)
    1412                    .dwattr $C$DW$91, DW_AT_location[DW_OP_reg12]
    1413            
    1414            $C$DW$92        .dwtag  DW_TAG_formal_parameter
    1415                    .dwattr $C$DW$92, DW_AT_name("pinsSelect")
    1416                    .dwattr $C$DW$92, DW_AT_TI_symbol_name("pinsSelect")
    1417                    .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$23)
    1418                    .dwattr $C$DW$92, DW_AT_location[DW_OP_reg13]
    1419            
    1420            
    1421            ;*****************************************************************************
    1422            ;* FUNCTION NAME: EUSCI_A_UART_remapPins                                     *
    1423            ;*                                                                           *
    1424            ;*   Regs Modified     : SP,SR                                               *
    1425            ;*   Regs Used         : SP,SR,r12,r13                                       *
    1426            ;*   Local Frame Size  : 0 Args + 4 Auto + 0 Save = 4 byte                   *
    1427            ;*****************************************************************************
    1428 000000       EUSCI_A_UART_remapPins:
    1429            ;* --------------------------------------------------------------------------*
    1430                    .dwcfi  cfa_offset, 4
    1431                    .dwcfi  save_reg_to_mem, 16, -4
    1432 000000 8221          SUB.W     #4,SP                 ; [] 
    1433                    .dwcfi  cfa_offset, 8
    1434            $C$DW$93        .dwtag  DW_TAG_variable
    1435                    .dwattr $C$DW$93, DW_AT_name("baseAddress")
    1436                    .dwattr $C$DW$93, DW_AT_TI_symbol_name("baseAddress")
    1437                    .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$25)
    1438                    .dwattr $C$DW$93, DW_AT_location[DW_OP_breg1 0]
    1439            
    1440            $C$DW$94        .dwtag  DW_TAG_variable
    1441                    .dwattr $C$DW$94, DW_AT_name("pinsSelect")
    1442                    .dwattr $C$DW$94, DW_AT_TI_symbol_name("pinsSelect")
    1443                    .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$23)
    1444                    .dwattr $C$DW$94, DW_AT_location[DW_OP_breg1 2]
    1445            
    1446 000002 4DC1          MOV.B     r13,2(SP)             ; [] |233| 
         000004 0002 
    1447 000006 4C81          MOV.W     r12,0(SP)             ; [] |233| 
         000008 0000 
    1448                    .dwpsn  file "../driverlib/MSP430FR2xx_4xx/eusci_a_uart.c",line 241,column 1,is_stmt,isa 0
    1449 00000a 5221          ADD.W     #4,SP                 ; [] 
    1450                    .dwcfi  cfa_offset, 4
    1451            $C$DW$95        .dwtag  DW_TAG_TI_branch
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:38 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_a_uart.asm                                                     PAGE   29

    1452                    .dwattr $C$DW$95, DW_AT_low_pc(0x00)
    1453                    .dwattr $C$DW$95, DW_AT_TI_return
    1454            
    1455 00000c 0110          RETA      ; [] 
    1456                    ; [] 
    1457                    .dwattr $C$DW$90, DW_AT_TI_end_file("../driverlib/MSP430FR2xx_4xx/eusci_a_uart.c")
    1458                    .dwattr $C$DW$90, DW_AT_TI_end_line(0xf1)
    1459                    .dwattr $C$DW$90, DW_AT_TI_end_column(0x01)
    1460                    .dwendentry
    1461                    .dwendtag $C$DW$90
    1462            
    1463            
    1464            ;******************************************************************************
    1465            ;* BUILD ATTRIBUTES                                                           *
    1466            ;******************************************************************************
    1467                    .battr "TI", Tag_File, 1, Tag_LOCKIO_INFO(1)
    1468                    .battr "TI", Tag_File, 1, Tag_WAITSTATE_INFO(2)
    1469                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    1470                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
    1471                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    1472            
    1473            ;******************************************************************************
    1474            ;* TYPE INFORMATION                                                           *
    1475            ;******************************************************************************
    1476            
    1477            $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1478                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    1479            $C$DW$96        .dwtag  DW_TAG_member
    1480                    .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$14)
    1481                    .dwattr $C$DW$96, DW_AT_name("__max_align1")
    1482                    .dwattr $C$DW$96, DW_AT_TI_symbol_name("__max_align1")
    1483                    .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1484                    .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1485                    .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
    1486                    .dwattr $C$DW$96, DW_AT_decl_line(0x7b)
    1487                    .dwattr $C$DW$96, DW_AT_decl_column(0x0c)
    1488            
    1489            $C$DW$97        .dwtag  DW_TAG_member
    1490                    .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$18)
    1491                    .dwattr $C$DW$97, DW_AT_name("__max_align2")
    1492                    .dwattr $C$DW$97, DW_AT_TI_symbol_name("__max_align2")
    1493                    .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1494                    .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1495                    .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
    1496                    .dwattr $C$DW$97, DW_AT_decl_line(0x7c)
    1497                    .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1498            
    1499                    .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1500                    .dwattr $C$DW$T$21, DW_AT_decl_line(0x7a)
    1501                    .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1502                    .dwendtag $C$DW$T$21
    1503            
    1504            $C$DW$T$27      .dwtag  DW_TAG_typedef
    1505                    .dwattr $C$DW$T$27, DW_AT_name("__max_align_t")
    1506                    .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$21)
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:38 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_a_uart.asm                                                     PAGE   30

    1507                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1508                    .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1509                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x7d)
    1510                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
    1511            
    1512            
    1513            $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1514                    .dwattr $C$DW$T$26, DW_AT_name("EUSCI_A_UART_initParam")
    1515                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x10)
    1516            $C$DW$98        .dwtag  DW_TAG_member
    1517                    .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$23)
    1518                    .dwattr $C$DW$98, DW_AT_name("selectClockSource")
    1519                    .dwattr $C$DW$98, DW_AT_TI_symbol_name("selectClockSource")
    1520                    .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1521                    .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1522                    .dwattr $C$DW$98, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_uart.h")
    1523                    .dwattr $C$DW$98, DW_AT_decl_line(0x2f)
    1524                    .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1525            
    1526            $C$DW$99        .dwtag  DW_TAG_member
    1527                    .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$25)
    1528                    .dwattr $C$DW$99, DW_AT_name("clockPrescalar")
    1529                    .dwattr $C$DW$99, DW_AT_TI_symbol_name("clockPrescalar")
    1530                    .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1531                    .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1532                    .dwattr $C$DW$99, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_uart.h")
    1533                    .dwattr $C$DW$99, DW_AT_decl_line(0x31)
    1534                    .dwattr $C$DW$99, DW_AT_decl_column(0x0e)
    1535            
    1536            $C$DW$100       .dwtag  DW_TAG_member
    1537                    .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$23)
    1538                    .dwattr $C$DW$100, DW_AT_name("firstModReg")
    1539                    .dwattr $C$DW$100, DW_AT_TI_symbol_name("firstModReg")
    1540                    .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1541                    .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1542                    .dwattr $C$DW$100, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_uart.h")
    1543                    .dwattr $C$DW$100, DW_AT_decl_line(0x35)
    1544                    .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1545            
    1546            $C$DW$101       .dwtag  DW_TAG_member
    1547                    .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$23)
    1548                    .dwattr $C$DW$101, DW_AT_name("secondModReg")
    1549                    .dwattr $C$DW$101, DW_AT_TI_symbol_name("secondModReg")
    1550                    .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1551                    .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1552                    .dwattr $C$DW$101, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_uart.h")
    1553                    .dwattr $C$DW$101, DW_AT_decl_line(0x39)
    1554                    .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1555            
    1556            $C$DW$102       .dwtag  DW_TAG_member
    1557                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$23)
    1558                    .dwattr $C$DW$102, DW_AT_name("parity")
    1559                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("parity")
    1560                    .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1561                    .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:38 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_a_uart.asm                                                     PAGE   31

    1562                    .dwattr $C$DW$102, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_uart.h")
    1563                    .dwattr $C$DW$102, DW_AT_decl_line(0x3f)
    1564                    .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1565            
    1566            $C$DW$103       .dwtag  DW_TAG_member
    1567                    .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$25)
    1568                    .dwattr $C$DW$103, DW_AT_name("msborLsbFirst")
    1569                    .dwattr $C$DW$103, DW_AT_TI_symbol_name("msborLsbFirst")
    1570                    .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1571                    .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1572                    .dwattr $C$DW$103, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_uart.h")
    1573                    .dwattr $C$DW$103, DW_AT_decl_line(0x44)
    1574                    .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    1575            
    1576            $C$DW$104       .dwtag  DW_TAG_member
    1577                    .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$25)
    1578                    .dwattr $C$DW$104, DW_AT_name("numberofStopBits")
    1579                    .dwattr $C$DW$104, DW_AT_TI_symbol_name("numberofStopBits")
    1580                    .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1581                    .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1582                    .dwattr $C$DW$104, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_uart.h")
    1583                    .dwattr $C$DW$104, DW_AT_decl_line(0x49)
    1584                    .dwattr $C$DW$104, DW_AT_decl_column(0x0e)
    1585            
    1586            $C$DW$105       .dwtag  DW_TAG_member
    1587                    .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$25)
    1588                    .dwattr $C$DW$105, DW_AT_name("uartMode")
    1589                    .dwattr $C$DW$105, DW_AT_TI_symbol_name("uartMode")
    1590                    .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1591                    .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1592                    .dwattr $C$DW$105, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_uart.h")
    1593                    .dwattr $C$DW$105, DW_AT_decl_line(0x50)
    1594                    .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
    1595            
    1596            $C$DW$106       .dwtag  DW_TAG_member
    1597                    .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$23)
    1598                    .dwattr $C$DW$106, DW_AT_name("overSampling")
    1599                    .dwattr $C$DW$106, DW_AT_TI_symbol_name("overSampling")
    1600                    .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1601                    .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1602                    .dwattr $C$DW$106, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_uart.h")
    1603                    .dwattr $C$DW$106, DW_AT_decl_line(0x55)
    1604                    .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1605            
    1606                    .dwattr $C$DW$T$26, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_uart.h")
    1607                    .dwattr $C$DW$T$26, DW_AT_decl_line(0x27)
    1608                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    1609                    .dwendtag $C$DW$T$26
    1610            
    1611            $C$DW$T$28      .dwtag  DW_TAG_typedef
    1612                    .dwattr $C$DW$T$28, DW_AT_name("EUSCI_A_UART_initParam")
    1613                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$26)
    1614                    .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1615                    .dwattr $C$DW$T$28, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_a_uart.h")
    1616                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x56)
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:38 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_a_uart.asm                                                     PAGE   32

    1617                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    1618            
    1619            $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    1620                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    1621                    .dwattr $C$DW$T$29, DW_AT_address_class(0x10)
    1622            
    1623            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1624                    .dwattr $C$DW$T$2, DW_AT_name("void")
    1625            
    1626            
    1627            $C$DW$T$33      .dwtag  DW_TAG_subroutine_type
    1628                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1629                    .dwendtag $C$DW$T$33
    1630            
    1631            $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1632                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1633                    .dwattr $C$DW$T$34, DW_AT_address_class(0x14)
    1634            
    1635            $C$DW$T$35      .dwtag  DW_TAG_typedef
    1636                    .dwattr $C$DW$T$35, DW_AT_name("__SFR_FARPTR")
    1637                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1638                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1639                    .dwattr $C$DW$T$35, DW_AT_decl_file("C:\ti\ccs1110\ccs\ccs_base\msp430\include\msp430fr4133.h"
    1640                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x46)
    1641                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x11)
    1642            
    1643            $C$DW$T$4       .dwtag  DW_TAG_base_type
    1644                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1645                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    1646                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1647            
    1648            $C$DW$T$5       .dwtag  DW_TAG_base_type
    1649                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1650                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1651                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1652            
    1653            $C$DW$T$36      .dwtag  DW_TAG_typedef
    1654                    .dwattr $C$DW$T$36, DW_AT_name("__int8_t")
    1655                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$5)
    1656                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1657                    .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1658                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x36)
