MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:38 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_b_spi.asm                                                      PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Wed Nov 30 16:35:36 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../driverlib/MSP430FR2xx_4xx/eusci_b_spi.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ccs_challengespace\MSP430_LCD_display\Debug")
      12            ;       C:\ti\ccs1110\ccs\tools\compiler\ti-cgt-msp430_21.6.1.LTS\bin\acpia430.exe -@C:\\Users\\DAVID~
      13 000000               .sect   ".text:EUSCI_B_SPI_initMaster"
      14                    .clink
      15                    .global EUSCI_B_SPI_initMaster

    1314                    .dwattr $C$DW$91, DW_AT_TI_symbol_name("pinsSelect")
    1315                    .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$26)
    1316                    .dwattr $C$DW$91, DW_AT_location[DW_OP_reg13]
    1317            
    1318            
    1319            ;*****************************************************************************
    1320            ;* FUNCTION NAME: EUSCI_B_SPI_remapPins                                      *
    1321            ;*                                                                           *
    1322            ;*   Regs Modified     : SP,SR,r15                                           *
    1323            ;*   Regs Used         : SP,SR,r12,r13,r15                                   *
    1324            ;*   Local Frame Size  : 0 Args + 4 Auto + 0 Save = 4 byte                   *
    1325            ;*****************************************************************************
    1326 000000       EUSCI_B_SPI_remapPins:
    1327            ;* --------------------------------------------------------------------------*
    1328                    .dwcfi  cfa_offset, 4
    1329                    .dwcfi  save_reg_to_mem, 16, -4
    1330 000000 8221          SUB.W     #4,SP                 ; [] 
    1331                    .dwcfi  cfa_offset, 8
    1332            $C$DW$92        .dwtag  DW_TAG_variable
    1333                    .dwattr $C$DW$92, DW_AT_name("baseAddress")
    1334                    .dwattr $C$DW$92, DW_AT_TI_symbol_name("baseAddress")
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:38 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_b_spi.asm                                                      PAGE   27

    1335                    .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$28)
    1336                    .dwattr $C$DW$92, DW_AT_location[DW_OP_breg1 0]
    1337            
    1338            $C$DW$93        .dwtag  DW_TAG_variable
    1339                    .dwattr $C$DW$93, DW_AT_name("pinsSelect")
    1340                    .dwattr $C$DW$93, DW_AT_TI_symbol_name("pinsSelect")
    1341                    .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$26)
    1342                    .dwattr $C$DW$93, DW_AT_location[DW_OP_breg1 2]
    1343            
    1344 000002 4DC1          MOV.B     r13,2(SP)             ; [] |189| 
         000004 0002 
    1345 000006 4C81          MOV.W     r12,0(SP)             ; [] |189| 
         000008 0000 
    1346                    .dwpsn  file "../driverlib/MSP430FR2xx_4xx/eusci_b_spi.c",line 191,column 5,is_stmt,isa 0
    1347 00000a F0B2          AND.W     #63487,&0x164         ; [] |191| 
         00000c F7FF 
         00000e 0164 
    1348                    .dwpsn  file "../driverlib/MSP430FR2xx_4xx/eusci_b_spi.c",line 192,column 5,is_stmt,isa 0
    1349 000010 415F          MOV.B     2(SP),r15             ; [] |192| 
         000012 0002 
    1350 000014 184A          RPT #11 || RLAX.W r15 ; [] |192| 
         000016 5F0F 
    1351 000018 DF82          OR.W      r15,&0x164            ; [] |192| 
         00001a 0164 
    1352                    .dwpsn  file "../driverlib/MSP430FR2xx_4xx/eusci_b_spi.c",line 197,column 1,is_stmt,isa 0
    1353 00001c 5221          ADD.W     #4,SP                 ; [] 
    1354                    .dwcfi  cfa_offset, 4
    1355            $C$DW$94        .dwtag  DW_TAG_TI_branch
    1356                    .dwattr $C$DW$94, DW_AT_low_pc(0x00)
    1357                    .dwattr $C$DW$94, DW_AT_TI_return
    1358            
    1359 00001e 0110          RETA      ; [] 
    1360                    ; [] 
    1361                    .dwattr $C$DW$89, DW_AT_TI_end_file("../driverlib/MSP430FR2xx_4xx/eusci_b_spi.c")
    1362                    .dwattr $C$DW$89, DW_AT_TI_end_line(0xc5)
    1363                    .dwattr $C$DW$89, DW_AT_TI_end_column(0x01)
    1364                    .dwendentry
    1365                    .dwendtag $C$DW$89
    1366            
    1367            ;*****************************************************************************
    1368            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    1369            ;*****************************************************************************
    1370                    .global __mspabi_divul
    1371            
    1372            ;******************************************************************************
    1373            ;* BUILD ATTRIBUTES                                                           *
    1374            ;******************************************************************************
    1375                    .battr "TI", Tag_File, 1, Tag_LOCKIO_INFO(1)
    1376                    .battr "TI", Tag_File, 1, Tag_WAITSTATE_INFO(2)
    1377                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    1378                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
    1379                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    1380            
    1381            ;******************************************************************************
    1382            ;* TYPE INFORMATION                                                           *
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:38 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_b_spi.asm                                                      PAGE   28

    1383            ;******************************************************************************
    1384            
    1385            $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1386                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    1387            $C$DW$95        .dwtag  DW_TAG_member
    1388                    .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$14)
    1389                    .dwattr $C$DW$95, DW_AT_name("__max_align1")
    1390                    .dwattr $C$DW$95, DW_AT_TI_symbol_name("__max_align1")
    1391                    .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392                    .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1393                    .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
    1394                    .dwattr $C$DW$95, DW_AT_decl_line(0x7b)
    1395                    .dwattr $C$DW$95, DW_AT_decl_column(0x0c)
    1396            
    1397            $C$DW$96        .dwtag  DW_TAG_member
    1398                    .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$18)
    1399                    .dwattr $C$DW$96, DW_AT_name("__max_align2")
    1400                    .dwattr $C$DW$96, DW_AT_TI_symbol_name("__max_align2")
    1401                    .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1402                    .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1403                    .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
    1404                    .dwattr $C$DW$96, DW_AT_decl_line(0x7c)
    1405                    .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1406            
    1407                    .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1408                    .dwattr $C$DW$T$21, DW_AT_decl_line(0x7a)
    1409                    .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1410                    .dwendtag $C$DW$T$21
    1411            
    1412            $C$DW$T$31      .dwtag  DW_TAG_typedef
    1413                    .dwattr $C$DW$T$31, DW_AT_name("__max_align_t")
    1414                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$21)
    1415                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1416                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1417                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x7d)
    1418                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    1419            
    1420            
    1421            $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1422                    .dwattr $C$DW$T$24, DW_AT_name("EUSCI_B_SPI_changeMasterClockParam")
    1423                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
    1424            $C$DW$97        .dwtag  DW_TAG_member
    1425                    .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$23)
    1426                    .dwattr $C$DW$97, DW_AT_name("clockSourceFrequency")
    1427                    .dwattr $C$DW$97, DW_AT_TI_symbol_name("clockSourceFrequency")
    1428                    .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1429                    .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1430                    .dwattr $C$DW$97, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1431                    .dwattr $C$DW$97, DW_AT_decl_line(0x69)
    1432                    .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1433            
    1434            $C$DW$98        .dwtag  DW_TAG_member
    1435                    .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$23)
    1436                    .dwattr $C$DW$98, DW_AT_name("desiredSpiClock")
    1437                    .dwattr $C$DW$98, DW_AT_TI_symbol_name("desiredSpiClock")
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:38 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_b_spi.asm                                                      PAGE   29

    1438                    .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1439                    .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1440                    .dwattr $C$DW$98, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1441                    .dwattr $C$DW$98, DW_AT_decl_line(0x6b)
    1442                    .dwattr $C$DW$98, DW_AT_decl_column(0x0e)
    1443            
    1444                    .dwattr $C$DW$T$24, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1445                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x67)
    1446                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1447                    .dwendtag $C$DW$T$24
    1448            
    1449            $C$DW$T$32      .dwtag  DW_TAG_typedef
    1450                    .dwattr $C$DW$T$32, DW_AT_name("EUSCI_B_SPI_changeMasterClockParam")
    1451                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
    1452                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1453                    .dwattr $C$DW$T$32, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1454                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x6c)
    1455                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    1456            
    1457            $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    1458                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1459                    .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    1460            
    1461            
    1462            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1463                    .dwattr $C$DW$T$29, DW_AT_name("EUSCI_B_SPI_initMasterParam")
    1464                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x12)
    1465            $C$DW$99        .dwtag  DW_TAG_member
    1466                    .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$26)
    1467                    .dwattr $C$DW$99, DW_AT_name("selectClockSource")
    1468                    .dwattr $C$DW$99, DW_AT_TI_symbol_name("selectClockSource")
    1469                    .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1470                    .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1471                    .dwattr $C$DW$99, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1472                    .dwattr $C$DW$99, DW_AT_decl_line(0x28)
    1473                    .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1474            
    1475            $C$DW$100       .dwtag  DW_TAG_member
    1476                    .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$23)
    1477                    .dwattr $C$DW$100, DW_AT_name("clockSourceFrequency")
    1478                    .dwattr $C$DW$100, DW_AT_TI_symbol_name("clockSourceFrequency")
    1479                    .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1480                    .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1481                    .dwattr $C$DW$100, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1482                    .dwattr $C$DW$100, DW_AT_decl_line(0x2a)
    1483                    .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1484            
    1485            $C$DW$101       .dwtag  DW_TAG_member
    1486                    .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$23)
    1487                    .dwattr $C$DW$101, DW_AT_name("desiredSpiClock")
    1488                    .dwattr $C$DW$101, DW_AT_TI_symbol_name("desiredSpiClock")
    1489                    .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1490                    .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1491                    .dwattr $C$DW$101, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1492                    .dwattr $C$DW$101, DW_AT_decl_line(0x2c)
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:38 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_b_spi.asm                                                      PAGE   30

    1493                    .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1494            
    1495            $C$DW$102       .dwtag  DW_TAG_member
    1496                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$28)
    1497                    .dwattr $C$DW$102, DW_AT_name("msbFirst")
    1498                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("msbFirst")
    1499                    .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1500                    .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1501                    .dwattr $C$DW$102, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1502                    .dwattr $C$DW$102, DW_AT_decl_line(0x31)
    1503                    .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    1504            
    1505            $C$DW$103       .dwtag  DW_TAG_member
    1506                    .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$28)
    1507                    .dwattr $C$DW$103, DW_AT_name("clockPhase")
    1508                    .dwattr $C$DW$103, DW_AT_TI_symbol_name("clockPhase")
    1509                    .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1510                    .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1511                    .dwattr $C$DW$103, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1512                    .dwattr $C$DW$103, DW_AT_decl_line(0x36)
    1513                    .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    1514            
    1515            $C$DW$104       .dwtag  DW_TAG_member
    1516                    .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$28)
    1517                    .dwattr $C$DW$104, DW_AT_name("clockPolarity")
    1518                    .dwattr $C$DW$104, DW_AT_TI_symbol_name("clockPolarity")
    1519                    .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1520                    .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1521                    .dwattr $C$DW$104, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1522                    .dwattr $C$DW$104, DW_AT_decl_line(0x3b)
    1523                    .dwattr $C$DW$104, DW_AT_decl_column(0x0e)
    1524            
    1525            $C$DW$105       .dwtag  DW_TAG_member
    1526                    .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$28)
    1527                    .dwattr $C$DW$105, DW_AT_name("spiMode")
    1528                    .dwattr $C$DW$105, DW_AT_TI_symbol_name("spiMode")
    1529                    .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1530                    .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1531                    .dwattr $C$DW$105, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1532                    .dwattr $C$DW$105, DW_AT_decl_line(0x41)
    1533                    .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
    1534            
    1535                    .dwattr $C$DW$T$29, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1536                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x20)
    1537                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    1538                    .dwendtag $C$DW$T$29
    1539            
    1540            $C$DW$T$34      .dwtag  DW_TAG_typedef
    1541                    .dwattr $C$DW$T$34, DW_AT_name("EUSCI_B_SPI_initMasterParam")
    1542                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$29)
    1543                    .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1544                    .dwattr $C$DW$T$34, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1545                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x42)
    1546                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x03)
    1547            
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:38 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_b_spi.asm                                                      PAGE   31

    1548            $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1549                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1550                    .dwattr $C$DW$T$35, DW_AT_address_class(0x10)
    1551            
    1552            
    1553            $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1554                    .dwattr $C$DW$T$30, DW_AT_name("EUSCI_B_SPI_initSlaveParam")
    1555                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    1556            $C$DW$106       .dwtag  DW_TAG_member
    1557                    .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$28)
    1558                    .dwattr $C$DW$106, DW_AT_name("msbFirst")
    1559                    .dwattr $C$DW$106, DW_AT_TI_symbol_name("msbFirst")
    1560                    .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1561                    .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1562                    .dwattr $C$DW$106, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1563                    .dwattr $C$DW$106, DW_AT_decl_line(0x4e)
    1564                    .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1565            
    1566            $C$DW$107       .dwtag  DW_TAG_member
    1567                    .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$28)
    1568                    .dwattr $C$DW$107, DW_AT_name("clockPhase")
    1569                    .dwattr $C$DW$107, DW_AT_TI_symbol_name("clockPhase")
    1570                    .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1571                    .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1572                    .dwattr $C$DW$107, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1573                    .dwattr $C$DW$107, DW_AT_decl_line(0x53)
    1574                    .dwattr $C$DW$107, DW_AT_decl_column(0x0e)
    1575            
    1576            $C$DW$108       .dwtag  DW_TAG_member
    1577                    .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$28)
    1578                    .dwattr $C$DW$108, DW_AT_name("clockPolarity")
    1579                    .dwattr $C$DW$108, DW_AT_TI_symbol_name("clockPolarity")
    1580                    .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1581                    .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1582                    .dwattr $C$DW$108, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1583                    .dwattr $C$DW$108, DW_AT_decl_line(0x58)
    1584                    .dwattr $C$DW$108, DW_AT_decl_column(0x0e)
    1585            
    1586            $C$DW$109       .dwtag  DW_TAG_member
    1587                    .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$28)
    1588                    .dwattr $C$DW$109, DW_AT_name("spiMode")
    1589                    .dwattr $C$DW$109, DW_AT_TI_symbol_name("spiMode")
    1590                    .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1591                    .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1592                    .dwattr $C$DW$109, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1593                    .dwattr $C$DW$109, DW_AT_decl_line(0x5e)
    1594                    .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    1595            
    1596                    .dwattr $C$DW$T$30, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1597                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x49)
    1598                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    1599                    .dwendtag $C$DW$T$30
    1600            
    1601            $C$DW$T$36      .dwtag  DW_TAG_typedef
    1602                    .dwattr $C$DW$T$36, DW_AT_name("EUSCI_B_SPI_initSlaveParam")
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:38 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
eusci_b_spi.asm                                                      PAGE   32

    1603                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$30)
    1604                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1605                    .dwattr $C$DW$T$36, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\eusci_b_spi.h")
    1606                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x5f)
    1607                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
    1608            
    1609            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    1610                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1611                    .dwattr $C$DW$T$37, DW_AT_address_class(0x10)
    1612            
    1613            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1614                    .dwattr $C$DW$T$2, DW_AT_name("void")
    1615            
    1616            
    1617            $C$DW$T$45      .dwtag  DW_TAG_subroutine_type
    1618                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1619                    .dwendtag $C$DW$T$45
    1620            
    1621            $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    1622                    .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1623                    .dwattr $C$DW$T$46, DW_AT_address_class(0x14)
    1624            
    1625            $C$DW$T$47      .dwtag  DW_TAG_typedef
    1626                    .dwattr $C$DW$T$47, DW_AT_name("__SFR_FARPTR")
    1627                    .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    1628                    .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1629                    .dwattr $C$DW$T$47, DW_AT_decl_file("C:\ti\ccs1110\ccs\ccs_base\msp430\include\msp430fr4133.h"
    1630                    .dwattr $C$DW$T$47, DW_AT_decl_line(0x46)
    1631                    .dwattr $C$DW$T$47, DW_AT_decl_column(0x11)
    1632            
    1633            $C$DW$T$4       .dwtag  DW_TAG_base_type
    1634                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1635                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    1636                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1637            
    1638            $C$DW$T$5       .dwtag  DW_TAG_base_type
    1639                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1640                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1641                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1642            
    1643            $C$DW$T$48      .dwtag  DW_TAG_typedef
    1644                    .dwattr $C$DW$T$48, DW_AT_name("__int8_t")
    1645                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$5)
    1646                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1647                    .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1648                    .dwattr $C$DW$T$48, DW_AT_decl_line(0x36)
