MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:43 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Wed Nov 30 16:35:42 2022                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../driverlib/MSP430FR2xx_4xx/timer_a.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ccs_challengespace\MSP430_LCD_display\Debug")
      12            ;       C:\ti\ccs1110\ccs\tools\compiler\ti-cgt-msp430_21.6.1.LTS\bin\acpia430.exe -@C:\\Users\\DAVID~
      13 000000               .sect   ".text:Timer_A_startCounter"
      14                    .clink
      15                    .global Timer_A_startCounter

    2151 000012 4C91          MOV.W     16(r12),4(SP)         ; [] |311| 
         000014 0010 
         000016 0004 
    2152                    .dwpsn  file "../driverlib/MSP430FR2xx_4xx/timer_a.c",line 313,column 3,is_stmt,isa 0
    2153 000018 9191          CMP.W     4(SP),2(SP)           ; [] |313| 
         00001a 0004 
         00001c 0002 
    2154 00001e 2C07          JHS       $C$L13                ; [] |313| 
    2155                                                      ; [] |313| 
    2156            ;* --------------------------------------------------------------------------*
    2157                    .dwpsn  file "../driverlib/MSP430FR2xx_4xx/timer_a.c",line 314,column 4,is_stmt,isa 0
    2158 000020 411F          MOV.W     4(SP),r15             ; [] |314| 
         000022 0004 
    2159 000024 811F          SUB.W     2(SP),r15             ; [] |314| 
         000026 0002 
    2160 000028 4F81          MOV.W     r15,6(SP)             ; [] |314| 
         00002a 0006 
    2161 00002c 3C0D          JMP       $C$L15                ; [] 
    2162                                                      ; [] 
    2163            ;* --------------------------------------------------------------------------*
    2164 00002e       $C$L13:    
    2165                    .dwpsn  file "../driverlib/MSP430FR2xx_4xx/timer_a.c",line 315,column 10,is_stmt,isa 0
    2166 00002e 9191          CMP.W     2(SP),4(SP)           ; [] |315| 
         000030 0002 
         000032 0004 
    2167 000034 2C07          JHS       $C$L14                ; [] |315| 
    2168                                                      ; [] |315| 
    2169            ;* --------------------------------------------------------------------------*
    2170                    .dwpsn  file "../driverlib/MSP430FR2xx_4xx/timer_a.c",line 316,column 4,is_stmt,isa 0
    2171 000036 411F          MOV.W     2(SP),r15             ; [] |316| 
         000038 0002 
    2172 00003a 811F          SUB.W     4(SP),r15             ; [] |316| 
         00003c 0004 
    2173 00003e 4F81          MOV.W     r15,6(SP)             ; [] |316| 
         000040 0006 
    2174 000042 3C02          JMP       $C$L15                ; [] 
    2175                                                      ; [] 
    2176            ;* --------------------------------------------------------------------------*
    2177 000044       $C$L14:    
    2178                    .dwpsn  file "../driverlib/MSP430FR2xx_4xx/timer_a.c",line 318,column 4,is_stmt,isa 0
    2179 000044 4381          MOV.W     #0,6(SP)              ; [] |318| 
         000046 0006 
    2180            ;* --------------------------------------------------------------------------*
    2181 000048       $C$L15:    
    2182                    .dwpsn  file "../driverlib/MSP430FR2xx_4xx/timer_a.c",line 321,column 15,is_stmt,isa 0
    2183 000048 90B1          CMP.W     #51,6(SP)             ; [] |321| 
         00004a 0033 
         00004c 0006 
    2184 00004e 2FDE          JHS       $C$L12                ; [] |321| 
    2185                                                      ; [] |321| 
    2186            ;* --------------------------------------------------------------------------*
    2187                    .dwpsn  file "../driverlib/MSP430FR2xx_4xx/timer_a.c",line 323,column 5,is_stmt,isa 0
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:43 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   45

    2188 000050 411C          MOV.W     4(SP),r12             ; [] |323| 
         000052 0004 
    2189                    .dwpsn  file "../driverlib/MSP430FR2xx_4xx/timer_a.c",line 324,column 1,is_stmt,isa 0
    2190 000054 5231          ADD.W     #8,SP                 ; [] 
    2191                    .dwcfi  cfa_offset, 4
    2192            $C$DW$144       .dwtag  DW_TAG_TI_branch
    2193                    .dwattr $C$DW$144, DW_AT_low_pc(0x00)
    2194                    .dwattr $C$DW$144, DW_AT_TI_return
    2195            
    2196 000056 0110          RETA      ; [] 
    2197                    ; [] 
    2198                    .dwattr $C$DW$138, DW_AT_TI_end_file("../driverlib/MSP430FR2xx_4xx/timer_a.c")
    2199                    .dwattr $C$DW$138, DW_AT_TI_end_line(0x144)
    2200                    .dwattr $C$DW$138, DW_AT_TI_end_column(0x01)
    2201                    .dwendentry
    2202                    .dwendtag $C$DW$138
    2203            
    2204            
    2205            ;******************************************************************************
    2206            ;* BUILD ATTRIBUTES                                                           *
    2207            ;******************************************************************************
    2208                    .battr "TI", Tag_File, 1, Tag_LOCKIO_INFO(1)
    2209                    .battr "TI", Tag_File, 1, Tag_WAITSTATE_INFO(2)
    2210                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
    2211                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
    2212                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
    2213            
    2214            ;******************************************************************************
    2215            ;* TYPE INFORMATION                                                           *
    2216            ;******************************************************************************
    2217            
    2218            $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2219                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    2220            $C$DW$145       .dwtag  DW_TAG_member
    2221                    .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$14)
    2222                    .dwattr $C$DW$145, DW_AT_name("__max_align1")
    2223                    .dwattr $C$DW$145, DW_AT_TI_symbol_name("__max_align1")
    2224                    .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2225                    .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2226                    .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2227                    .dwattr $C$DW$145, DW_AT_decl_line(0x7b)
    2228                    .dwattr $C$DW$145, DW_AT_decl_column(0x0c)
    2229            
    2230            $C$DW$146       .dwtag  DW_TAG_member
    2231                    .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$18)
    2232                    .dwattr $C$DW$146, DW_AT_name("__max_align2")
    2233                    .dwattr $C$DW$146, DW_AT_TI_symbol_name("__max_align2")
    2234                    .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2235                    .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2236                    .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/
    2237                    .dwattr $C$DW$146, DW_AT_decl_line(0x7c)
    2238                    .dwattr $C$DW$146, DW_AT_decl_column(0x0e)
    2239            
    2240                    .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2241                    .dwattr $C$DW$T$21, DW_AT_decl_line(0x7a)
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:43 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   46

    2242                    .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    2243                    .dwendtag $C$DW$T$21
    2244            
    2245            $C$DW$T$31      .dwtag  DW_TAG_typedef
    2246                    .dwattr $C$DW$T$31, DW_AT_name("__max_align_t")
    2247                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$21)
    2248                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2249                    .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2250                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x7d)
    2251                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x03)
    2252            
    2253            
    2254            $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2255                    .dwattr $C$DW$T$24, DW_AT_name("Timer_A_initCaptureModeParam")
    2256                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x0c)
    2257            $C$DW$147       .dwtag  DW_TAG_member
    2258                    .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$23)
    2259                    .dwattr $C$DW$147, DW_AT_name("captureRegister")
    2260                    .dwattr $C$DW$147, DW_AT_TI_symbol_name("captureRegister")
    2261                    .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2262                    .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2263                    .dwattr $C$DW$147, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2264                    .dwattr $C$DW$147, DW_AT_decl_line(0x64)
    2265                    .dwattr $C$DW$147, DW_AT_decl_column(0x0e)
    2266            
    2267            $C$DW$148       .dwtag  DW_TAG_member
    2268                    .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$23)
    2269                    .dwattr $C$DW$148, DW_AT_name("captureMode")
    2270                    .dwattr $C$DW$148, DW_AT_TI_symbol_name("captureMode")
    2271                    .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2272                    .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2273                    .dwattr $C$DW$148, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2274                    .dwattr $C$DW$148, DW_AT_decl_line(0x6b)
    2275                    .dwattr $C$DW$148, DW_AT_decl_column(0x0e)
    2276            
    2277            $C$DW$149       .dwtag  DW_TAG_member
    2278                    .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$23)
    2279                    .dwattr $C$DW$149, DW_AT_name("captureInputSelect")
    2280                    .dwattr $C$DW$149, DW_AT_TI_symbol_name("captureInputSelect")
    2281                    .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2282                    .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2283                    .dwattr $C$DW$149, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2284                    .dwattr $C$DW$149, DW_AT_decl_line(0x72)
    2285                    .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2286            
    2287            $C$DW$150       .dwtag  DW_TAG_member
    2288                    .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$23)
    2289                    .dwattr $C$DW$150, DW_AT_name("synchronizeCaptureSource")
    2290                    .dwattr $C$DW$150, DW_AT_TI_symbol_name("synchronizeCaptureSource")
    2291                    .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2292                    .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2293                    .dwattr $C$DW$150, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2294                    .dwattr $C$DW$150, DW_AT_decl_line(0x77)
    2295                    .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    2296            
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:43 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   47

    2297            $C$DW$151       .dwtag  DW_TAG_member
    2298                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$23)
    2299                    .dwattr $C$DW$151, DW_AT_name("captureInterruptEnable")
    2300                    .dwattr $C$DW$151, DW_AT_TI_symbol_name("captureInterruptEnable")
    2301                    .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2302                    .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2303                    .dwattr $C$DW$151, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2304                    .dwattr $C$DW$151, DW_AT_decl_line(0x7c)
    2305                    .dwattr $C$DW$151, DW_AT_decl_column(0x0e)
    2306            
    2307            $C$DW$152       .dwtag  DW_TAG_member
    2308                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$23)
    2309                    .dwattr $C$DW$152, DW_AT_name("captureOutputMode")
    2310                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("captureOutputMode")
    2311                    .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2312                    .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2313                    .dwattr $C$DW$152, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2314                    .dwattr $C$DW$152, DW_AT_decl_line(0x87)
    2315                    .dwattr $C$DW$152, DW_AT_decl_column(0x0e)
    2316            
    2317                    .dwattr $C$DW$T$24, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2318                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x5d)
    2319                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    2320                    .dwendtag $C$DW$T$24
    2321            
    2322            $C$DW$T$32      .dwtag  DW_TAG_typedef
    2323                    .dwattr $C$DW$T$32, DW_AT_name("Timer_A_initCaptureModeParam")
    2324                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
    2325                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2326                    .dwattr $C$DW$T$32, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2327                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x88)
    2328                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x03)
    2329            
    2330            $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    2331                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2332                    .dwattr $C$DW$T$33, DW_AT_address_class(0x10)
    2333            
    2334            
    2335            $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2336                    .dwattr $C$DW$T$25, DW_AT_name("Timer_A_initCompareModeParam")
    2337                    .dwattr $C$DW$T$25, DW_AT_byte_size(0x08)
    2338            $C$DW$153       .dwtag  DW_TAG_member
    2339                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$23)
    2340                    .dwattr $C$DW$153, DW_AT_name("compareRegister")
    2341                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("compareRegister")
    2342                    .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2343                    .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2344                    .dwattr $C$DW$153, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2345                    .dwattr $C$DW$153, DW_AT_decl_line(0x149)
    2346                    .dwattr $C$DW$153, DW_AT_decl_column(0x0e)
    2347            
    2348            $C$DW$154       .dwtag  DW_TAG_member
    2349                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$23)
    2350                    .dwattr $C$DW$154, DW_AT_name("compareInterruptEnable")
    2351                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("compareInterruptEnable")
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:43 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   48

    2352                    .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2353                    .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2354                    .dwattr $C$DW$154, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2355                    .dwattr $C$DW$154, DW_AT_decl_line(0x14e)
    2356                    .dwattr $C$DW$154, DW_AT_decl_column(0x0e)
    2357            
    2358            $C$DW$155       .dwtag  DW_TAG_member
    2359                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$23)
    2360                    .dwattr $C$DW$155, DW_AT_name("compareOutputMode")
    2361                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("compareOutputMode")
    2362                    .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2363                    .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2364                    .dwattr $C$DW$155, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2365                    .dwattr $C$DW$155, DW_AT_decl_line(0x159)
    2366                    .dwattr $C$DW$155, DW_AT_decl_column(0x0e)
    2367            
    2368            $C$DW$156       .dwtag  DW_TAG_member
    2369                    .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$23)
    2370                    .dwattr $C$DW$156, DW_AT_name("compareValue")
    2371                    .dwattr $C$DW$156, DW_AT_TI_symbol_name("compareValue")
    2372                    .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2373                    .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2374                    .dwattr $C$DW$156, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2375                    .dwattr $C$DW$156, DW_AT_decl_line(0x15b)
    2376                    .dwattr $C$DW$156, DW_AT_decl_column(0x0e)
    2377            
    2378                    .dwattr $C$DW$T$25, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2379                    .dwattr $C$DW$T$25, DW_AT_decl_line(0x142)
    2380                    .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    2381                    .dwendtag $C$DW$T$25
    2382            
    2383            $C$DW$T$34      .dwtag  DW_TAG_typedef
    2384                    .dwattr $C$DW$T$34, DW_AT_name("Timer_A_initCompareModeParam")
    2385                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$25)
    2386                    .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    2387                    .dwattr $C$DW$T$34, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2388                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x15c)
    2389                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x03)
    2390            
    2391            $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    2392                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    2393                    .dwattr $C$DW$T$35, DW_AT_address_class(0x10)
    2394            
    2395            
    2396            $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2397                    .dwattr $C$DW$T$27, DW_AT_name("Timer_A_initContinuousModeParam")
    2398                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    2399            $C$DW$157       .dwtag  DW_TAG_member
    2400                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$23)
    2401                    .dwattr $C$DW$157, DW_AT_name("clockSource")
    2402                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("clockSource")
    2403                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2404                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2405                    .dwattr $C$DW$157, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2406                    .dwattr $C$DW$157, DW_AT_decl_line(0x30)
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:43 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   49

    2407                    .dwattr $C$DW$157, DW_AT_decl_column(0x0e)
    2408            
    2409            $C$DW$158       .dwtag  DW_TAG_member
    2410                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$23)
    2411                    .dwattr $C$DW$158, DW_AT_name("clockSourceDivider")
    2412                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("clockSourceDivider")
    2413                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2414                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2415                    .dwattr $C$DW$158, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2416                    .dwattr $C$DW$158, DW_AT_decl_line(0x47)
    2417                    .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    2418            
    2419            $C$DW$159       .dwtag  DW_TAG_member
    2420                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$23)
    2421                    .dwattr $C$DW$159, DW_AT_name("timerInterruptEnable_TAIE")
    2422                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2423                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2424                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2425                    .dwattr $C$DW$159, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2426                    .dwattr $C$DW$159, DW_AT_decl_line(0x4c)
    2427                    .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    2428            
    2429            $C$DW$160       .dwtag  DW_TAG_member
    2430                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$23)
    2431                    .dwattr $C$DW$160, DW_AT_name("timerClear")
    2432                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("timerClear")
    2433                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2434                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2435                    .dwattr $C$DW$160, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2436                    .dwattr $C$DW$160, DW_AT_decl_line(0x52)
    2437                    .dwattr $C$DW$160, DW_AT_decl_column(0x0e)
    2438            
    2439            $C$DW$161       .dwtag  DW_TAG_member
    2440                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$26)
    2441                    .dwattr $C$DW$161, DW_AT_name("startTimer")
    2442                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("startTimer")
    2443                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2444                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2445                    .dwattr $C$DW$161, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2446                    .dwattr $C$DW$161, DW_AT_decl_line(0x54)
    2447                    .dwattr $C$DW$161, DW_AT_decl_column(0x0a)
    2448            
    2449                    .dwattr $C$DW$T$27, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2450                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x29)
    2451                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    2452                    .dwendtag $C$DW$T$27
    2453            
    2454            $C$DW$T$36      .dwtag  DW_TAG_typedef
    2455                    .dwattr $C$DW$T$36, DW_AT_name("Timer_A_initContinuousModeParam")
    2456                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$27)
    2457                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2458                    .dwattr $C$DW$T$36, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2459                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x55)
    2460                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
    2461            
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:43 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   50

    2462            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2463                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2464                    .dwattr $C$DW$T$37, DW_AT_address_class(0x10)
    2465            
    2466            
    2467            $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2468                    .dwattr $C$DW$T$28, DW_AT_name("Timer_A_initUpDownModeParam")
    2469                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x0e)
    2470            $C$DW$162       .dwtag  DW_TAG_member
    2471                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$23)
    2472                    .dwattr $C$DW$162, DW_AT_name("clockSource")
    2473                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("clockSource")
    2474                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2475                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2476                    .dwattr $C$DW$162, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2477                    .dwattr $C$DW$162, DW_AT_decl_line(0x97)
    2478                    .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    2479            
    2480            $C$DW$163       .dwtag  DW_TAG_member
    2481                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$23)
    2482                    .dwattr $C$DW$163, DW_AT_name("clockSourceDivider")
    2483                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("clockSourceDivider")
    2484                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2485                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2486                    .dwattr $C$DW$163, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2487                    .dwattr $C$DW$163, DW_AT_decl_line(0xae)
    2488                    .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    2489            
    2490            $C$DW$164       .dwtag  DW_TAG_member
    2491                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$23)
    2492                    .dwattr $C$DW$164, DW_AT_name("timerPeriod")
    2493                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("timerPeriod")
    2494                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2495                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2496                    .dwattr $C$DW$164, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2497                    .dwattr $C$DW$164, DW_AT_decl_line(0xb0)
    2498                    .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    2499            
    2500            $C$DW$165       .dwtag  DW_TAG_member
    2501                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$23)
    2502                    .dwattr $C$DW$165, DW_AT_name("timerInterruptEnable_TAIE")
    2503                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2504                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2505                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2506                    .dwattr $C$DW$165, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2507                    .dwattr $C$DW$165, DW_AT_decl_line(0xb5)
    2508                    .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    2509            
    2510            $C$DW$166       .dwtag  DW_TAG_member
    2511                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$23)
    2512                    .dwattr $C$DW$166, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2513                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2514                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2515                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2516                    .dwattr $C$DW$166, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:43 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   51

    2517                    .dwattr $C$DW$166, DW_AT_decl_line(0xba)
    2518                    .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    2519            
    2520            $C$DW$167       .dwtag  DW_TAG_member
    2521                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$23)
    2522                    .dwattr $C$DW$167, DW_AT_name("timerClear")
    2523                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("timerClear")
    2524                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2525                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2526                    .dwattr $C$DW$167, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2527                    .dwattr $C$DW$167, DW_AT_decl_line(0xc0)
    2528                    .dwattr $C$DW$167, DW_AT_decl_column(0x0e)
    2529            
    2530            $C$DW$168       .dwtag  DW_TAG_member
    2531                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$26)
    2532                    .dwattr $C$DW$168, DW_AT_name("startTimer")
    2533                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("startTimer")
    2534                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2535                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2536                    .dwattr $C$DW$168, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2537                    .dwattr $C$DW$168, DW_AT_decl_line(0xc2)
    2538                    .dwattr $C$DW$168, DW_AT_decl_column(0x0a)
    2539            
    2540                    .dwattr $C$DW$T$28, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2541                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x90)
    2542                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2543                    .dwendtag $C$DW$T$28
    2544            
    2545            $C$DW$T$38      .dwtag  DW_TAG_typedef
    2546                    .dwattr $C$DW$T$38, DW_AT_name("Timer_A_initUpDownModeParam")
    2547                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$28)
    2548                    .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2549                    .dwattr $C$DW$T$38, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2550                    .dwattr $C$DW$T$38, DW_AT_decl_line(0xc3)
    2551                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    2552            
    2553            $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    2554                    .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    2555                    .dwattr $C$DW$T$39, DW_AT_address_class(0x10)
    2556            
    2557            
    2558            $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2559                    .dwattr $C$DW$T$29, DW_AT_name("Timer_A_initUpModeParam")
    2560                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x0e)
    2561            $C$DW$169       .dwtag  DW_TAG_member
    2562                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$23)
    2563                    .dwattr $C$DW$169, DW_AT_name("clockSource")
    2564                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("clockSource")
    2565                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2566                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2567                    .dwattr $C$DW$169, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2568                    .dwattr $C$DW$169, DW_AT_decl_line(0x10d)
    2569                    .dwattr $C$DW$169, DW_AT_decl_column(0x0e)
    2570            
    2571            $C$DW$170       .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:43 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   52

    2572                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$23)
    2573                    .dwattr $C$DW$170, DW_AT_name("clockSourceDivider")
    2574                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("clockSourceDivider")
    2575                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2576                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2577                    .dwattr $C$DW$170, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2578                    .dwattr $C$DW$170, DW_AT_decl_line(0x124)
    2579                    .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    2580            
    2581            $C$DW$171       .dwtag  DW_TAG_member
    2582                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$23)
    2583                    .dwattr $C$DW$171, DW_AT_name("timerPeriod")
    2584                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("timerPeriod")
    2585                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2586                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2587                    .dwattr $C$DW$171, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2588                    .dwattr $C$DW$171, DW_AT_decl_line(0x127)
    2589                    .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    2590            
    2591            $C$DW$172       .dwtag  DW_TAG_member
    2592                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$23)
    2593                    .dwattr $C$DW$172, DW_AT_name("timerInterruptEnable_TAIE")
    2594                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("timerInterruptEnable_TAIE")
    2595                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2596                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2597                    .dwattr $C$DW$172, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2598                    .dwattr $C$DW$172, DW_AT_decl_line(0x12c)
    2599                    .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    2600            
    2601            $C$DW$173       .dwtag  DW_TAG_member
    2602                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$23)
    2603                    .dwattr $C$DW$173, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
    2604                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
    2605                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2606                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2607                    .dwattr $C$DW$173, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2608                    .dwattr $C$DW$173, DW_AT_decl_line(0x131)
    2609                    .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    2610            
    2611            $C$DW$174       .dwtag  DW_TAG_member
    2612                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$23)
    2613                    .dwattr $C$DW$174, DW_AT_name("timerClear")
    2614                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("timerClear")
    2615                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2616                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2617                    .dwattr $C$DW$174, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2618                    .dwattr $C$DW$174, DW_AT_decl_line(0x137)
    2619                    .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    2620            
    2621            $C$DW$175       .dwtag  DW_TAG_member
    2622                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$26)
    2623                    .dwattr $C$DW$175, DW_AT_name("startTimer")
    2624                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("startTimer")
    2625                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2626                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:43 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   53

    2627                    .dwattr $C$DW$175, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2628                    .dwattr $C$DW$175, DW_AT_decl_line(0x139)
    2629                    .dwattr $C$DW$175, DW_AT_decl_column(0x0a)
    2630            
    2631                    .dwattr $C$DW$T$29, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2632                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x106)
    2633                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2634                    .dwendtag $C$DW$T$29
    2635            
    2636            $C$DW$T$40      .dwtag  DW_TAG_typedef
    2637                    .dwattr $C$DW$T$40, DW_AT_name("Timer_A_initUpModeParam")
    2638                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$29)
    2639                    .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    2640                    .dwattr $C$DW$T$40, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2641                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x13a)
    2642                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x03)
    2643            
    2644            $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    2645                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2646                    .dwattr $C$DW$T$41, DW_AT_address_class(0x10)
    2647            
    2648            
    2649            $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2650                    .dwattr $C$DW$T$30, DW_AT_name("Timer_A_outputPWMParam")
    2651                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x0c)
    2652            $C$DW$176       .dwtag  DW_TAG_member
    2653                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$23)
    2654                    .dwattr $C$DW$176, DW_AT_name("clockSource")
    2655                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("clockSource")
    2656                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2657                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2658                    .dwattr $C$DW$176, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2659                    .dwattr $C$DW$176, DW_AT_decl_line(0xd1)
    2660                    .dwattr $C$DW$176, DW_AT_decl_column(0x0e)
    2661            
    2662            $C$DW$177       .dwtag  DW_TAG_member
    2663                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$23)
    2664                    .dwattr $C$DW$177, DW_AT_name("clockSourceDivider")
    2665                    .dwattr $C$DW$177, DW_AT_TI_symbol_name("clockSourceDivider")
    2666                    .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2667                    .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2668                    .dwattr $C$DW$177, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2669                    .dwattr $C$DW$177, DW_AT_decl_line(0xe8)
    2670                    .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    2671            
    2672            $C$DW$178       .dwtag  DW_TAG_member
    2673                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$23)
    2674                    .dwattr $C$DW$178, DW_AT_name("timerPeriod")
    2675                    .dwattr $C$DW$178, DW_AT_TI_symbol_name("timerPeriod")
    2676                    .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2677                    .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2678                    .dwattr $C$DW$178, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2679                    .dwattr $C$DW$178, DW_AT_decl_line(0xea)
    2680                    .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    2681            
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:43 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   54

    2682            $C$DW$179       .dwtag  DW_TAG_member
    2683                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$23)
    2684                    .dwattr $C$DW$179, DW_AT_name("compareRegister")
    2685                    .dwattr $C$DW$179, DW_AT_TI_symbol_name("compareRegister")
    2686                    .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2687                    .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2688                    .dwattr $C$DW$179, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2689                    .dwattr $C$DW$179, DW_AT_decl_line(0xf1)
    2690                    .dwattr $C$DW$179, DW_AT_decl_column(0x0e)
    2691            
    2692            $C$DW$180       .dwtag  DW_TAG_member
    2693                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$23)
    2694                    .dwattr $C$DW$180, DW_AT_name("compareOutputMode")
    2695                    .dwattr $C$DW$180, DW_AT_TI_symbol_name("compareOutputMode")
    2696                    .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2697                    .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2698                    .dwattr $C$DW$180, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2699                    .dwattr $C$DW$180, DW_AT_decl_line(0xfc)
    2700                    .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    2701            
    2702            $C$DW$181       .dwtag  DW_TAG_member
    2703                    .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$23)
    2704                    .dwattr $C$DW$181, DW_AT_name("dutyCycle")
    2705                    .dwattr $C$DW$181, DW_AT_TI_symbol_name("dutyCycle")
    2706                    .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2707                    .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2708                    .dwattr $C$DW$181, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2709                    .dwattr $C$DW$181, DW_AT_decl_line(0xfe)
    2710                    .dwattr $C$DW$181, DW_AT_decl_column(0x0e)
    2711            
    2712                    .dwattr $C$DW$T$30, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2713                    .dwattr $C$DW$T$30, DW_AT_decl_line(0xca)
    2714                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    2715                    .dwendtag $C$DW$T$30
    2716            
    2717            $C$DW$T$42      .dwtag  DW_TAG_typedef
    2718                    .dwattr $C$DW$T$42, DW_AT_name("Timer_A_outputPWMParam")
    2719                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$30)
    2720                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2721                    .dwattr $C$DW$T$42, DW_AT_decl_file("..\driverlib\MSP430FR2xx_4xx\timer_a.h")
    2722                    .dwattr $C$DW$T$42, DW_AT_decl_line(0xff)
    2723                    .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
    2724            
    2725            $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    2726                    .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    2727                    .dwattr $C$DW$T$43, DW_AT_address_class(0x10)
    2728            
    2729            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2730                    .dwattr $C$DW$T$2, DW_AT_name("void")
    2731            
    2732            
    2733            $C$DW$T$56      .dwtag  DW_TAG_subroutine_type
    2734                    .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2735                    .dwendtag $C$DW$T$56
    2736            
MSP430 Assembler PC v21.6.1 Wed Nov 30 16:35:43 2022

Copyright (c) 2003-2018 Texas Instruments Incorporated
timer_a.asm                                                          PAGE   55

    2737            $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    2738                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2739                    .dwattr $C$DW$T$57, DW_AT_address_class(0x14)
    2740            
    2741            $C$DW$T$58      .dwtag  DW_TAG_typedef
    2742                    .dwattr $C$DW$T$58, DW_AT_name("__SFR_FARPTR")
    2743                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2744                    .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2745                    .dwattr $C$DW$T$58, DW_AT_decl_file("C:\ti\ccs1110\ccs\ccs_base\msp430\include\msp430fr4133.h"
    2746                    .dwattr $C$DW$T$58, DW_AT_decl_line(0x46)
    2747                    .dwattr $C$DW$T$58, DW_AT_decl_column(0x11)
    2748            
    2749            $C$DW$T$4       .dwtag  DW_TAG_base_type
    2750                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2751                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    2752                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2753            
    2754            $C$DW$T$5       .dwtag  DW_TAG_base_type
    2755                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2756                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2757                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2758            
    2759            $C$DW$T$59      .dwtag  DW_TAG_typedef
    2760                    .dwattr $C$DW$T$59, DW_AT_name("__int8_t")
    2761                    .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$5)
    2762                    .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2763                    .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    2764                    .dwattr $C$DW$T$59, DW_AT_decl_line(0x36)
