MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Jan  3 09:51:29 2023                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../main.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ccs_challengespace\MSP430_LCD_display\Debug")
      12            ;       Interrupt vector table mappings
      13 000000               .intvec ".int50",       EUSCI_A0_ISR
         000000       
      14            $C$DW$1 .dwtag  DW_TAG_variable
      15                    .dwattr $C$DW$1, DW_AT_name("UCA0IV")

     431                    .dwpsn  file "../main.c",line 109,column 13,is_stmt,isa 0
     432 000010 3C0C          JMP       $C$L4                 ; [] |109| 
     433                                                      ; [] |109| 
     434            ;* --------------------------------------------------------------------------*
     435            ;* --------------------------------------------------------------------------*
     436 000012       $C$L3:    
     437                    .dwpsn  file "../main.c",line 102,column 5,is_stmt,isa 0
     438 000012 421F          MOV.W     &UCA0IV+0,r15         ; [] |102| 
         000014 0000!
     439 000016 930F          TST.W     r15                   ; [] |102| 
     440 000018 2408          JEQ       $C$L4                 ; [] |102| 
     441                                                      ; [] |102| 
     442            ;* --------------------------------------------------------------------------*
     443 00001a 832F          SUB.W     #2,r15                ; [] |102| 
     444 00001c 27F3          JEQ       $C$L2                 ; [] |102| 
     445                                                      ; [] |102| 
     446            ;* --------------------------------------------------------------------------*
     447 00001e 832F          SUB.W     #2,r15                ; [] |102| 
     448 000020 2404          JEQ       $C$L4                 ; [] |102| 
     449                                                      ; [] |102| 
     450            ;* --------------------------------------------------------------------------*
     451 000022 832F          SUB.W     #2,r15                ; [] |102| 
     452 000024 2402          JEQ       $C$L4                 ; [] |102| 
     453                                                      ; [] |102| 
     454            ;* --------------------------------------------------------------------------*
     455 000026 832F          SUB.W     #2,r15                ; [] |102| 
     456 000028 2400          JEQ       $C$L4                 ; [] |102| 
     457                                                      ; [] |102| 
     458            ;* --------------------------------------------------------------------------*
     459                    .dwpsn  file "../main.c",line 114,column 1,is_stmt,isa 0
     460            ;* --------------------------------------------------------------------------*
     461 00002a       $C$L4:    
     462 00002a 164B          POPM.A    #5,r15                ; [] 
     463                    .dwcfi  restore_reg, 11
     464                    .dwcfi  restore_reg, 12
     465                    .dwcfi  restore_reg, 13
     466                    .dwcfi  restore_reg, 14
     467                    .dwcfi  restore_reg, 15
     468                    .dwcfi  cfa_offset, 4
     469            $C$DW$37        .dwtag  DW_TAG_TI_branch
     470                    .dwattr $C$DW$37, DW_AT_low_pc(0x00)
     471                    .dwattr $C$DW$37, DW_AT_TI_return
     472            
     473 00002c 1300          RETI      ; [] 
     474                    ; [] 
     475                    .dwattr $C$DW$34, DW_AT_TI_end_file("../main.c")
     476                    .dwattr $C$DW$34, DW_AT_TI_end_line(0x72)
     477                    .dwattr $C$DW$34, DW_AT_TI_end_column(0x01)
     478                    .dwendentry
     479                    .dwendtag $C$DW$34
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   10

     480            
     481            ;*****************************************************************************
     482            ;* UNDEFINED EXTERNAL REFERENCES                                             *
     483            ;*****************************************************************************
     484                    .global UCA0IV
     485                    .global WDT_A_hold
     486                    .global CS_initClockSignal
     487                    .global GPIO_setAsPeripheralModuleFunctionInputPin
     488                    .global PMM_unlockLPM5
     489                    .global usart0_comms_init
     490                    .global usart0_comms_clear_rx_interrupt
     491                    .global usart0_comms_enable_interrupt
     492                    .global usart0_comms_receive
     493                    .global usart0_comms_transmit
     494            
     495            ;******************************************************************************
     496            ;* BUILD ATTRIBUTES                                                           *
     497            ;******************************************************************************
     498                    .battr "TI", Tag_File, 1, Tag_LOCKIO_INFO(1)
     499                    .battr "TI", Tag_File, 1, Tag_WAITSTATE_INFO(2)
     500                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(3)
     501                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
     502                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
     503            
     504            ;******************************************************************************
     505            ;* TYPE INFORMATION                                                           *
     506            ;******************************************************************************
     507            
     508            $C$DW$T$21      .dwtag  DW_TAG_structure_type
     509                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
     510            $C$DW$38        .dwtag  DW_TAG_member
     511                    .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$14)
     512                    .dwattr $C$DW$38, DW_AT_name("__max_align1")
     513                    .dwattr $C$DW$38, DW_AT_TI_symbol_name("__max_align1")
     514                    .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     515                    .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     516                    .dwattr $C$DW$38, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     517                    .dwattr $C$DW$38, DW_AT_decl_line(0x7b)
     518                    .dwattr $C$DW$38, DW_AT_decl_column(0x0c)
     519            
     520            $C$DW$39        .dwtag  DW_TAG_member
     521                    .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$18)
     522                    .dwattr $C$DW$39, DW_AT_name("__max_align2")
     523                    .dwattr $C$DW$39, DW_AT_TI_symbol_name("__max_align2")
     524                    .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     525                    .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     526                    .dwattr $C$DW$39, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
     527                    .dwattr $C$DW$39, DW_AT_decl_line(0x7c)
     528                    .dwattr $C$DW$39, DW_AT_decl_column(0x0e)
     529            
     530                    .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     531                    .dwattr $C$DW$T$21, DW_AT_decl_line(0x7a)
     532                    .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
     533                    .dwendtag $C$DW$T$21
     534            
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   11

     535            $C$DW$T$79      .dwtag  DW_TAG_typedef
     536                    .dwattr $C$DW$T$79, DW_AT_name("__max_align_t")
     537                    .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$21)
     538                    .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
     539                    .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
     540                    .dwattr $C$DW$T$79, DW_AT_decl_line(0x7d)
     541                    .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
     542            
     543            
     544            $C$DW$T$24      .dwtag  DW_TAG_structure_type
     545                    .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     546            $C$DW$40        .dwtag  DW_TAG_member
     547                    .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$23)
     548                    .dwattr $C$DW$40, DW_AT_name("UCSWRST")
     549                    .dwattr $C$DW$40, DW_AT_TI_symbol_name("UCSWRST")
     550                    .dwattr $C$DW$40, DW_AT_bit_offset(0x07)
     551                    .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     552                    .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     553                    .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     554                    .dwattr $C$DW$40, DW_AT_decl_file("..\usart_comms.h")
     555                    .dwattr $C$DW$40, DW_AT_decl_line(0x17)
     556                    .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     557            
     558            $C$DW$41        .dwtag  DW_TAG_member
     559                    .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$23)
     560                    .dwattr $C$DW$41, DW_AT_name("UCTXBRK")
     561                    .dwattr $C$DW$41, DW_AT_TI_symbol_name("UCTXBRK")
     562                    .dwattr $C$DW$41, DW_AT_bit_offset(0x06)
     563                    .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     564                    .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     565                    .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     566                    .dwattr $C$DW$41, DW_AT_decl_file("..\usart_comms.h")
     567                    .dwattr $C$DW$41, DW_AT_decl_line(0x18)
     568                    .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     569            
     570            $C$DW$42        .dwtag  DW_TAG_member
     571                    .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$23)
     572                    .dwattr $C$DW$42, DW_AT_name("UCTXADDR")
     573                    .dwattr $C$DW$42, DW_AT_TI_symbol_name("UCTXADDR")
     574                    .dwattr $C$DW$42, DW_AT_bit_offset(0x05)
     575                    .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     576                    .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     577                    .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     578                    .dwattr $C$DW$42, DW_AT_decl_file("..\usart_comms.h")
     579                    .dwattr $C$DW$42, DW_AT_decl_line(0x19)
     580                    .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     581            
     582            $C$DW$43        .dwtag  DW_TAG_member
     583                    .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$23)
     584                    .dwattr $C$DW$43, DW_AT_name("UCDORM")
     585                    .dwattr $C$DW$43, DW_AT_TI_symbol_name("UCDORM")
     586                    .dwattr $C$DW$43, DW_AT_bit_offset(0x04)
     587                    .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     588                    .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     589                    .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   12

     590                    .dwattr $C$DW$43, DW_AT_decl_file("..\usart_comms.h")
     591                    .dwattr $C$DW$43, DW_AT_decl_line(0x1a)
     592                    .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     593            
     594            $C$DW$44        .dwtag  DW_TAG_member
     595                    .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$23)
     596                    .dwattr $C$DW$44, DW_AT_name("UCBRKIE")
     597                    .dwattr $C$DW$44, DW_AT_TI_symbol_name("UCBRKIE")
     598                    .dwattr $C$DW$44, DW_AT_bit_offset(0x03)
     599                    .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     600                    .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     601                    .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     602                    .dwattr $C$DW$44, DW_AT_decl_file("..\usart_comms.h")
     603                    .dwattr $C$DW$44, DW_AT_decl_line(0x1b)
     604                    .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     605            
     606            $C$DW$45        .dwtag  DW_TAG_member
     607                    .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$23)
     608                    .dwattr $C$DW$45, DW_AT_name("UCRXEIE")
     609                    .dwattr $C$DW$45, DW_AT_TI_symbol_name("UCRXEIE")
     610                    .dwattr $C$DW$45, DW_AT_bit_offset(0x02)
     611                    .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     612                    .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     613                    .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     614                    .dwattr $C$DW$45, DW_AT_decl_file("..\usart_comms.h")
     615                    .dwattr $C$DW$45, DW_AT_decl_line(0x1c)
     616                    .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     617            
     618            $C$DW$46        .dwtag  DW_TAG_member
     619                    .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$23)
     620                    .dwattr $C$DW$46, DW_AT_name("UCSSELx")
     621                    .dwattr $C$DW$46, DW_AT_TI_symbol_name("UCSSELx")
     622                    .dwattr $C$DW$46, DW_AT_bit_offset(0x00)
     623                    .dwattr $C$DW$46, DW_AT_bit_size(0x02)
     624                    .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     625                    .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     626                    .dwattr $C$DW$46, DW_AT_decl_file("..\usart_comms.h")
     627                    .dwattr $C$DW$46, DW_AT_decl_line(0x1d)
     628                    .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     629            
     630            $C$DW$47        .dwtag  DW_TAG_member
     631                    .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$23)
     632                    .dwattr $C$DW$47, DW_AT_name("UCSYNC")
     633                    .dwattr $C$DW$47, DW_AT_TI_symbol_name("UCSYNC")
     634                    .dwattr $C$DW$47, DW_AT_bit_offset(0x07)
     635                    .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     636                    .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     637                    .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     638                    .dwattr $C$DW$47, DW_AT_decl_file("..\usart_comms.h")
     639                    .dwattr $C$DW$47, DW_AT_decl_line(0x1e)
     640                    .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     641            
     642            $C$DW$48        .dwtag  DW_TAG_member
     643                    .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$23)
     644                    .dwattr $C$DW$48, DW_AT_name("UCMODEx")
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   13

     645                    .dwattr $C$DW$48, DW_AT_TI_symbol_name("UCMODEx")
     646                    .dwattr $C$DW$48, DW_AT_bit_offset(0x05)
     647                    .dwattr $C$DW$48, DW_AT_bit_size(0x02)
     648                    .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     649                    .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     650                    .dwattr $C$DW$48, DW_AT_decl_file("..\usart_comms.h")
     651                    .dwattr $C$DW$48, DW_AT_decl_line(0x1f)
     652                    .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     653            
     654            $C$DW$49        .dwtag  DW_TAG_member
     655                    .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$23)
     656                    .dwattr $C$DW$49, DW_AT_name("UCSPB")
     657                    .dwattr $C$DW$49, DW_AT_TI_symbol_name("UCSPB")
     658                    .dwattr $C$DW$49, DW_AT_bit_offset(0x04)
     659                    .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     660                    .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     661                    .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     662                    .dwattr $C$DW$49, DW_AT_decl_file("..\usart_comms.h")
     663                    .dwattr $C$DW$49, DW_AT_decl_line(0x20)
     664                    .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     665            
     666            $C$DW$50        .dwtag  DW_TAG_member
     667                    .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$23)
     668                    .dwattr $C$DW$50, DW_AT_name("UC7BIT")
     669                    .dwattr $C$DW$50, DW_AT_TI_symbol_name("UC7BIT")
     670                    .dwattr $C$DW$50, DW_AT_bit_offset(0x03)
     671                    .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     672                    .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     673                    .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     674                    .dwattr $C$DW$50, DW_AT_decl_file("..\usart_comms.h")
     675                    .dwattr $C$DW$50, DW_AT_decl_line(0x21)
     676                    .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     677            
     678            $C$DW$51        .dwtag  DW_TAG_member
     679                    .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$23)
     680                    .dwattr $C$DW$51, DW_AT_name("UCMSB")
     681                    .dwattr $C$DW$51, DW_AT_TI_symbol_name("UCMSB")
     682                    .dwattr $C$DW$51, DW_AT_bit_offset(0x02)
     683                    .dwattr $C$DW$51, DW_AT_bit_size(0x01)
     684                    .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     685                    .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     686                    .dwattr $C$DW$51, DW_AT_decl_file("..\usart_comms.h")
     687                    .dwattr $C$DW$51, DW_AT_decl_line(0x22)
     688                    .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     689            
     690            $C$DW$52        .dwtag  DW_TAG_member
     691                    .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$23)
     692                    .dwattr $C$DW$52, DW_AT_name("UCPAR")
     693                    .dwattr $C$DW$52, DW_AT_TI_symbol_name("UCPAR")
     694                    .dwattr $C$DW$52, DW_AT_bit_offset(0x01)
     695                    .dwattr $C$DW$52, DW_AT_bit_size(0x01)
     696                    .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     697                    .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     698                    .dwattr $C$DW$52, DW_AT_decl_file("..\usart_comms.h")
     699                    .dwattr $C$DW$52, DW_AT_decl_line(0x23)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   14

     700                    .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     701            
     702            $C$DW$53        .dwtag  DW_TAG_member
     703                    .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$23)
     704                    .dwattr $C$DW$53, DW_AT_name("UCPEN")
     705                    .dwattr $C$DW$53, DW_AT_TI_symbol_name("UCPEN")
     706                    .dwattr $C$DW$53, DW_AT_bit_offset(0x00)
     707                    .dwattr $C$DW$53, DW_AT_bit_size(0x01)
     708                    .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     709                    .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     710                    .dwattr $C$DW$53, DW_AT_decl_file("..\usart_comms.h")
     711                    .dwattr $C$DW$53, DW_AT_decl_line(0x24)
     712                    .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     713            
     714                    .dwattr $C$DW$T$24, DW_AT_decl_file("..\usart_comms.h")
     715                    .dwattr $C$DW$T$24, DW_AT_decl_line(0x16)
     716                    .dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
     717                    .dwendtag $C$DW$T$24
     718            
     719            $C$DW$T$39      .dwtag  DW_TAG_typedef
     720                    .dwattr $C$DW$T$39, DW_AT_name("UCA0CTLW0_REG")
     721                    .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$24)
     722                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
     723                    .dwattr $C$DW$T$39, DW_AT_decl_file("..\usart_comms.h")
     724                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x25)
     725                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
     726            
     727            
     728            $C$DW$T$27      .dwtag  DW_TAG_structure_type
     729                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     730            $C$DW$54        .dwtag  DW_TAG_member
     731                    .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$26)
     732                    .dwattr $C$DW$54, DW_AT_name("UCGLITx")
     733                    .dwattr $C$DW$54, DW_AT_TI_symbol_name("UCGLITx")
     734                    .dwattr $C$DW$54, DW_AT_bit_offset(0x0e)
     735                    .dwattr $C$DW$54, DW_AT_bit_size(0x02)
     736                    .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     737                    .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     738                    .dwattr $C$DW$54, DW_AT_decl_file("..\usart_comms.h")
     739                    .dwattr $C$DW$54, DW_AT_decl_line(0x2a)
     740                    .dwattr $C$DW$54, DW_AT_decl_column(0x0e)
     741            
     742            $C$DW$55        .dwtag  DW_TAG_member
     743                    .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$26)
     744                    .dwattr $C$DW$55, DW_AT_name("Reserved")
     745                    .dwattr $C$DW$55, DW_AT_TI_symbol_name("Reserved")
     746                    .dwattr $C$DW$55, DW_AT_bit_offset(0x00)
     747                    .dwattr $C$DW$55, DW_AT_bit_size(0x0e)
     748                    .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     749                    .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     750                    .dwattr $C$DW$55, DW_AT_decl_file("..\usart_comms.h")
     751                    .dwattr $C$DW$55, DW_AT_decl_line(0x2b)
     752                    .dwattr $C$DW$55, DW_AT_decl_column(0x0e)
     753            
     754            $C$DW$56        .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   15

     755                    .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$26)
     756                    .dwattr $C$DW$56, DW_AT_name("Unused")
     757                    .dwattr $C$DW$56, DW_AT_TI_symbol_name("Unused")
     758                    .dwattr $C$DW$56, DW_AT_bit_offset(0x00)
     759                    .dwattr $C$DW$56, DW_AT_bit_size(0x10)
     760                    .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     761                    .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     762                    .dwattr $C$DW$56, DW_AT_decl_file("..\usart_comms.h")
     763                    .dwattr $C$DW$56, DW_AT_decl_line(0x2c)
     764                    .dwattr $C$DW$56, DW_AT_decl_column(0x0e)
     765            
     766                    .dwattr $C$DW$T$27, DW_AT_decl_file("..\usart_comms.h")
     767                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x29)
     768                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
     769                    .dwendtag $C$DW$T$27
     770            
     771            $C$DW$T$40      .dwtag  DW_TAG_typedef
     772                    .dwattr $C$DW$T$40, DW_AT_name("UCA0CTLW1_REG")
     773                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$27)
     774                    .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     775                    .dwattr $C$DW$T$40, DW_AT_decl_file("..\usart_comms.h")
     776                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x2d)
     777                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x03)
     778            
     779            
     780            $C$DW$T$28      .dwtag  DW_TAG_structure_type
     781                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     782            $C$DW$57        .dwtag  DW_TAG_member
     783                    .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$23)
     784                    .dwattr $C$DW$57, DW_AT_name("UCRXIE")
     785                    .dwattr $C$DW$57, DW_AT_TI_symbol_name("UCRXIE")
     786                    .dwattr $C$DW$57, DW_AT_bit_offset(0x07)
     787                    .dwattr $C$DW$57, DW_AT_bit_size(0x01)
     788                    .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     789                    .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     790                    .dwattr $C$DW$57, DW_AT_decl_file("..\usart_comms.h")
     791                    .dwattr $C$DW$57, DW_AT_decl_line(0x31)
     792                    .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     793            
     794            $C$DW$58        .dwtag  DW_TAG_member
     795                    .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$23)
     796                    .dwattr $C$DW$58, DW_AT_name("UCTXIE")
     797                    .dwattr $C$DW$58, DW_AT_TI_symbol_name("UCTXIE")
     798                    .dwattr $C$DW$58, DW_AT_bit_offset(0x06)
     799                    .dwattr $C$DW$58, DW_AT_bit_size(0x01)
     800                    .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     801                    .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     802                    .dwattr $C$DW$58, DW_AT_decl_file("..\usart_comms.h")
     803                    .dwattr $C$DW$58, DW_AT_decl_line(0x32)
     804                    .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     805            
     806            $C$DW$59        .dwtag  DW_TAG_member
     807                    .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$23)
     808                    .dwattr $C$DW$59, DW_AT_name("UCSTTIE")
     809                    .dwattr $C$DW$59, DW_AT_TI_symbol_name("UCSTTIE")
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   16

     810                    .dwattr $C$DW$59, DW_AT_bit_offset(0x05)
     811                    .dwattr $C$DW$59, DW_AT_bit_size(0x01)
     812                    .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     813                    .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     814                    .dwattr $C$DW$59, DW_AT_decl_file("..\usart_comms.h")
     815                    .dwattr $C$DW$59, DW_AT_decl_line(0x33)
     816                    .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     817            
     818            $C$DW$60        .dwtag  DW_TAG_member
     819                    .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$23)
     820                    .dwattr $C$DW$60, DW_AT_name("UCTXCPTIE")
     821                    .dwattr $C$DW$60, DW_AT_TI_symbol_name("UCTXCPTIE")
     822                    .dwattr $C$DW$60, DW_AT_bit_offset(0x04)
     823                    .dwattr $C$DW$60, DW_AT_bit_size(0x01)
     824                    .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     825                    .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     826                    .dwattr $C$DW$60, DW_AT_decl_file("..\usart_comms.h")
     827                    .dwattr $C$DW$60, DW_AT_decl_line(0x34)
     828                    .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     829            
     830                    .dwattr $C$DW$T$28, DW_AT_decl_file("..\usart_comms.h")
     831                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x30)
     832                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
     833                    .dwendtag $C$DW$T$28
     834            
     835            $C$DW$T$48      .dwtag  DW_TAG_typedef
     836                    .dwattr $C$DW$T$48, DW_AT_name("UCA0IE_REG")
     837                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$28)
     838                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
     839                    .dwattr $C$DW$T$48, DW_AT_decl_file("..\usart_comms.h")
     840                    .dwattr $C$DW$T$48, DW_AT_decl_line(0x35)
     841                    .dwattr $C$DW$T$48, DW_AT_decl_column(0x02)
     842            
     843            
     844            $C$DW$T$29      .dwtag  DW_TAG_structure_type
     845                    .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     846            $C$DW$61        .dwtag  DW_TAG_member
     847                    .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$26)
     848                    .dwattr $C$DW$61, DW_AT_name("UCBRx")
     849                    .dwattr $C$DW$61, DW_AT_TI_symbol_name("UCBRx")
     850                    .dwattr $C$DW$61, DW_AT_bit_offset(0x00)
     851                    .dwattr $C$DW$61, DW_AT_bit_size(0x10)
     852                    .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     853                    .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     854                    .dwattr $C$DW$61, DW_AT_decl_file("..\usart_comms.h")
     855                    .dwattr $C$DW$61, DW_AT_decl_line(0x3a)
     856                    .dwattr $C$DW$61, DW_AT_decl_column(0x0e)
     857            
     858                    .dwattr $C$DW$T$29, DW_AT_decl_file("..\usart_comms.h")
     859                    .dwattr $C$DW$T$29, DW_AT_decl_line(0x38)
     860                    .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
     861                    .dwendtag $C$DW$T$29
     862            
     863            $C$DW$T$41      .dwtag  DW_TAG_typedef
     864                    .dwattr $C$DW$T$41, DW_AT_name("UCA0BRW_REG")
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   17

     865                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$29)
     866                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
     867                    .dwattr $C$DW$T$41, DW_AT_decl_file("..\usart_comms.h")
     868                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x3b)
     869                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x02)
     870            
     871            
     872            $C$DW$T$30      .dwtag  DW_TAG_structure_type
     873                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     874            $C$DW$62        .dwtag  DW_TAG_member
     875                    .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$23)
     876                    .dwattr $C$DW$62, DW_AT_name("UCOS16")
     877                    .dwattr $C$DW$62, DW_AT_TI_symbol_name("UCOS16")
     878                    .dwattr $C$DW$62, DW_AT_bit_offset(0x07)
     879                    .dwattr $C$DW$62, DW_AT_bit_size(0x01)
     880                    .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     881                    .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     882                    .dwattr $C$DW$62, DW_AT_decl_file("..\usart_comms.h")
     883                    .dwattr $C$DW$62, DW_AT_decl_line(0x3f)
     884                    .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     885            
     886            $C$DW$63        .dwtag  DW_TAG_member
     887                    .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$23)
     888                    .dwattr $C$DW$63, DW_AT_name("RESERVED")
     889                    .dwattr $C$DW$63, DW_AT_TI_symbol_name("RESERVED")
     890                    .dwattr $C$DW$63, DW_AT_bit_offset(0x04)
     891                    .dwattr $C$DW$63, DW_AT_bit_size(0x03)
     892                    .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     893                    .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     894                    .dwattr $C$DW$63, DW_AT_decl_file("..\usart_comms.h")
     895                    .dwattr $C$DW$63, DW_AT_decl_line(0x40)
     896                    .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     897            
     898            $C$DW$64        .dwtag  DW_TAG_member
     899                    .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$23)
     900                    .dwattr $C$DW$64, DW_AT_name("UCBRFx")
     901                    .dwattr $C$DW$64, DW_AT_TI_symbol_name("UCBRFx")
     902                    .dwattr $C$DW$64, DW_AT_bit_offset(0x00)
     903                    .dwattr $C$DW$64, DW_AT_bit_size(0x04)
     904                    .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     905                    .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     906                    .dwattr $C$DW$64, DW_AT_decl_file("..\usart_comms.h")
     907                    .dwattr $C$DW$64, DW_AT_decl_line(0x41)
     908                    .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     909            
     910            $C$DW$65        .dwtag  DW_TAG_member
     911                    .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$23)
     912                    .dwattr $C$DW$65, DW_AT_name("UCBRSx")
     913                    .dwattr $C$DW$65, DW_AT_TI_symbol_name("UCBRSx")
     914                    .dwattr $C$DW$65, DW_AT_bit_offset(0x00)
     915                    .dwattr $C$DW$65, DW_AT_bit_size(0x08)
     916                    .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     917                    .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     918                    .dwattr $C$DW$65, DW_AT_decl_file("..\usart_comms.h")
     919                    .dwattr $C$DW$65, DW_AT_decl_line(0x42)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   18

     920                    .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     921            
     922                    .dwattr $C$DW$T$30, DW_AT_decl_file("..\usart_comms.h")
     923                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x3e)
     924                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
     925                    .dwendtag $C$DW$T$30
     926            
     927            $C$DW$T$42      .dwtag  DW_TAG_typedef
     928                    .dwattr $C$DW$T$42, DW_AT_name("UCA0MCTLW_REG")
     929                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$30)
     930                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
     931                    .dwattr $C$DW$T$42, DW_AT_decl_file("..\usart_comms.h")
     932                    .dwattr $C$DW$T$42, DW_AT_decl_line(0x43)
     933                    .dwattr $C$DW$T$42, DW_AT_decl_column(0x02)
     934            
     935            
     936            $C$DW$T$32      .dwtag  DW_TAG_structure_type
     937                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
     938            $C$DW$66        .dwtag  DW_TAG_member
     939                    .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$26)
     940                    .dwattr $C$DW$66, DW_AT_name("UCBUSY")
     941                    .dwattr $C$DW$66, DW_AT_TI_symbol_name("UCBUSY")
     942                    .dwattr $C$DW$66, DW_AT_bit_offset(0x0f)
     943                    .dwattr $C$DW$66, DW_AT_bit_size(0x01)
     944                    .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     945                    .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     946                    .dwattr $C$DW$66, DW_AT_decl_file("..\usart_comms.h")
     947                    .dwattr $C$DW$66, DW_AT_decl_line(0x47)
     948                    .dwattr $C$DW$66, DW_AT_decl_column(0x0f)
     949            
     950            $C$DW$67        .dwtag  DW_TAG_member
     951                    .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$26)
     952                    .dwattr $C$DW$67, DW_AT_name("UCADDR")
     953                    .dwattr $C$DW$67, DW_AT_TI_symbol_name("UCADDR")
     954                    .dwattr $C$DW$67, DW_AT_bit_offset(0x0e)
     955                    .dwattr $C$DW$67, DW_AT_bit_size(0x01)
     956                    .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     957                    .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     958                    .dwattr $C$DW$67, DW_AT_decl_file("..\usart_comms.h")
     959                    .dwattr $C$DW$67, DW_AT_decl_line(0x48)
     960                    .dwattr $C$DW$67, DW_AT_decl_column(0x0f)
     961            
     962            $C$DW$68        .dwtag  DW_TAG_member
     963                    .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$26)
     964                    .dwattr $C$DW$68, DW_AT_name("UCRXERR")
     965                    .dwattr $C$DW$68, DW_AT_TI_symbol_name("UCRXERR")
     966                    .dwattr $C$DW$68, DW_AT_bit_offset(0x0d)
     967                    .dwattr $C$DW$68, DW_AT_bit_size(0x01)
     968                    .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     969                    .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     970                    .dwattr $C$DW$68, DW_AT_decl_file("..\usart_comms.h")
     971                    .dwattr $C$DW$68, DW_AT_decl_line(0x49)
     972                    .dwattr $C$DW$68, DW_AT_decl_column(0x0f)
     973            
     974            $C$DW$69        .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   19

     975                    .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$26)
     976                    .dwattr $C$DW$69, DW_AT_name("UCBRK")
     977                    .dwattr $C$DW$69, DW_AT_TI_symbol_name("UCBRK")
     978                    .dwattr $C$DW$69, DW_AT_bit_offset(0x0c)
     979                    .dwattr $C$DW$69, DW_AT_bit_size(0x01)
     980                    .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                    .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     982                    .dwattr $C$DW$69, DW_AT_decl_file("..\usart_comms.h")
     983                    .dwattr $C$DW$69, DW_AT_decl_line(0x4a)
     984                    .dwattr $C$DW$69, DW_AT_decl_column(0x0f)
     985            
     986            $C$DW$70        .dwtag  DW_TAG_member
     987                    .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$26)
     988                    .dwattr $C$DW$70, DW_AT_name("UCPE")
     989                    .dwattr $C$DW$70, DW_AT_TI_symbol_name("UCPE")
     990                    .dwattr $C$DW$70, DW_AT_bit_offset(0x0b)
     991                    .dwattr $C$DW$70, DW_AT_bit_size(0x01)
     992                    .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                    .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     994                    .dwattr $C$DW$70, DW_AT_decl_file("..\usart_comms.h")
     995                    .dwattr $C$DW$70, DW_AT_decl_line(0x4b)
     996                    .dwattr $C$DW$70, DW_AT_decl_column(0x0f)
     997            
     998            $C$DW$71        .dwtag  DW_TAG_member
     999                    .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$26)
    1000                    .dwattr $C$DW$71, DW_AT_name("UCOE")
    1001                    .dwattr $C$DW$71, DW_AT_TI_symbol_name("UCOE")
    1002                    .dwattr $C$DW$71, DW_AT_bit_offset(0x0a)
    1003                    .dwattr $C$DW$71, DW_AT_bit_size(0x01)
    1004                    .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1005                    .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1006                    .dwattr $C$DW$71, DW_AT_decl_file("..\usart_comms.h")
    1007                    .dwattr $C$DW$71, DW_AT_decl_line(0x4c)
    1008                    .dwattr $C$DW$71, DW_AT_decl_column(0x0f)
    1009            
    1010            $C$DW$72        .dwtag  DW_TAG_member
    1011                    .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$26)
    1012                    .dwattr $C$DW$72, DW_AT_name("UCFE")
    1013                    .dwattr $C$DW$72, DW_AT_TI_symbol_name("UCFE")
    1014                    .dwattr $C$DW$72, DW_AT_bit_offset(0x09)
    1015                    .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1016                    .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                    .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1018                    .dwattr $C$DW$72, DW_AT_decl_file("..\usart_comms.h")
    1019                    .dwattr $C$DW$72, DW_AT_decl_line(0x4d)
    1020                    .dwattr $C$DW$72, DW_AT_decl_column(0x0f)
    1021            
    1022            $C$DW$73        .dwtag  DW_TAG_member
    1023                    .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$26)
    1024                    .dwattr $C$DW$73, DW_AT_name("UCLISTEN")
    1025                    .dwattr $C$DW$73, DW_AT_TI_symbol_name("UCLISTEN")
    1026                    .dwattr $C$DW$73, DW_AT_bit_offset(0x08)
    1027                    .dwattr $C$DW$73, DW_AT_bit_size(0x01)
    1028                    .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1029                    .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   20

    1030                    .dwattr $C$DW$73, DW_AT_decl_file("..\usart_comms.h")
    1031                    .dwattr $C$DW$73, DW_AT_decl_line(0x4e)
    1032                    .dwattr $C$DW$73, DW_AT_decl_column(0x0f)
    1033            
    1034            $C$DW$74        .dwtag  DW_TAG_member
    1035                    .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$31)
    1036                    .dwattr $C$DW$74, DW_AT_name("RESERVED")
    1037                    .dwattr $C$DW$74, DW_AT_TI_symbol_name("RESERVED")
    1038                    .dwattr $C$DW$74, DW_AT_bit_offset(0x00)
    1039                    .dwattr $C$DW$74, DW_AT_bit_size(0x08)
    1040                    .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1041                    .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1042                    .dwattr $C$DW$74, DW_AT_decl_file("..\usart_comms.h")
    1043                    .dwattr $C$DW$74, DW_AT_decl_line(0x4f)
    1044                    .dwattr $C$DW$74, DW_AT_decl_column(0x15)
    1045            
    1046                    .dwattr $C$DW$T$32, DW_AT_decl_file("..\usart_comms.h")
    1047                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x46)
    1048                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    1049                    .dwendtag $C$DW$T$32
    1050            
    1051            $C$DW$T$43      .dwtag  DW_TAG_typedef
    1052                    .dwattr $C$DW$T$43, DW_AT_name("UCA0STATW_REG")
    1053                    .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$32)
    1054                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1055                    .dwattr $C$DW$T$43, DW_AT_decl_file("..\usart_comms.h")
    1056                    .dwattr $C$DW$T$43, DW_AT_decl_line(0x50)
    1057                    .dwattr $C$DW$T$43, DW_AT_decl_column(0x02)
    1058            
    1059            
    1060            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1061                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1062            $C$DW$75        .dwtag  DW_TAG_member
    1063                    .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$23)
    1064                    .dwattr $C$DW$75, DW_AT_name("UCTXBUFx")
    1065                    .dwattr $C$DW$75, DW_AT_TI_symbol_name("UCTXBUFx")
    1066                    .dwattr $C$DW$75, DW_AT_bit_offset(0x00)
    1067                    .dwattr $C$DW$75, DW_AT_bit_size(0x08)
    1068                    .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1069                    .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1070                    .dwattr $C$DW$75, DW_AT_decl_file("..\usart_comms.h")
    1071                    .dwattr $C$DW$75, DW_AT_decl_line(0x54)
    1072                    .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1073            
    1074                    .dwattr $C$DW$T$33, DW_AT_decl_file("..\usart_comms.h")
    1075                    .dwattr $C$DW$T$33, DW_AT_decl_line(0x53)
    1076                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    1077                    .dwendtag $C$DW$T$33
    1078            
    1079            $C$DW$T$45      .dwtag  DW_TAG_typedef
    1080                    .dwattr $C$DW$T$45, DW_AT_name("UCA0TXBUF_REG")
    1081                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$33)
    1082                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1083                    .dwattr $C$DW$T$45, DW_AT_decl_file("..\usart_comms.h")
    1084                    .dwattr $C$DW$T$45, DW_AT_decl_line(0x55)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   21

    1085                    .dwattr $C$DW$T$45, DW_AT_decl_column(0x02)
    1086            
    1087            
    1088            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1089                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1090            $C$DW$76        .dwtag  DW_TAG_member
    1091                    .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$23)
    1092                    .dwattr $C$DW$76, DW_AT_name("UCRXBUFx")
    1093                    .dwattr $C$DW$76, DW_AT_TI_symbol_name("UCRXBUFx")
    1094                    .dwattr $C$DW$76, DW_AT_bit_offset(0x00)
    1095                    .dwattr $C$DW$76, DW_AT_bit_size(0x08)
    1096                    .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097                    .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1098                    .dwattr $C$DW$76, DW_AT_decl_file("..\usart_comms.h")
    1099                    .dwattr $C$DW$76, DW_AT_decl_line(0x59)
    1100                    .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1101            
    1102                    .dwattr $C$DW$T$34, DW_AT_decl_file("..\usart_comms.h")
    1103                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x58)
    1104                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    1105                    .dwendtag $C$DW$T$34
    1106            
    1107            $C$DW$T$44      .dwtag  DW_TAG_typedef
    1108                    .dwattr $C$DW$T$44, DW_AT_name("UCA0RXBUF_REG")
    1109                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$34)
    1110                    .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1111                    .dwattr $C$DW$T$44, DW_AT_decl_file("..\usart_comms.h")
    1112                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x5a)
    1113                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x02)
    1114            
    1115            
    1116            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1117                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1118            $C$DW$77        .dwtag  DW_TAG_member
    1119                    .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$23)
    1120                    .dwattr $C$DW$77, DW_AT_name("UCABDEN")
    1121                    .dwattr $C$DW$77, DW_AT_TI_symbol_name("UCABDEN")
    1122                    .dwattr $C$DW$77, DW_AT_bit_offset(0x07)
    1123                    .dwattr $C$DW$77, DW_AT_bit_size(0x01)
    1124                    .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1125                    .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1126                    .dwattr $C$DW$77, DW_AT_decl_file("..\usart_comms.h")
    1127                    .dwattr $C$DW$77, DW_AT_decl_line(0x5e)
    1128                    .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1129            
    1130            $C$DW$78        .dwtag  DW_TAG_member
    1131                    .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$23)
    1132                    .dwattr $C$DW$78, DW_AT_name("Reserved")
    1133                    .dwattr $C$DW$78, DW_AT_TI_symbol_name("Reserved")
    1134                    .dwattr $C$DW$78, DW_AT_bit_offset(0x06)
    1135                    .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1136                    .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1137                    .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1138                    .dwattr $C$DW$78, DW_AT_decl_file("..\usart_comms.h")
    1139                    .dwattr $C$DW$78, DW_AT_decl_line(0x5f)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   22

    1140                    .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1141            
    1142            $C$DW$79        .dwtag  DW_TAG_member
    1143                    .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$23)
    1144                    .dwattr $C$DW$79, DW_AT_name("UCBTOE")
    1145                    .dwattr $C$DW$79, DW_AT_TI_symbol_name("UCBTOE")
    1146                    .dwattr $C$DW$79, DW_AT_bit_offset(0x05)
    1147                    .dwattr $C$DW$79, DW_AT_bit_size(0x01)
    1148                    .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1149                    .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1150                    .dwattr $C$DW$79, DW_AT_decl_file("..\usart_comms.h")
    1151                    .dwattr $C$DW$79, DW_AT_decl_line(0x60)
    1152                    .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1153            
    1154            $C$DW$80        .dwtag  DW_TAG_member
    1155                    .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$23)
    1156                    .dwattr $C$DW$80, DW_AT_name("UCSTOE")
    1157                    .dwattr $C$DW$80, DW_AT_TI_symbol_name("UCSTOE")
    1158                    .dwattr $C$DW$80, DW_AT_bit_offset(0x04)
    1159                    .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1160                    .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1161                    .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1162                    .dwattr $C$DW$80, DW_AT_decl_file("..\usart_comms.h")
    1163                    .dwattr $C$DW$80, DW_AT_decl_line(0x61)
    1164                    .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1165            
    1166            $C$DW$81        .dwtag  DW_TAG_member
    1167                    .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$23)
    1168                    .dwattr $C$DW$81, DW_AT_name("UCDELIMx")
    1169                    .dwattr $C$DW$81, DW_AT_TI_symbol_name("UCDELIMx")
    1170                    .dwattr $C$DW$81, DW_AT_bit_offset(0x02)
    1171                    .dwattr $C$DW$81, DW_AT_bit_size(0x02)
    1172                    .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1173                    .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1174                    .dwattr $C$DW$81, DW_AT_decl_file("..\usart_comms.h")
    1175                    .dwattr $C$DW$81, DW_AT_decl_line(0x62)
    1176                    .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1177            
    1178            $C$DW$82        .dwtag  DW_TAG_member
    1179                    .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$26)
    1180                    .dwattr $C$DW$82, DW_AT_name("RESERVED")
    1181                    .dwattr $C$DW$82, DW_AT_TI_symbol_name("RESERVED")
    1182                    .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1183                    .dwattr $C$DW$82, DW_AT_bit_size(0x0a)
    1184                    .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1185                    .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1186                    .dwattr $C$DW$82, DW_AT_decl_file("..\usart_comms.h")
    1187                    .dwattr $C$DW$82, DW_AT_decl_line(0x63)
    1188                    .dwattr $C$DW$82, DW_AT_decl_column(0x0e)
    1189            
    1190                    .dwattr $C$DW$T$35, DW_AT_decl_file("..\usart_comms.h")
    1191                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x5d)
    1192                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    1193                    .dwendtag $C$DW$T$35
    1194            
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   23

    1195            $C$DW$T$46      .dwtag  DW_TAG_typedef
    1196                    .dwattr $C$DW$T$46, DW_AT_name("UCA0ABCTL_REG")
    1197                    .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$35)
    1198                    .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1199                    .dwattr $C$DW$T$46, DW_AT_decl_file("..\usart_comms.h")
    1200                    .dwattr $C$DW$T$46, DW_AT_decl_line(0x64)
    1201                    .dwattr $C$DW$T$46, DW_AT_decl_column(0x02)
    1202            
    1203            
    1204            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1205                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1206            $C$DW$83        .dwtag  DW_TAG_member
    1207                    .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$23)
    1208                    .dwattr $C$DW$83, DW_AT_name("UCIREN")
    1209                    .dwattr $C$DW$83, DW_AT_TI_symbol_name("UCIREN")
    1210                    .dwattr $C$DW$83, DW_AT_bit_offset(0x07)
    1211                    .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1212                    .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213                    .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1214                    .dwattr $C$DW$83, DW_AT_decl_file("..\usart_comms.h")
    1215                    .dwattr $C$DW$83, DW_AT_decl_line(0x68)
    1216                    .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1217            
    1218            $C$DW$84        .dwtag  DW_TAG_member
    1219                    .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$23)
    1220                    .dwattr $C$DW$84, DW_AT_name("UCIRTXCLK")
    1221                    .dwattr $C$DW$84, DW_AT_TI_symbol_name("UCIRTXCLK")
    1222                    .dwattr $C$DW$84, DW_AT_bit_offset(0x06)
    1223                    .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1224                    .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225                    .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1226                    .dwattr $C$DW$84, DW_AT_decl_file("..\usart_comms.h")
    1227                    .dwattr $C$DW$84, DW_AT_decl_line(0x69)
    1228                    .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1229            
    1230            $C$DW$85        .dwtag  DW_TAG_member
    1231                    .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$23)
    1232                    .dwattr $C$DW$85, DW_AT_name("UCIRTXPLx")
    1233                    .dwattr $C$DW$85, DW_AT_TI_symbol_name("UCIRTXPLx")
    1234                    .dwattr $C$DW$85, DW_AT_bit_offset(0x00)
    1235                    .dwattr $C$DW$85, DW_AT_bit_size(0x06)
    1236                    .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1237                    .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1238                    .dwattr $C$DW$85, DW_AT_decl_file("..\usart_comms.h")
    1239                    .dwattr $C$DW$85, DW_AT_decl_line(0x6a)
    1240                    .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1241            
    1242            $C$DW$86        .dwtag  DW_TAG_member
    1243                    .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$23)
    1244                    .dwattr $C$DW$86, DW_AT_name("UCIRRXFE")
    1245                    .dwattr $C$DW$86, DW_AT_TI_symbol_name("UCIRRXFE")
    1246                    .dwattr $C$DW$86, DW_AT_bit_offset(0x07)
    1247                    .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    1248                    .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1249                    .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   24

    1250                    .dwattr $C$DW$86, DW_AT_decl_file("..\usart_comms.h")
    1251                    .dwattr $C$DW$86, DW_AT_decl_line(0x6b)
    1252                    .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1253            
    1254            $C$DW$87        .dwtag  DW_TAG_member
    1255                    .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$23)
    1256                    .dwattr $C$DW$87, DW_AT_name("UCIRRXPL")
    1257                    .dwattr $C$DW$87, DW_AT_TI_symbol_name("UCIRRXPL")
    1258                    .dwattr $C$DW$87, DW_AT_bit_offset(0x06)
    1259                    .dwattr $C$DW$87, DW_AT_bit_size(0x01)
    1260                    .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1261                    .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1262                    .dwattr $C$DW$87, DW_AT_decl_file("..\usart_comms.h")
    1263                    .dwattr $C$DW$87, DW_AT_decl_line(0x6c)
    1264                    .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1265            
    1266            $C$DW$88        .dwtag  DW_TAG_member
    1267                    .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$23)
    1268                    .dwattr $C$DW$88, DW_AT_name("UCIRRXFLx")
    1269                    .dwattr $C$DW$88, DW_AT_TI_symbol_name("UCIRRXFLx")
    1270                    .dwattr $C$DW$88, DW_AT_bit_offset(0x00)
    1271                    .dwattr $C$DW$88, DW_AT_bit_size(0x06)
    1272                    .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1273                    .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1274                    .dwattr $C$DW$88, DW_AT_decl_file("..\usart_comms.h")
    1275                    .dwattr $C$DW$88, DW_AT_decl_line(0x6d)
    1276                    .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1277            
    1278                    .dwattr $C$DW$T$36, DW_AT_decl_file("..\usart_comms.h")
    1279                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x67)
    1280                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    1281                    .dwendtag $C$DW$T$36
    1282            
    1283            $C$DW$T$47      .dwtag  DW_TAG_typedef
    1284                    .dwattr $C$DW$T$47, DW_AT_name("UCA0IRCTL_REG")
    1285                    .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$36)
    1286                    .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1287                    .dwattr $C$DW$T$47, DW_AT_decl_file("..\usart_comms.h")
    1288                    .dwattr $C$DW$T$47, DW_AT_decl_line(0x6e)
    1289                    .dwattr $C$DW$T$47, DW_AT_decl_column(0x02)
    1290            
    1291            
    1292            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1293                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1294            $C$DW$89        .dwtag  DW_TAG_member
    1295                    .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$26)
    1296                    .dwattr $C$DW$89, DW_AT_name("UCIVx")
    1297                    .dwattr $C$DW$89, DW_AT_TI_symbol_name("UCIVx")
    1298                    .dwattr $C$DW$89, DW_AT_bit_offset(0x00)
    1299                    .dwattr $C$DW$89, DW_AT_bit_size(0x10)
    1300                    .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1301                    .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1302                    .dwattr $C$DW$89, DW_AT_decl_file("..\usart_comms.h")
    1303                    .dwattr $C$DW$89, DW_AT_decl_line(0x72)
    1304                    .dwattr $C$DW$89, DW_AT_decl_column(0x0e)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   25

    1305            
    1306                    .dwattr $C$DW$T$37, DW_AT_decl_file("..\usart_comms.h")
    1307                    .dwattr $C$DW$T$37, DW_AT_decl_line(0x71)
    1308                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    1309                    .dwendtag $C$DW$T$37
    1310            
    1311            $C$DW$T$50      .dwtag  DW_TAG_typedef
    1312                    .dwattr $C$DW$T$50, DW_AT_name("UCA0IV_REG")
    1313                    .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$37)
    1314                    .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    1315                    .dwattr $C$DW$T$50, DW_AT_decl_file("..\usart_comms.h")
    1316                    .dwattr $C$DW$T$50, DW_AT_decl_line(0x73)
    1317                    .dwattr $C$DW$T$50, DW_AT_decl_column(0x02)
    1318            
    1319            
    1320            $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1321                    .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1322            $C$DW$90        .dwtag  DW_TAG_member
    1323                    .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$23)
    1324                    .dwattr $C$DW$90, DW_AT_name("UCRXIFG")
    1325                    .dwattr $C$DW$90, DW_AT_TI_symbol_name("UCRXIFG")
    1326                    .dwattr $C$DW$90, DW_AT_bit_offset(0x07)
    1327                    .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1328                    .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1329                    .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1330                    .dwattr $C$DW$90, DW_AT_decl_file("..\usart_comms.h")
    1331                    .dwattr $C$DW$90, DW_AT_decl_line(0x77)
    1332                    .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1333            
    1334            $C$DW$91        .dwtag  DW_TAG_member
    1335                    .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$23)
    1336                    .dwattr $C$DW$91, DW_AT_name("UCTXIFG")
    1337                    .dwattr $C$DW$91, DW_AT_TI_symbol_name("UCTXIFG")
    1338                    .dwattr $C$DW$91, DW_AT_bit_offset(0x06)
    1339                    .dwattr $C$DW$91, DW_AT_bit_size(0x01)
    1340                    .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1341                    .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1342                    .dwattr $C$DW$91, DW_AT_decl_file("..\usart_comms.h")
    1343                    .dwattr $C$DW$91, DW_AT_decl_line(0x78)
    1344                    .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1345            
    1346            $C$DW$92        .dwtag  DW_TAG_member
    1347                    .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$23)
    1348                    .dwattr $C$DW$92, DW_AT_name("UCSTTIFG")
    1349                    .dwattr $C$DW$92, DW_AT_TI_symbol_name("UCSTTIFG")
    1350                    .dwattr $C$DW$92, DW_AT_bit_offset(0x05)
    1351                    .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1352                    .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353                    .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1354                    .dwattr $C$DW$92, DW_AT_decl_file("..\usart_comms.h")
    1355                    .dwattr $C$DW$92, DW_AT_decl_line(0x79)
    1356                    .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1357            
    1358            $C$DW$93        .dwtag  DW_TAG_member
    1359                    .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$23)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   26

    1360                    .dwattr $C$DW$93, DW_AT_name("UCTXCPTIFG")
    1361                    .dwattr $C$DW$93, DW_AT_TI_symbol_name("UCTXCPTIFG")
    1362                    .dwattr $C$DW$93, DW_AT_bit_offset(0x04)
    1363                    .dwattr $C$DW$93, DW_AT_bit_size(0x01)
    1364                    .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1365                    .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1366                    .dwattr $C$DW$93, DW_AT_decl_file("..\usart_comms.h")
    1367                    .dwattr $C$DW$93, DW_AT_decl_line(0x7a)
    1368                    .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1369            
    1370                    .dwattr $C$DW$T$38, DW_AT_decl_file("..\usart_comms.h")
    1371                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x76)
    1372                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    1373                    .dwendtag $C$DW$T$38
    1374            
    1375            $C$DW$T$49      .dwtag  DW_TAG_typedef
    1376                    .dwattr $C$DW$T$49, DW_AT_name("UCA0IFG_REG")
    1377                    .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    1378                    .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1379                    .dwattr $C$DW$T$49, DW_AT_decl_file("..\usart_comms.h")
    1380                    .dwattr $C$DW$T$49, DW_AT_decl_line(0x7b)
    1381                    .dwattr $C$DW$T$49, DW_AT_decl_column(0x02)
    1382            
    1383            
    1384            $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1385                    .dwattr $C$DW$T$51, DW_AT_byte_size(0x16)
    1386            $C$DW$94        .dwtag  DW_TAG_member
    1387                    .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$39)
    1388                    .dwattr $C$DW$94, DW_AT_name("CTLW0")
    1389                    .dwattr $C$DW$94, DW_AT_TI_symbol_name("CTLW0")
    1390                    .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                    .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1392                    .dwattr $C$DW$94, DW_AT_decl_file("..\usart_comms.h")
    1393                    .dwattr $C$DW$94, DW_AT_decl_line(0x7f)
    1394                    .dwattr $C$DW$94, DW_AT_decl_column(0x13)
    1395            
    1396            $C$DW$95        .dwtag  DW_TAG_member
    1397                    .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$40)
    1398                    .dwattr $C$DW$95, DW_AT_name("CLTW1")
    1399                    .dwattr $C$DW$95, DW_AT_TI_symbol_name("CLTW1")
    1400                    .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1401                    .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1402                    .dwattr $C$DW$95, DW_AT_decl_file("..\usart_comms.h")
    1403                    .dwattr $C$DW$95, DW_AT_decl_line(0x80)
    1404                    .dwattr $C$DW$95, DW_AT_decl_column(0x13)
    1405            
    1406            $C$DW$96        .dwtag  DW_TAG_member
    1407                    .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$41)
    1408                    .dwattr $C$DW$96, DW_AT_name("BRW")
    1409                    .dwattr $C$DW$96, DW_AT_TI_symbol_name("BRW")
    1410                    .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1411                    .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1412                    .dwattr $C$DW$96, DW_AT_decl_file("..\usart_comms.h")
    1413                    .dwattr $C$DW$96, DW_AT_decl_line(0x81)
    1414                    .dwattr $C$DW$96, DW_AT_decl_column(0x13)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   27

    1415            
    1416            $C$DW$97        .dwtag  DW_TAG_member
    1417                    .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$42)
    1418                    .dwattr $C$DW$97, DW_AT_name("MCTLW")
    1419                    .dwattr $C$DW$97, DW_AT_TI_symbol_name("MCTLW")
    1420                    .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1421                    .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1422                    .dwattr $C$DW$97, DW_AT_decl_file("..\usart_comms.h")
    1423                    .dwattr $C$DW$97, DW_AT_decl_line(0x82)
    1424                    .dwattr $C$DW$97, DW_AT_decl_column(0x13)
    1425            
    1426            $C$DW$98        .dwtag  DW_TAG_member
    1427                    .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$43)
    1428                    .dwattr $C$DW$98, DW_AT_name("STATW")
    1429                    .dwattr $C$DW$98, DW_AT_TI_symbol_name("STATW")
    1430                    .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1431                    .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1432                    .dwattr $C$DW$98, DW_AT_decl_file("..\usart_comms.h")
    1433                    .dwattr $C$DW$98, DW_AT_decl_line(0x83)
    1434                    .dwattr $C$DW$98, DW_AT_decl_column(0x13)
    1435            
    1436            $C$DW$99        .dwtag  DW_TAG_member
    1437                    .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$44)
    1438                    .dwattr $C$DW$99, DW_AT_name("RXBUF")
    1439                    .dwattr $C$DW$99, DW_AT_TI_symbol_name("RXBUF")
    1440                    .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1441                    .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1442                    .dwattr $C$DW$99, DW_AT_decl_file("..\usart_comms.h")
    1443                    .dwattr $C$DW$99, DW_AT_decl_line(0x84)
    1444                    .dwattr $C$DW$99, DW_AT_decl_column(0x13)
    1445            
    1446            $C$DW$100       .dwtag  DW_TAG_member
    1447                    .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$45)
    1448                    .dwattr $C$DW$100, DW_AT_name("TXBUF")
    1449                    .dwattr $C$DW$100, DW_AT_TI_symbol_name("TXBUF")
    1450                    .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1451                    .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1452                    .dwattr $C$DW$100, DW_AT_decl_file("..\usart_comms.h")
    1453                    .dwattr $C$DW$100, DW_AT_decl_line(0x85)
    1454                    .dwattr $C$DW$100, DW_AT_decl_column(0x13)
    1455            
    1456            $C$DW$101       .dwtag  DW_TAG_member
    1457                    .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$46)
    1458                    .dwattr $C$DW$101, DW_AT_name("ABCTL")
    1459                    .dwattr $C$DW$101, DW_AT_TI_symbol_name("ABCTL")
    1460                    .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1461                    .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1462                    .dwattr $C$DW$101, DW_AT_decl_file("..\usart_comms.h")
    1463                    .dwattr $C$DW$101, DW_AT_decl_line(0x86)
    1464                    .dwattr $C$DW$101, DW_AT_decl_column(0x13)
    1465            
    1466            $C$DW$102       .dwtag  DW_TAG_member
    1467                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$47)
    1468                    .dwattr $C$DW$102, DW_AT_name("IRCTL")
    1469                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("IRCTL")
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   28

    1470                    .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1471                    .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1472                    .dwattr $C$DW$102, DW_AT_decl_file("..\usart_comms.h")
    1473                    .dwattr $C$DW$102, DW_AT_decl_line(0x87)
    1474                    .dwattr $C$DW$102, DW_AT_decl_column(0x13)
    1475            
    1476            $C$DW$103       .dwtag  DW_TAG_member
    1477                    .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$48)
    1478                    .dwattr $C$DW$103, DW_AT_name("IE")
    1479                    .dwattr $C$DW$103, DW_AT_TI_symbol_name("IE")
    1480                    .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1481                    .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1482                    .dwattr $C$DW$103, DW_AT_decl_file("..\usart_comms.h")
    1483                    .dwattr $C$DW$103, DW_AT_decl_line(0x88)
    1484                    .dwattr $C$DW$103, DW_AT_decl_column(0x13)
    1485            
    1486            $C$DW$104       .dwtag  DW_TAG_member
    1487                    .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$49)
    1488                    .dwattr $C$DW$104, DW_AT_name("IFG")
    1489                    .dwattr $C$DW$104, DW_AT_TI_symbol_name("IFG")
    1490                    .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1491                    .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1492                    .dwattr $C$DW$104, DW_AT_decl_file("..\usart_comms.h")
    1493                    .dwattr $C$DW$104, DW_AT_decl_line(0x89)
    1494                    .dwattr $C$DW$104, DW_AT_decl_column(0x13)
    1495            
    1496            $C$DW$105       .dwtag  DW_TAG_member
    1497                    .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$50)
    1498                    .dwattr $C$DW$105, DW_AT_name("IV")
    1499                    .dwattr $C$DW$105, DW_AT_TI_symbol_name("IV")
    1500                    .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1501                    .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1502                    .dwattr $C$DW$105, DW_AT_decl_file("..\usart_comms.h")
    1503                    .dwattr $C$DW$105, DW_AT_decl_line(0x8a)
    1504                    .dwattr $C$DW$105, DW_AT_decl_column(0x13)
    1505            
    1506                    .dwattr $C$DW$T$51, DW_AT_decl_file("..\usart_comms.h")
    1507                    .dwattr $C$DW$T$51, DW_AT_decl_line(0x7e)
    1508                    .dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
    1509                    .dwendtag $C$DW$T$51
    1510            
    1511            $C$DW$T$80      .dwtag  DW_TAG_typedef
    1512                    .dwattr $C$DW$T$80, DW_AT_name("USART_REGs")
    1513                    .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$51)
    1514                    .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1515                    .dwattr $C$DW$T$80, DW_AT_decl_file("..\usart_comms.h")
    1516                    .dwattr $C$DW$T$80, DW_AT_decl_line(0x8b)
    1517                    .dwattr $C$DW$T$80, DW_AT_decl_column(0x02)
    1518            
    1519            
    1520            $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1521                    .dwattr $C$DW$T$52, DW_AT_name("CS_initFLLParam")
    1522                    .dwattr $C$DW$T$52, DW_AT_byte_size(0x06)
    1523            $C$DW$106       .dwtag  DW_TAG_member
    1524                    .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$26)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   29

    1525                    .dwattr $C$DW$106, DW_AT_name("csCtl0")
    1526                    .dwattr $C$DW$106, DW_AT_TI_symbol_name("csCtl0")
    1527                    .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1528                    .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1529                    .dwattr $C$DW$106, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1530                    .dwattr $C$DW$106, DW_AT_decl_line(0x22)
    1531                    .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1532            
    1533            $C$DW$107       .dwtag  DW_TAG_member
    1534                    .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$26)
    1535                    .dwattr $C$DW$107, DW_AT_name("csCtl1")
    1536                    .dwattr $C$DW$107, DW_AT_TI_symbol_name("csCtl1")
    1537                    .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1538                    .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1539                    .dwattr $C$DW$107, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1540                    .dwattr $C$DW$107, DW_AT_decl_line(0x24)
    1541                    .dwattr $C$DW$107, DW_AT_decl_column(0x0e)
    1542            
    1543            $C$DW$108       .dwtag  DW_TAG_member
    1544                    .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$26)
    1545                    .dwattr $C$DW$108, DW_AT_name("fsystem")
    1546                    .dwattr $C$DW$108, DW_AT_TI_symbol_name("fsystem")
    1547                    .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1548                    .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1549                    .dwattr $C$DW$108, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1550                    .dwattr $C$DW$108, DW_AT_decl_line(0x26)
    1551                    .dwattr $C$DW$108, DW_AT_decl_column(0x0e)
    1552            
    1553                    .dwattr $C$DW$T$52, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430
    1554                    .dwattr $C$DW$T$52, DW_AT_decl_line(0x20)
    1555                    .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    1556                    .dwendtag $C$DW$T$52
    1557            
    1558            $C$DW$T$81      .dwtag  DW_TAG_typedef
    1559                    .dwattr $C$DW$T$81, DW_AT_name("CS_initFLLParam")
    1560                    .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$52)
    1561                    .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1562                    .dwattr $C$DW$T$81, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430
    1563                    .dwattr $C$DW$T$81, DW_AT_decl_line(0x27)
    1564                    .dwattr $C$DW$T$81, DW_AT_decl_column(0x03)
    1565            
    1566            
    1567            $C$DW$T$55      .dwtag  DW_TAG_structure_type
    1568                    .dwattr $C$DW$T$55, DW_AT_name("EUSCI_A_SPI_changeMasterClockParam")
    1569                    .dwattr $C$DW$T$55, DW_AT_byte_size(0x08)
    1570            $C$DW$109       .dwtag  DW_TAG_member
    1571                    .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$54)
    1572                    .dwattr $C$DW$109, DW_AT_name("clockSourceFrequency")
    1573                    .dwattr $C$DW$109, DW_AT_TI_symbol_name("clockSourceFrequency")
    1574                    .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1575                    .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1576                    .dwattr $C$DW$109, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1577                    .dwattr $C$DW$109, DW_AT_decl_line(0x22)
    1578                    .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    1579            
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   30

    1580            $C$DW$110       .dwtag  DW_TAG_member
    1581                    .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$54)
    1582                    .dwattr $C$DW$110, DW_AT_name("desiredSpiClock")
    1583                    .dwattr $C$DW$110, DW_AT_TI_symbol_name("desiredSpiClock")
    1584                    .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1585                    .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1586                    .dwattr $C$DW$110, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1587                    .dwattr $C$DW$110, DW_AT_decl_line(0x24)
    1588                    .dwattr $C$DW$110, DW_AT_decl_column(0x0e)
    1589            
    1590                    .dwattr $C$DW$T$55, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430
    1591                    .dwattr $C$DW$T$55, DW_AT_decl_line(0x20)
    1592                    .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    1593                    .dwendtag $C$DW$T$55
    1594            
    1595            $C$DW$T$82      .dwtag  DW_TAG_typedef
    1596                    .dwattr $C$DW$T$82, DW_AT_name("EUSCI_A_SPI_changeMasterClockParam")
    1597                    .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$55)
    1598                    .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1599                    .dwattr $C$DW$T$82, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430
    1600                    .dwattr $C$DW$T$82, DW_AT_decl_line(0x25)
    1601                    .dwattr $C$DW$T$82, DW_AT_decl_column(0x03)
    1602            
    1603            
    1604            $C$DW$T$56      .dwtag  DW_TAG_structure_type
    1605                    .dwattr $C$DW$T$56, DW_AT_name("EUSCI_A_SPI_initMasterParam")
    1606                    .dwattr $C$DW$T$56, DW_AT_byte_size(0x12)
    1607            $C$DW$111       .dwtag  DW_TAG_member
    1608                    .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$23)
    1609                    .dwattr $C$DW$111, DW_AT_name("selectClockSource")
    1610                    .dwattr $C$DW$111, DW_AT_TI_symbol_name("selectClockSource")
    1611                    .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612                    .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1613                    .dwattr $C$DW$111, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1614                    .dwattr $C$DW$111, DW_AT_decl_line(0x52)
    1615                    .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1616            
    1617            $C$DW$112       .dwtag  DW_TAG_member
    1618                    .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$54)
    1619                    .dwattr $C$DW$112, DW_AT_name("clockSourceFrequency")
    1620                    .dwattr $C$DW$112, DW_AT_TI_symbol_name("clockSourceFrequency")
    1621                    .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1622                    .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1623                    .dwattr $C$DW$112, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1624                    .dwattr $C$DW$112, DW_AT_decl_line(0x54)
    1625                    .dwattr $C$DW$112, DW_AT_decl_column(0x0e)
    1626            
    1627            $C$DW$113       .dwtag  DW_TAG_member
    1628                    .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$54)
    1629                    .dwattr $C$DW$113, DW_AT_name("desiredSpiClock")
    1630                    .dwattr $C$DW$113, DW_AT_TI_symbol_name("desiredSpiClock")
    1631                    .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1632                    .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1633                    .dwattr $C$DW$113, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1634                    .dwattr $C$DW$113, DW_AT_decl_line(0x56)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   31

    1635                    .dwattr $C$DW$113, DW_AT_decl_column(0x0e)
    1636            
    1637            $C$DW$114       .dwtag  DW_TAG_member
    1638                    .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$26)
    1639                    .dwattr $C$DW$114, DW_AT_name("msbFirst")
    1640                    .dwattr $C$DW$114, DW_AT_TI_symbol_name("msbFirst")
    1641                    .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1642                    .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1643                    .dwattr $C$DW$114, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1644                    .dwattr $C$DW$114, DW_AT_decl_line(0x5b)
    1645                    .dwattr $C$DW$114, DW_AT_decl_column(0x0e)
    1646            
    1647            $C$DW$115       .dwtag  DW_TAG_member
    1648                    .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$26)
    1649                    .dwattr $C$DW$115, DW_AT_name("clockPhase")
    1650                    .dwattr $C$DW$115, DW_AT_TI_symbol_name("clockPhase")
    1651                    .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1652                    .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1653                    .dwattr $C$DW$115, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1654                    .dwattr $C$DW$115, DW_AT_decl_line(0x60)
    1655                    .dwattr $C$DW$115, DW_AT_decl_column(0x0e)
    1656            
    1657            $C$DW$116       .dwtag  DW_TAG_member
    1658                    .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$26)
    1659                    .dwattr $C$DW$116, DW_AT_name("clockPolarity")
    1660                    .dwattr $C$DW$116, DW_AT_TI_symbol_name("clockPolarity")
    1661                    .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1662                    .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1663                    .dwattr $C$DW$116, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1664                    .dwattr $C$DW$116, DW_AT_decl_line(0x65)
    1665                    .dwattr $C$DW$116, DW_AT_decl_column(0x0e)
    1666            
    1667            $C$DW$117       .dwtag  DW_TAG_member
    1668                    .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$26)
    1669                    .dwattr $C$DW$117, DW_AT_name("spiMode")
    1670                    .dwattr $C$DW$117, DW_AT_TI_symbol_name("spiMode")
    1671                    .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1672                    .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1673                    .dwattr $C$DW$117, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1674                    .dwattr $C$DW$117, DW_AT_decl_line(0x6b)
    1675                    .dwattr $C$DW$117, DW_AT_decl_column(0x0e)
    1676            
    1677                    .dwattr $C$DW$T$56, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430
    1678                    .dwattr $C$DW$T$56, DW_AT_decl_line(0x4a)
    1679                    .dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
    1680                    .dwendtag $C$DW$T$56
    1681            
    1682            $C$DW$T$83      .dwtag  DW_TAG_typedef
    1683                    .dwattr $C$DW$T$83, DW_AT_name("EUSCI_A_SPI_initMasterParam")
    1684                    .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$56)
    1685                    .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1686                    .dwattr $C$DW$T$83, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430
    1687                    .dwattr $C$DW$T$83, DW_AT_decl_line(0x6c)
    1688                    .dwattr $C$DW$T$83, DW_AT_decl_column(0x03)
    1689            
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   32

    1690            
    1691            $C$DW$T$57      .dwtag  DW_TAG_structure_type
    1692                    .dwattr $C$DW$T$57, DW_AT_name("EUSCI_A_SPI_initSlaveParam")
    1693                    .dwattr $C$DW$T$57, DW_AT_byte_size(0x08)
    1694            $C$DW$118       .dwtag  DW_TAG_member
    1695                    .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$26)
    1696                    .dwattr $C$DW$118, DW_AT_name("msbFirst")
    1697                    .dwattr $C$DW$118, DW_AT_TI_symbol_name("msbFirst")
    1698                    .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1699                    .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1700                    .dwattr $C$DW$118, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1701                    .dwattr $C$DW$118, DW_AT_decl_line(0x31)
    1702                    .dwattr $C$DW$118, DW_AT_decl_column(0x0e)
    1703            
    1704            $C$DW$119       .dwtag  DW_TAG_member
    1705                    .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$26)
    1706                    .dwattr $C$DW$119, DW_AT_name("clockPhase")
    1707                    .dwattr $C$DW$119, DW_AT_TI_symbol_name("clockPhase")
    1708                    .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1709                    .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1710                    .dwattr $C$DW$119, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1711                    .dwattr $C$DW$119, DW_AT_decl_line(0x36)
    1712                    .dwattr $C$DW$119, DW_AT_decl_column(0x0e)
    1713            
    1714            $C$DW$120       .dwtag  DW_TAG_member
    1715                    .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$26)
    1716                    .dwattr $C$DW$120, DW_AT_name("clockPolarity")
    1717                    .dwattr $C$DW$120, DW_AT_TI_symbol_name("clockPolarity")
    1718                    .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1719                    .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1720                    .dwattr $C$DW$120, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1721                    .dwattr $C$DW$120, DW_AT_decl_line(0x3b)
    1722                    .dwattr $C$DW$120, DW_AT_decl_column(0x0e)
    1723            
    1724            $C$DW$121       .dwtag  DW_TAG_member
    1725                    .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$26)
    1726                    .dwattr $C$DW$121, DW_AT_name("spiMode")
    1727                    .dwattr $C$DW$121, DW_AT_TI_symbol_name("spiMode")
    1728                    .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1729                    .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1730                    .dwattr $C$DW$121, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1731                    .dwattr $C$DW$121, DW_AT_decl_line(0x41)
    1732                    .dwattr $C$DW$121, DW_AT_decl_column(0x0e)
    1733            
    1734                    .dwattr $C$DW$T$57, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430
    1735                    .dwattr $C$DW$T$57, DW_AT_decl_line(0x2c)
    1736                    .dwattr $C$DW$T$57, DW_AT_decl_column(0x10)
    1737                    .dwendtag $C$DW$T$57
    1738            
    1739            $C$DW$T$84      .dwtag  DW_TAG_typedef
    1740                    .dwattr $C$DW$T$84, DW_AT_name("EUSCI_A_SPI_initSlaveParam")
    1741                    .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$57)
    1742                    .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1743                    .dwattr $C$DW$T$84, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430
    1744                    .dwattr $C$DW$T$84, DW_AT_decl_line(0x42)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   33

    1745                    .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    1746            
    1747            
    1748            $C$DW$T$58      .dwtag  DW_TAG_structure_type
    1749                    .dwattr $C$DW$T$58, DW_AT_name("EUSCI_A_UART_initParam")
    1750                    .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    1751            $C$DW$122       .dwtag  DW_TAG_member
    1752                    .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$23)
    1753                    .dwattr $C$DW$122, DW_AT_name("selectClockSource")
    1754                    .dwattr $C$DW$122, DW_AT_TI_symbol_name("selectClockSource")
    1755                    .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1756                    .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1757                    .dwattr $C$DW$122, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1758                    .dwattr $C$DW$122, DW_AT_decl_line(0x2f)
    1759                    .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    1760            
    1761            $C$DW$123       .dwtag  DW_TAG_member
    1762                    .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$26)
    1763                    .dwattr $C$DW$123, DW_AT_name("clockPrescalar")
    1764                    .dwattr $C$DW$123, DW_AT_TI_symbol_name("clockPrescalar")
    1765                    .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1766                    .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1767                    .dwattr $C$DW$123, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1768                    .dwattr $C$DW$123, DW_AT_decl_line(0x31)
    1769                    .dwattr $C$DW$123, DW_AT_decl_column(0x0e)
    1770            
    1771            $C$DW$124       .dwtag  DW_TAG_member
    1772                    .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$23)
    1773                    .dwattr $C$DW$124, DW_AT_name("firstModReg")
    1774                    .dwattr $C$DW$124, DW_AT_TI_symbol_name("firstModReg")
    1775                    .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1776                    .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1777                    .dwattr $C$DW$124, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1778                    .dwattr $C$DW$124, DW_AT_decl_line(0x35)
    1779                    .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1780            
    1781            $C$DW$125       .dwtag  DW_TAG_member
    1782                    .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$23)
    1783                    .dwattr $C$DW$125, DW_AT_name("secondModReg")
    1784                    .dwattr $C$DW$125, DW_AT_TI_symbol_name("secondModReg")
    1785                    .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1786                    .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1787                    .dwattr $C$DW$125, DW_AT_decl_file("C:\ccs_challengespace\MSP430_LCD_display\driverlib\MSP430F
    1788                    .dwattr $C$DW$125, DW_AT_decl_line(0x39)
    1789                    .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1790            
    1791            $C$DW$126       .dwtag  DW_TAG_member
    1792                    .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$23)
    1793                    .dwattr $C$DW$126, DW_AT_name("parity")
