MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 G3 C/C++ Codegen                                              PC v21.6.1.LTS *
       3            ;* Date/Time created: Tue Jan  3 09:51:29 2023                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:d
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("../usart_comms.c")
       9                    .dwattr $C$DW$CU, DW_AT_producer("TI MSP430 G3 C/C++ Codegen PC v21.6.1.LTS Copyright (c) 2003
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ccs_challengespace\MSP430_LCD_display\Debug")
      12 000000               .sect   ".const"
      13                    .align  2
      14                    .elfsym pUSART0_REGs,SYM_SIZE(2)
      15 000000       pUSART0_REGs:
      16 000000 0500          .bits           0x500,16
      17                                    ; pUSART0_REGs @ 0

     502            $C$DW$17        .dwtag  DW_TAG_TI_branch
     503                    .dwattr $C$DW$17, DW_AT_low_pc(0x00)
     504                    .dwattr $C$DW$17, DW_AT_TI_return
     505            
     506 00001a 0110          RETA      ; [] 
     507                    ; [] 
     508                    .dwattr $C$DW$14, DW_AT_TI_end_file("../usart_comms.c")
     509                    .dwattr $C$DW$14, DW_AT_TI_end_line(0x59)
     510                    .dwattr $C$DW$14, DW_AT_TI_end_column(0x01)
     511                    .dwendentry
     512                    .dwendtag $C$DW$14
     513            
     514 000000               .sect   ".text:usart0_comms_receive"
     515                    .clink
     516                    .global usart0_comms_receive
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   12

     517            
     518            $C$DW$18        .dwtag  DW_TAG_subprogram
     519                    .dwattr $C$DW$18, DW_AT_name("usart0_comms_receive")
     520                    .dwattr $C$DW$18, DW_AT_low_pc(usart0_comms_receive)
     521                    .dwattr $C$DW$18, DW_AT_high_pc(0x00)
     522                    .dwattr $C$DW$18, DW_AT_TI_symbol_name("usart0_comms_receive")
     523                    .dwattr $C$DW$18, DW_AT_external
     524                    .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$22)
     525                    .dwattr $C$DW$18, DW_AT_TI_begin_file("../usart_comms.c")
     526                    .dwattr $C$DW$18, DW_AT_TI_begin_line(0x5c)
     527                    .dwattr $C$DW$18, DW_AT_TI_begin_column(0x09)
     528                    .dwattr $C$DW$18, DW_AT_decl_file("../usart_comms.c")
     529                    .dwattr $C$DW$18, DW_AT_decl_line(0x5c)
     530                    .dwattr $C$DW$18, DW_AT_decl_column(0x09)
     531                    .dwattr $C$DW$18, DW_AT_TI_max_frame_size(0x04)
     532                    .dwpsn  file "../usart_comms.c",line 93,column 1,is_stmt,address usart0_comms_receive,isa 0
     533            
     534                    .dwfde $C$DW$CIE, usart0_comms_receive
     535            
     536            ;*****************************************************************************
     537            ;* FUNCTION NAME: usart0_comms_receive                                       *
     538            ;*                                                                           *
     539            ;*   Regs Modified     : SP,r12,r15                                          *
     540            ;*   Regs Used         : SP,r12,r15                                          *
     541            ;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
     542            ;*****************************************************************************
     543 000000       usart0_comms_receive:
     544            ;* --------------------------------------------------------------------------*
     545                    .dwcfi  cfa_offset, 4
     546                    .dwcfi  save_reg_to_mem, 16, -4
     547                    .dwpsn  file "../usart_comms.c",line 94,column 5,is_stmt,isa 0
     548 000000 421F          MOV.W     &pUCAxRXBUF_REG+0,r15 ; [] |94| 
         000002 0000!
     549 000004 4F6C          MOV.B     @r15,r12              ; [] |94| 
     550                    .dwpsn  file "../usart_comms.c",line 95,column 1,is_stmt,isa 0
     551            $C$DW$19        .dwtag  DW_TAG_TI_branch
     552                    .dwattr $C$DW$19, DW_AT_low_pc(0x00)
     553                    .dwattr $C$DW$19, DW_AT_TI_return
     554            
     555 000006 0110          RETA      ; [] 
     556                    ; [] 
     557                    .dwattr $C$DW$18, DW_AT_TI_end_file("../usart_comms.c")
     558                    .dwattr $C$DW$18, DW_AT_TI_end_line(0x5f)
     559                    .dwattr $C$DW$18, DW_AT_TI_end_column(0x01)
     560                    .dwendentry
     561                    .dwendtag $C$DW$18
     562            
     563            
     564            ;******************************************************************************
     565            ;* BUILD ATTRIBUTES                                                           *
     566            ;******************************************************************************
     567                    .battr "TI", Tag_File, 1, Tag_LOCKIO_INFO(1)
     568                    .battr "TI", Tag_File, 1, Tag_WAITSTATE_INFO(2)
     569                    .battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
     570                    .battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   13

     571                    .battr "mspabi", Tag_File, 1, Tag_enum_size(3)
     572            
     573            ;******************************************************************************
     574            ;* TYPE INFORMATION                                                           *
     575            ;******************************************************************************
     576            
     577            $C$DW$T$23      .dwtag  DW_TAG_structure_type
     578                    .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     579            $C$DW$20        .dwtag  DW_TAG_member
     580                    .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$22)
     581                    .dwattr $C$DW$20, DW_AT_name("UCSWRST")
     582                    .dwattr $C$DW$20, DW_AT_TI_symbol_name("UCSWRST")
     583                    .dwattr $C$DW$20, DW_AT_bit_offset(0x07)
     584                    .dwattr $C$DW$20, DW_AT_bit_size(0x01)
     585                    .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     586                    .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     587                    .dwattr $C$DW$20, DW_AT_decl_file("..\usart_comms.h")
     588                    .dwattr $C$DW$20, DW_AT_decl_line(0x17)
     589                    .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     590            
     591            $C$DW$21        .dwtag  DW_TAG_member
     592                    .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$22)
     593                    .dwattr $C$DW$21, DW_AT_name("UCTXBRK")
     594                    .dwattr $C$DW$21, DW_AT_TI_symbol_name("UCTXBRK")
     595                    .dwattr $C$DW$21, DW_AT_bit_offset(0x06)
     596                    .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     597                    .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     598                    .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     599                    .dwattr $C$DW$21, DW_AT_decl_file("..\usart_comms.h")
     600                    .dwattr $C$DW$21, DW_AT_decl_line(0x18)
     601                    .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     602            
     603            $C$DW$22        .dwtag  DW_TAG_member
     604                    .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$22)
     605                    .dwattr $C$DW$22, DW_AT_name("UCTXADDR")
     606                    .dwattr $C$DW$22, DW_AT_TI_symbol_name("UCTXADDR")
     607                    .dwattr $C$DW$22, DW_AT_bit_offset(0x05)
     608                    .dwattr $C$DW$22, DW_AT_bit_size(0x01)
     609                    .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     610                    .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     611                    .dwattr $C$DW$22, DW_AT_decl_file("..\usart_comms.h")
     612                    .dwattr $C$DW$22, DW_AT_decl_line(0x19)
     613                    .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     614            
     615            $C$DW$23        .dwtag  DW_TAG_member
     616                    .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$22)
     617                    .dwattr $C$DW$23, DW_AT_name("UCDORM")
     618                    .dwattr $C$DW$23, DW_AT_TI_symbol_name("UCDORM")
     619                    .dwattr $C$DW$23, DW_AT_bit_offset(0x04)
     620                    .dwattr $C$DW$23, DW_AT_bit_size(0x01)
     621                    .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     622                    .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     623                    .dwattr $C$DW$23, DW_AT_decl_file("..\usart_comms.h")
     624                    .dwattr $C$DW$23, DW_AT_decl_line(0x1a)
     625                    .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   14

     626            
     627            $C$DW$24        .dwtag  DW_TAG_member
     628                    .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$22)
     629                    .dwattr $C$DW$24, DW_AT_name("UCBRKIE")
     630                    .dwattr $C$DW$24, DW_AT_TI_symbol_name("UCBRKIE")
     631                    .dwattr $C$DW$24, DW_AT_bit_offset(0x03)
     632                    .dwattr $C$DW$24, DW_AT_bit_size(0x01)
     633                    .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     634                    .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     635                    .dwattr $C$DW$24, DW_AT_decl_file("..\usart_comms.h")
     636                    .dwattr $C$DW$24, DW_AT_decl_line(0x1b)
     637                    .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     638            
     639            $C$DW$25        .dwtag  DW_TAG_member
     640                    .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$22)
     641                    .dwattr $C$DW$25, DW_AT_name("UCRXEIE")
     642                    .dwattr $C$DW$25, DW_AT_TI_symbol_name("UCRXEIE")
     643                    .dwattr $C$DW$25, DW_AT_bit_offset(0x02)
     644                    .dwattr $C$DW$25, DW_AT_bit_size(0x01)
     645                    .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     646                    .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     647                    .dwattr $C$DW$25, DW_AT_decl_file("..\usart_comms.h")
     648                    .dwattr $C$DW$25, DW_AT_decl_line(0x1c)
     649                    .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     650            
     651            $C$DW$26        .dwtag  DW_TAG_member
     652                    .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$22)
     653                    .dwattr $C$DW$26, DW_AT_name("UCSSELx")
     654                    .dwattr $C$DW$26, DW_AT_TI_symbol_name("UCSSELx")
     655                    .dwattr $C$DW$26, DW_AT_bit_offset(0x00)
     656                    .dwattr $C$DW$26, DW_AT_bit_size(0x02)
     657                    .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     658                    .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     659                    .dwattr $C$DW$26, DW_AT_decl_file("..\usart_comms.h")
     660                    .dwattr $C$DW$26, DW_AT_decl_line(0x1d)
     661                    .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     662            
     663            $C$DW$27        .dwtag  DW_TAG_member
     664                    .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$22)
     665                    .dwattr $C$DW$27, DW_AT_name("UCSYNC")
     666                    .dwattr $C$DW$27, DW_AT_TI_symbol_name("UCSYNC")
     667                    .dwattr $C$DW$27, DW_AT_bit_offset(0x07)
     668                    .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     669                    .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     670                    .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     671                    .dwattr $C$DW$27, DW_AT_decl_file("..\usart_comms.h")
     672                    .dwattr $C$DW$27, DW_AT_decl_line(0x1e)
     673                    .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     674            
     675            $C$DW$28        .dwtag  DW_TAG_member
     676                    .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$22)
     677                    .dwattr $C$DW$28, DW_AT_name("UCMODEx")
     678                    .dwattr $C$DW$28, DW_AT_TI_symbol_name("UCMODEx")
     679                    .dwattr $C$DW$28, DW_AT_bit_offset(0x05)
     680                    .dwattr $C$DW$28, DW_AT_bit_size(0x02)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   15

     681                    .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     682                    .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     683                    .dwattr $C$DW$28, DW_AT_decl_file("..\usart_comms.h")
     684                    .dwattr $C$DW$28, DW_AT_decl_line(0x1f)
     685                    .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     686            
     687            $C$DW$29        .dwtag  DW_TAG_member
     688                    .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$22)
     689                    .dwattr $C$DW$29, DW_AT_name("UCSPB")
     690                    .dwattr $C$DW$29, DW_AT_TI_symbol_name("UCSPB")
     691                    .dwattr $C$DW$29, DW_AT_bit_offset(0x04)
     692                    .dwattr $C$DW$29, DW_AT_bit_size(0x01)
     693                    .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     694                    .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     695                    .dwattr $C$DW$29, DW_AT_decl_file("..\usart_comms.h")
     696                    .dwattr $C$DW$29, DW_AT_decl_line(0x20)
     697                    .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     698            
     699            $C$DW$30        .dwtag  DW_TAG_member
     700                    .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$22)
     701                    .dwattr $C$DW$30, DW_AT_name("UC7BIT")
     702                    .dwattr $C$DW$30, DW_AT_TI_symbol_name("UC7BIT")
     703                    .dwattr $C$DW$30, DW_AT_bit_offset(0x03)
     704                    .dwattr $C$DW$30, DW_AT_bit_size(0x01)
     705                    .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     706                    .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     707                    .dwattr $C$DW$30, DW_AT_decl_file("..\usart_comms.h")
     708                    .dwattr $C$DW$30, DW_AT_decl_line(0x21)
     709                    .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     710            
     711            $C$DW$31        .dwtag  DW_TAG_member
     712                    .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$22)
     713                    .dwattr $C$DW$31, DW_AT_name("UCMSB")
     714                    .dwattr $C$DW$31, DW_AT_TI_symbol_name("UCMSB")
     715                    .dwattr $C$DW$31, DW_AT_bit_offset(0x02)
     716                    .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     717                    .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     718                    .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     719                    .dwattr $C$DW$31, DW_AT_decl_file("..\usart_comms.h")
     720                    .dwattr $C$DW$31, DW_AT_decl_line(0x22)
     721                    .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     722            
     723            $C$DW$32        .dwtag  DW_TAG_member
     724                    .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$22)
     725                    .dwattr $C$DW$32, DW_AT_name("UCPAR")
     726                    .dwattr $C$DW$32, DW_AT_TI_symbol_name("UCPAR")
     727                    .dwattr $C$DW$32, DW_AT_bit_offset(0x01)
     728                    .dwattr $C$DW$32, DW_AT_bit_size(0x01)
     729                    .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     730                    .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     731                    .dwattr $C$DW$32, DW_AT_decl_file("..\usart_comms.h")
     732                    .dwattr $C$DW$32, DW_AT_decl_line(0x23)
     733                    .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     734            
     735            $C$DW$33        .dwtag  DW_TAG_member
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   16

     736                    .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$22)
     737                    .dwattr $C$DW$33, DW_AT_name("UCPEN")
     738                    .dwattr $C$DW$33, DW_AT_TI_symbol_name("UCPEN")
     739                    .dwattr $C$DW$33, DW_AT_bit_offset(0x00)
     740                    .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     741                    .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     742                    .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     743                    .dwattr $C$DW$33, DW_AT_decl_file("..\usart_comms.h")
     744                    .dwattr $C$DW$33, DW_AT_decl_line(0x24)
     745                    .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     746            
     747                    .dwattr $C$DW$T$23, DW_AT_decl_file("..\usart_comms.h")
     748                    .dwattr $C$DW$T$23, DW_AT_decl_line(0x16)
     749                    .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
     750                    .dwendtag $C$DW$T$23
     751            
     752            $C$DW$T$38      .dwtag  DW_TAG_typedef
     753                    .dwattr $C$DW$T$38, DW_AT_name("UCA0CTLW0_REG")
     754                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$23)
     755                    .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
     756                    .dwattr $C$DW$T$38, DW_AT_decl_file("..\usart_comms.h")
     757                    .dwattr $C$DW$T$38, DW_AT_decl_line(0x25)
     758                    .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
     759            
     760            $C$DW$T$55      .dwtag  DW_TAG_pointer_type
     761                    .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$38)
     762                    .dwattr $C$DW$T$55, DW_AT_address_class(0x10)
     763            
     764            $C$DW$T$56      .dwtag  DW_TAG_const_type
     765                    .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
     766            
     767            
     768            $C$DW$T$26      .dwtag  DW_TAG_structure_type
     769                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     770            $C$DW$34        .dwtag  DW_TAG_member
     771                    .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$25)
     772                    .dwattr $C$DW$34, DW_AT_name("UCGLITx")
     773                    .dwattr $C$DW$34, DW_AT_TI_symbol_name("UCGLITx")
     774                    .dwattr $C$DW$34, DW_AT_bit_offset(0x0e)
     775                    .dwattr $C$DW$34, DW_AT_bit_size(0x02)
     776                    .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     777                    .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     778                    .dwattr $C$DW$34, DW_AT_decl_file("..\usart_comms.h")
     779                    .dwattr $C$DW$34, DW_AT_decl_line(0x2a)
     780                    .dwattr $C$DW$34, DW_AT_decl_column(0x0e)
     781            
     782            $C$DW$35        .dwtag  DW_TAG_member
     783                    .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$25)
     784                    .dwattr $C$DW$35, DW_AT_name("Reserved")
     785                    .dwattr $C$DW$35, DW_AT_TI_symbol_name("Reserved")
     786                    .dwattr $C$DW$35, DW_AT_bit_offset(0x00)
     787                    .dwattr $C$DW$35, DW_AT_bit_size(0x0e)
     788                    .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     789                    .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     790                    .dwattr $C$DW$35, DW_AT_decl_file("..\usart_comms.h")
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   17

     791                    .dwattr $C$DW$35, DW_AT_decl_line(0x2b)
     792                    .dwattr $C$DW$35, DW_AT_decl_column(0x0e)
     793            
     794            $C$DW$36        .dwtag  DW_TAG_member
     795                    .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$25)
     796                    .dwattr $C$DW$36, DW_AT_name("Unused")
     797                    .dwattr $C$DW$36, DW_AT_TI_symbol_name("Unused")
     798                    .dwattr $C$DW$36, DW_AT_bit_offset(0x00)
     799                    .dwattr $C$DW$36, DW_AT_bit_size(0x10)
     800                    .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     801                    .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     802                    .dwattr $C$DW$36, DW_AT_decl_file("..\usart_comms.h")
     803                    .dwattr $C$DW$36, DW_AT_decl_line(0x2c)
     804                    .dwattr $C$DW$36, DW_AT_decl_column(0x0e)
     805            
     806                    .dwattr $C$DW$T$26, DW_AT_decl_file("..\usart_comms.h")
     807                    .dwattr $C$DW$T$26, DW_AT_decl_line(0x29)
     808                    .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
     809                    .dwendtag $C$DW$T$26
     810            
     811            $C$DW$T$39      .dwtag  DW_TAG_typedef
     812                    .dwattr $C$DW$T$39, DW_AT_name("UCA0CTLW1_REG")
     813                    .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$26)
     814                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
     815                    .dwattr $C$DW$T$39, DW_AT_decl_file("..\usart_comms.h")
     816                    .dwattr $C$DW$T$39, DW_AT_decl_line(0x2d)
     817                    .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
     818            
     819            
     820            $C$DW$T$27      .dwtag  DW_TAG_structure_type
     821                    .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     822            $C$DW$37        .dwtag  DW_TAG_member
     823                    .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$25)
     824                    .dwattr $C$DW$37, DW_AT_name("UCBRx")
     825                    .dwattr $C$DW$37, DW_AT_TI_symbol_name("UCBRx")
     826                    .dwattr $C$DW$37, DW_AT_bit_offset(0x00)
     827                    .dwattr $C$DW$37, DW_AT_bit_size(0x10)
     828                    .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     829                    .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     830                    .dwattr $C$DW$37, DW_AT_decl_file("..\usart_comms.h")
     831                    .dwattr $C$DW$37, DW_AT_decl_line(0x3a)
     832                    .dwattr $C$DW$37, DW_AT_decl_column(0x0e)
     833            
     834                    .dwattr $C$DW$T$27, DW_AT_decl_file("..\usart_comms.h")
     835                    .dwattr $C$DW$T$27, DW_AT_decl_line(0x38)
     836                    .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
     837                    .dwendtag $C$DW$T$27
     838            
     839            $C$DW$T$40      .dwtag  DW_TAG_typedef
     840                    .dwattr $C$DW$T$40, DW_AT_name("UCA0BRW_REG")
     841                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$27)
     842                    .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     843                    .dwattr $C$DW$T$40, DW_AT_decl_file("..\usart_comms.h")
     844                    .dwattr $C$DW$T$40, DW_AT_decl_line(0x3b)
     845                    .dwattr $C$DW$T$40, DW_AT_decl_column(0x02)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   18

     846            
     847            
     848            $C$DW$T$28      .dwtag  DW_TAG_structure_type
     849                    .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     850            $C$DW$38        .dwtag  DW_TAG_member
     851                    .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$22)
     852                    .dwattr $C$DW$38, DW_AT_name("UCOS16")
     853                    .dwattr $C$DW$38, DW_AT_TI_symbol_name("UCOS16")
     854                    .dwattr $C$DW$38, DW_AT_bit_offset(0x07)
     855                    .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     856                    .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     857                    .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     858                    .dwattr $C$DW$38, DW_AT_decl_file("..\usart_comms.h")
     859                    .dwattr $C$DW$38, DW_AT_decl_line(0x3f)
     860                    .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     861            
     862            $C$DW$39        .dwtag  DW_TAG_member
     863                    .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$22)
     864                    .dwattr $C$DW$39, DW_AT_name("RESERVED")
     865                    .dwattr $C$DW$39, DW_AT_TI_symbol_name("RESERVED")
     866                    .dwattr $C$DW$39, DW_AT_bit_offset(0x04)
     867                    .dwattr $C$DW$39, DW_AT_bit_size(0x03)
     868                    .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     869                    .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     870                    .dwattr $C$DW$39, DW_AT_decl_file("..\usart_comms.h")
     871                    .dwattr $C$DW$39, DW_AT_decl_line(0x40)
     872                    .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     873            
     874            $C$DW$40        .dwtag  DW_TAG_member
     875                    .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$22)
     876                    .dwattr $C$DW$40, DW_AT_name("UCBRFx")
     877                    .dwattr $C$DW$40, DW_AT_TI_symbol_name("UCBRFx")
     878                    .dwattr $C$DW$40, DW_AT_bit_offset(0x00)
     879                    .dwattr $C$DW$40, DW_AT_bit_size(0x04)
     880                    .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     881                    .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     882                    .dwattr $C$DW$40, DW_AT_decl_file("..\usart_comms.h")
     883                    .dwattr $C$DW$40, DW_AT_decl_line(0x41)
     884                    .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     885            
     886            $C$DW$41        .dwtag  DW_TAG_member
     887                    .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$22)
     888                    .dwattr $C$DW$41, DW_AT_name("UCBRSx")
     889                    .dwattr $C$DW$41, DW_AT_TI_symbol_name("UCBRSx")
     890                    .dwattr $C$DW$41, DW_AT_bit_offset(0x00)
     891                    .dwattr $C$DW$41, DW_AT_bit_size(0x08)
     892                    .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     893                    .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     894                    .dwattr $C$DW$41, DW_AT_decl_file("..\usart_comms.h")
     895                    .dwattr $C$DW$41, DW_AT_decl_line(0x42)
     896                    .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     897            
     898                    .dwattr $C$DW$T$28, DW_AT_decl_file("..\usart_comms.h")
     899                    .dwattr $C$DW$T$28, DW_AT_decl_line(0x3e)
     900                    .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   19

     901                    .dwendtag $C$DW$T$28
     902            
     903            $C$DW$T$41      .dwtag  DW_TAG_typedef
     904                    .dwattr $C$DW$T$41, DW_AT_name("UCA0MCTLW_REG")
     905                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$28)
     906                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
     907                    .dwattr $C$DW$T$41, DW_AT_decl_file("..\usart_comms.h")
     908                    .dwattr $C$DW$T$41, DW_AT_decl_line(0x43)
     909                    .dwattr $C$DW$T$41, DW_AT_decl_column(0x02)
     910            
     911            $C$DW$T$58      .dwtag  DW_TAG_volatile_type
     912                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$41)
     913            
     914            $C$DW$T$59      .dwtag  DW_TAG_pointer_type
     915                    .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
     916                    .dwattr $C$DW$T$59, DW_AT_address_class(0x10)
     917            
     918            $C$DW$T$60      .dwtag  DW_TAG_const_type
     919                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
     920            
     921            
     922            $C$DW$T$30      .dwtag  DW_TAG_structure_type
     923                    .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     924            $C$DW$42        .dwtag  DW_TAG_member
     925                    .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$25)
     926                    .dwattr $C$DW$42, DW_AT_name("UCBUSY")
     927                    .dwattr $C$DW$42, DW_AT_TI_symbol_name("UCBUSY")
     928                    .dwattr $C$DW$42, DW_AT_bit_offset(0x0f)
     929                    .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     930                    .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     931                    .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     932                    .dwattr $C$DW$42, DW_AT_decl_file("..\usart_comms.h")
     933                    .dwattr $C$DW$42, DW_AT_decl_line(0x47)
     934                    .dwattr $C$DW$42, DW_AT_decl_column(0x0f)
     935            
     936            $C$DW$43        .dwtag  DW_TAG_member
     937                    .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$25)
     938                    .dwattr $C$DW$43, DW_AT_name("UCADDR")
     939                    .dwattr $C$DW$43, DW_AT_TI_symbol_name("UCADDR")
     940                    .dwattr $C$DW$43, DW_AT_bit_offset(0x0e)
     941                    .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     942                    .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     943                    .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     944                    .dwattr $C$DW$43, DW_AT_decl_file("..\usart_comms.h")
     945                    .dwattr $C$DW$43, DW_AT_decl_line(0x48)
     946                    .dwattr $C$DW$43, DW_AT_decl_column(0x0f)
     947            
     948            $C$DW$44        .dwtag  DW_TAG_member
     949                    .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$25)
     950                    .dwattr $C$DW$44, DW_AT_name("UCRXERR")
     951                    .dwattr $C$DW$44, DW_AT_TI_symbol_name("UCRXERR")
     952                    .dwattr $C$DW$44, DW_AT_bit_offset(0x0d)
     953                    .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     954                    .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955                    .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   20

     956                    .dwattr $C$DW$44, DW_AT_decl_file("..\usart_comms.h")
     957                    .dwattr $C$DW$44, DW_AT_decl_line(0x49)
     958                    .dwattr $C$DW$44, DW_AT_decl_column(0x0f)
     959            
     960            $C$DW$45        .dwtag  DW_TAG_member
     961                    .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$25)
     962                    .dwattr $C$DW$45, DW_AT_name("UCBRK")
     963                    .dwattr $C$DW$45, DW_AT_TI_symbol_name("UCBRK")
     964                    .dwattr $C$DW$45, DW_AT_bit_offset(0x0c)
     965                    .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     966                    .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     967                    .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     968                    .dwattr $C$DW$45, DW_AT_decl_file("..\usart_comms.h")
     969                    .dwattr $C$DW$45, DW_AT_decl_line(0x4a)
     970                    .dwattr $C$DW$45, DW_AT_decl_column(0x0f)
     971            
     972            $C$DW$46        .dwtag  DW_TAG_member
     973                    .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$25)
     974                    .dwattr $C$DW$46, DW_AT_name("UCPE")
     975                    .dwattr $C$DW$46, DW_AT_TI_symbol_name("UCPE")
     976                    .dwattr $C$DW$46, DW_AT_bit_offset(0x0b)
     977                    .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     978                    .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     979                    .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     980                    .dwattr $C$DW$46, DW_AT_decl_file("..\usart_comms.h")
     981                    .dwattr $C$DW$46, DW_AT_decl_line(0x4b)
     982                    .dwattr $C$DW$46, DW_AT_decl_column(0x0f)
     983            
     984            $C$DW$47        .dwtag  DW_TAG_member
     985                    .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$25)
     986                    .dwattr $C$DW$47, DW_AT_name("UCOE")
     987                    .dwattr $C$DW$47, DW_AT_TI_symbol_name("UCOE")
     988                    .dwattr $C$DW$47, DW_AT_bit_offset(0x0a)
     989                    .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     990                    .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     991                    .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     992                    .dwattr $C$DW$47, DW_AT_decl_file("..\usart_comms.h")
     993                    .dwattr $C$DW$47, DW_AT_decl_line(0x4c)
     994                    .dwattr $C$DW$47, DW_AT_decl_column(0x0f)
     995            
     996            $C$DW$48        .dwtag  DW_TAG_member
     997                    .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$25)
     998                    .dwattr $C$DW$48, DW_AT_name("UCFE")
     999                    .dwattr $C$DW$48, DW_AT_TI_symbol_name("UCFE")
    1000                    .dwattr $C$DW$48, DW_AT_bit_offset(0x09)
    1001                    .dwattr $C$DW$48, DW_AT_bit_size(0x01)
    1002                    .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003                    .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1004                    .dwattr $C$DW$48, DW_AT_decl_file("..\usart_comms.h")
    1005                    .dwattr $C$DW$48, DW_AT_decl_line(0x4d)
    1006                    .dwattr $C$DW$48, DW_AT_decl_column(0x0f)
    1007            
    1008            $C$DW$49        .dwtag  DW_TAG_member
    1009                    .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$25)
    1010                    .dwattr $C$DW$49, DW_AT_name("UCLISTEN")
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   21

    1011                    .dwattr $C$DW$49, DW_AT_TI_symbol_name("UCLISTEN")
    1012                    .dwattr $C$DW$49, DW_AT_bit_offset(0x08)
    1013                    .dwattr $C$DW$49, DW_AT_bit_size(0x01)
    1014                    .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1015                    .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1016                    .dwattr $C$DW$49, DW_AT_decl_file("..\usart_comms.h")
    1017                    .dwattr $C$DW$49, DW_AT_decl_line(0x4e)
    1018                    .dwattr $C$DW$49, DW_AT_decl_column(0x0f)
    1019            
    1020            $C$DW$50        .dwtag  DW_TAG_member
    1021                    .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$29)
    1022                    .dwattr $C$DW$50, DW_AT_name("RESERVED")
    1023                    .dwattr $C$DW$50, DW_AT_TI_symbol_name("RESERVED")
    1024                    .dwattr $C$DW$50, DW_AT_bit_offset(0x00)
    1025                    .dwattr $C$DW$50, DW_AT_bit_size(0x08)
    1026                    .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1027                    .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1028                    .dwattr $C$DW$50, DW_AT_decl_file("..\usart_comms.h")
    1029                    .dwattr $C$DW$50, DW_AT_decl_line(0x4f)
    1030                    .dwattr $C$DW$50, DW_AT_decl_column(0x15)
    1031            
    1032                    .dwattr $C$DW$T$30, DW_AT_decl_file("..\usart_comms.h")
    1033                    .dwattr $C$DW$T$30, DW_AT_decl_line(0x46)
    1034                    .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1035                    .dwendtag $C$DW$T$30
    1036            
    1037            $C$DW$T$42      .dwtag  DW_TAG_typedef
    1038                    .dwattr $C$DW$T$42, DW_AT_name("UCA0STATW_REG")
    1039                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$30)
    1040                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1041                    .dwattr $C$DW$T$42, DW_AT_decl_file("..\usart_comms.h")
    1042                    .dwattr $C$DW$T$42, DW_AT_decl_line(0x50)
    1043                    .dwattr $C$DW$T$42, DW_AT_decl_column(0x02)
    1044            
    1045            
    1046            $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1047                    .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1048            $C$DW$51        .dwtag  DW_TAG_member
    1049                    .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$22)
    1050                    .dwattr $C$DW$51, DW_AT_name("UCRXBUFx")
    1051                    .dwattr $C$DW$51, DW_AT_TI_symbol_name("UCRXBUFx")
    1052                    .dwattr $C$DW$51, DW_AT_bit_offset(0x00)
    1053                    .dwattr $C$DW$51, DW_AT_bit_size(0x08)
    1054                    .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055                    .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1056                    .dwattr $C$DW$51, DW_AT_decl_file("..\usart_comms.h")
    1057                    .dwattr $C$DW$51, DW_AT_decl_line(0x59)
    1058                    .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
    1059            
    1060                    .dwattr $C$DW$T$31, DW_AT_decl_file("..\usart_comms.h")
    1061                    .dwattr $C$DW$T$31, DW_AT_decl_line(0x58)
    1062                    .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
    1063                    .dwendtag $C$DW$T$31
    1064            
    1065            $C$DW$T$43      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   22

    1066                    .dwattr $C$DW$T$43, DW_AT_name("UCA0RXBUF_REG")
    1067                    .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$31)
    1068                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1069                    .dwattr $C$DW$T$43, DW_AT_decl_file("..\usart_comms.h")
    1070                    .dwattr $C$DW$T$43, DW_AT_decl_line(0x5a)
    1071                    .dwattr $C$DW$T$43, DW_AT_decl_column(0x02)
    1072            
    1073            $C$DW$T$61      .dwtag  DW_TAG_volatile_type
    1074                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$43)
    1075            
    1076            $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    1077                    .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    1078                    .dwattr $C$DW$T$62, DW_AT_address_class(0x10)
    1079            
    1080            $C$DW$T$63      .dwtag  DW_TAG_const_type
    1081                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    1082            
    1083            
    1084            $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1085                    .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1086            $C$DW$52        .dwtag  DW_TAG_member
    1087                    .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$22)
    1088                    .dwattr $C$DW$52, DW_AT_name("UCTXBUFx")
    1089                    .dwattr $C$DW$52, DW_AT_TI_symbol_name("UCTXBUFx")
    1090                    .dwattr $C$DW$52, DW_AT_bit_offset(0x00)
    1091                    .dwattr $C$DW$52, DW_AT_bit_size(0x08)
    1092                    .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1093                    .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1094                    .dwattr $C$DW$52, DW_AT_decl_file("..\usart_comms.h")
    1095                    .dwattr $C$DW$52, DW_AT_decl_line(0x54)
    1096                    .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
    1097            
    1098                    .dwattr $C$DW$T$32, DW_AT_decl_file("..\usart_comms.h")
    1099                    .dwattr $C$DW$T$32, DW_AT_decl_line(0x53)
    1100                    .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    1101                    .dwendtag $C$DW$T$32
    1102            
    1103            $C$DW$T$44      .dwtag  DW_TAG_typedef
    1104                    .dwattr $C$DW$T$44, DW_AT_name("UCA0TXBUF_REG")
    1105                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$32)
    1106                    .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1107                    .dwattr $C$DW$T$44, DW_AT_decl_file("..\usart_comms.h")
    1108                    .dwattr $C$DW$T$44, DW_AT_decl_line(0x55)
    1109                    .dwattr $C$DW$T$44, DW_AT_decl_column(0x02)
    1110            
    1111            $C$DW$T$64      .dwtag  DW_TAG_volatile_type
    1112                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$44)
    1113            
    1114            $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    1115                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    1116                    .dwattr $C$DW$T$65, DW_AT_address_class(0x10)
    1117            
    1118            $C$DW$T$66      .dwtag  DW_TAG_const_type
    1119                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    1120            
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   23

    1121            
    1122            $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1123                    .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1124            $C$DW$53        .dwtag  DW_TAG_member
    1125                    .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$22)
    1126                    .dwattr $C$DW$53, DW_AT_name("UCABDEN")
    1127                    .dwattr $C$DW$53, DW_AT_TI_symbol_name("UCABDEN")
    1128                    .dwattr $C$DW$53, DW_AT_bit_offset(0x07)
    1129                    .dwattr $C$DW$53, DW_AT_bit_size(0x01)
    1130                    .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                    .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1132                    .dwattr $C$DW$53, DW_AT_decl_file("..\usart_comms.h")
    1133                    .dwattr $C$DW$53, DW_AT_decl_line(0x5e)
    1134                    .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
    1135            
    1136            $C$DW$54        .dwtag  DW_TAG_member
    1137                    .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$22)
    1138                    .dwattr $C$DW$54, DW_AT_name("Reserved")
    1139                    .dwattr $C$DW$54, DW_AT_TI_symbol_name("Reserved")
    1140                    .dwattr $C$DW$54, DW_AT_bit_offset(0x06)
    1141                    .dwattr $C$DW$54, DW_AT_bit_size(0x01)
    1142                    .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1143                    .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1144                    .dwattr $C$DW$54, DW_AT_decl_file("..\usart_comms.h")
    1145                    .dwattr $C$DW$54, DW_AT_decl_line(0x5f)
    1146                    .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
    1147            
    1148            $C$DW$55        .dwtag  DW_TAG_member
    1149                    .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$22)
    1150                    .dwattr $C$DW$55, DW_AT_name("UCBTOE")
    1151                    .dwattr $C$DW$55, DW_AT_TI_symbol_name("UCBTOE")
    1152                    .dwattr $C$DW$55, DW_AT_bit_offset(0x05)
    1153                    .dwattr $C$DW$55, DW_AT_bit_size(0x01)
    1154                    .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1155                    .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1156                    .dwattr $C$DW$55, DW_AT_decl_file("..\usart_comms.h")
    1157                    .dwattr $C$DW$55, DW_AT_decl_line(0x60)
    1158                    .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
    1159            
    1160            $C$DW$56        .dwtag  DW_TAG_member
    1161                    .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$22)
    1162                    .dwattr $C$DW$56, DW_AT_name("UCSTOE")
    1163                    .dwattr $C$DW$56, DW_AT_TI_symbol_name("UCSTOE")
    1164                    .dwattr $C$DW$56, DW_AT_bit_offset(0x04)
    1165                    .dwattr $C$DW$56, DW_AT_bit_size(0x01)
    1166                    .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1167                    .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1168                    .dwattr $C$DW$56, DW_AT_decl_file("..\usart_comms.h")
    1169                    .dwattr $C$DW$56, DW_AT_decl_line(0x61)
    1170                    .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
    1171            
    1172            $C$DW$57        .dwtag  DW_TAG_member
    1173                    .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$22)
    1174                    .dwattr $C$DW$57, DW_AT_name("UCDELIMx")
    1175                    .dwattr $C$DW$57, DW_AT_TI_symbol_name("UCDELIMx")
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   24

    1176                    .dwattr $C$DW$57, DW_AT_bit_offset(0x02)
    1177                    .dwattr $C$DW$57, DW_AT_bit_size(0x02)
    1178                    .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1179                    .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1180                    .dwattr $C$DW$57, DW_AT_decl_file("..\usart_comms.h")
    1181                    .dwattr $C$DW$57, DW_AT_decl_line(0x62)
    1182                    .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
    1183            
    1184            $C$DW$58        .dwtag  DW_TAG_member
    1185                    .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$25)
    1186                    .dwattr $C$DW$58, DW_AT_name("RESERVED")
    1187                    .dwattr $C$DW$58, DW_AT_TI_symbol_name("RESERVED")
    1188                    .dwattr $C$DW$58, DW_AT_bit_offset(0x00)
    1189                    .dwattr $C$DW$58, DW_AT_bit_size(0x0a)
    1190                    .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1191                    .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1192                    .dwattr $C$DW$58, DW_AT_decl_file("..\usart_comms.h")
    1193                    .dwattr $C$DW$58, DW_AT_decl_line(0x63)
    1194                    .dwattr $C$DW$58, DW_AT_decl_column(0x0e)
    1195            
    1196                    .dwattr $C$DW$T$33, DW_AT_decl_file("..\usart_comms.h")
    1197                    .dwattr $C$DW$T$33, DW_AT_decl_line(0x5d)
    1198                    .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    1199                    .dwendtag $C$DW$T$33
    1200            
    1201            $C$DW$T$45      .dwtag  DW_TAG_typedef
    1202                    .dwattr $C$DW$T$45, DW_AT_name("UCA0ABCTL_REG")
    1203                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$33)
    1204                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1205                    .dwattr $C$DW$T$45, DW_AT_decl_file("..\usart_comms.h")
    1206                    .dwattr $C$DW$T$45, DW_AT_decl_line(0x64)
    1207                    .dwattr $C$DW$T$45, DW_AT_decl_column(0x02)
    1208            
    1209            
    1210            $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1211                    .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1212            $C$DW$59        .dwtag  DW_TAG_member
    1213                    .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$22)
    1214                    .dwattr $C$DW$59, DW_AT_name("UCIREN")
    1215                    .dwattr $C$DW$59, DW_AT_TI_symbol_name("UCIREN")
    1216                    .dwattr $C$DW$59, DW_AT_bit_offset(0x07)
    1217                    .dwattr $C$DW$59, DW_AT_bit_size(0x01)
    1218                    .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1219                    .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1220                    .dwattr $C$DW$59, DW_AT_decl_file("..\usart_comms.h")
    1221                    .dwattr $C$DW$59, DW_AT_decl_line(0x68)
    1222                    .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
    1223            
    1224            $C$DW$60        .dwtag  DW_TAG_member
    1225                    .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$22)
    1226                    .dwattr $C$DW$60, DW_AT_name("UCIRTXCLK")
    1227                    .dwattr $C$DW$60, DW_AT_TI_symbol_name("UCIRTXCLK")
    1228                    .dwattr $C$DW$60, DW_AT_bit_offset(0x06)
    1229                    .dwattr $C$DW$60, DW_AT_bit_size(0x01)
    1230                    .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   25

    1231                    .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1232                    .dwattr $C$DW$60, DW_AT_decl_file("..\usart_comms.h")
    1233                    .dwattr $C$DW$60, DW_AT_decl_line(0x69)
    1234                    .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
    1235            
    1236            $C$DW$61        .dwtag  DW_TAG_member
    1237                    .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$22)
    1238                    .dwattr $C$DW$61, DW_AT_name("UCIRTXPLx")
    1239                    .dwattr $C$DW$61, DW_AT_TI_symbol_name("UCIRTXPLx")
    1240                    .dwattr $C$DW$61, DW_AT_bit_offset(0x00)
    1241                    .dwattr $C$DW$61, DW_AT_bit_size(0x06)
    1242                    .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1243                    .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1244                    .dwattr $C$DW$61, DW_AT_decl_file("..\usart_comms.h")
    1245                    .dwattr $C$DW$61, DW_AT_decl_line(0x6a)
    1246                    .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
    1247            
    1248            $C$DW$62        .dwtag  DW_TAG_member
    1249                    .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$22)
    1250                    .dwattr $C$DW$62, DW_AT_name("UCIRRXFE")
    1251                    .dwattr $C$DW$62, DW_AT_TI_symbol_name("UCIRRXFE")
    1252                    .dwattr $C$DW$62, DW_AT_bit_offset(0x07)
    1253                    .dwattr $C$DW$62, DW_AT_bit_size(0x01)
    1254                    .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1255                    .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1256                    .dwattr $C$DW$62, DW_AT_decl_file("..\usart_comms.h")
    1257                    .dwattr $C$DW$62, DW_AT_decl_line(0x6b)
    1258                    .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
    1259            
    1260            $C$DW$63        .dwtag  DW_TAG_member
    1261                    .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$22)
    1262                    .dwattr $C$DW$63, DW_AT_name("UCIRRXPL")
    1263                    .dwattr $C$DW$63, DW_AT_TI_symbol_name("UCIRRXPL")
    1264                    .dwattr $C$DW$63, DW_AT_bit_offset(0x06)
    1265                    .dwattr $C$DW$63, DW_AT_bit_size(0x01)
    1266                    .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1267                    .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1268                    .dwattr $C$DW$63, DW_AT_decl_file("..\usart_comms.h")
    1269                    .dwattr $C$DW$63, DW_AT_decl_line(0x6c)
    1270                    .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
    1271            
    1272            $C$DW$64        .dwtag  DW_TAG_member
    1273                    .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$22)
    1274                    .dwattr $C$DW$64, DW_AT_name("UCIRRXFLx")
    1275                    .dwattr $C$DW$64, DW_AT_TI_symbol_name("UCIRRXFLx")
    1276                    .dwattr $C$DW$64, DW_AT_bit_offset(0x00)
    1277                    .dwattr $C$DW$64, DW_AT_bit_size(0x06)
    1278                    .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1279                    .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1280                    .dwattr $C$DW$64, DW_AT_decl_file("..\usart_comms.h")
    1281                    .dwattr $C$DW$64, DW_AT_decl_line(0x6d)
    1282                    .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
    1283            
    1284                    .dwattr $C$DW$T$34, DW_AT_decl_file("..\usart_comms.h")
    1285                    .dwattr $C$DW$T$34, DW_AT_decl_line(0x67)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   26

    1286                    .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    1287                    .dwendtag $C$DW$T$34
    1288            
    1289            $C$DW$T$46      .dwtag  DW_TAG_typedef
    1290                    .dwattr $C$DW$T$46, DW_AT_name("UCA0IRCTL_REG")
    1291                    .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$34)
    1292                    .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1293                    .dwattr $C$DW$T$46, DW_AT_decl_file("..\usart_comms.h")
    1294                    .dwattr $C$DW$T$46, DW_AT_decl_line(0x6e)
    1295                    .dwattr $C$DW$T$46, DW_AT_decl_column(0x02)
    1296            
    1297            
    1298            $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1299                    .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1300            $C$DW$65        .dwtag  DW_TAG_member
    1301                    .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$22)
    1302                    .dwattr $C$DW$65, DW_AT_name("UCRXIE")
    1303                    .dwattr $C$DW$65, DW_AT_TI_symbol_name("UCRXIE")
    1304                    .dwattr $C$DW$65, DW_AT_bit_offset(0x07)
    1305                    .dwattr $C$DW$65, DW_AT_bit_size(0x01)
    1306                    .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307                    .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1308                    .dwattr $C$DW$65, DW_AT_decl_file("..\usart_comms.h")
    1309                    .dwattr $C$DW$65, DW_AT_decl_line(0x31)
    1310                    .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1311            
    1312            $C$DW$66        .dwtag  DW_TAG_member
    1313                    .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$22)
    1314                    .dwattr $C$DW$66, DW_AT_name("UCTXIE")
    1315                    .dwattr $C$DW$66, DW_AT_TI_symbol_name("UCTXIE")
    1316                    .dwattr $C$DW$66, DW_AT_bit_offset(0x06)
    1317                    .dwattr $C$DW$66, DW_AT_bit_size(0x01)
    1318                    .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1319                    .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1320                    .dwattr $C$DW$66, DW_AT_decl_file("..\usart_comms.h")
    1321                    .dwattr $C$DW$66, DW_AT_decl_line(0x32)
    1322                    .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1323            
    1324            $C$DW$67        .dwtag  DW_TAG_member
    1325                    .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$22)
    1326                    .dwattr $C$DW$67, DW_AT_name("UCSTTIE")
    1327                    .dwattr $C$DW$67, DW_AT_TI_symbol_name("UCSTTIE")
    1328                    .dwattr $C$DW$67, DW_AT_bit_offset(0x05)
    1329                    .dwattr $C$DW$67, DW_AT_bit_size(0x01)
    1330                    .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1331                    .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1332                    .dwattr $C$DW$67, DW_AT_decl_file("..\usart_comms.h")
    1333                    .dwattr $C$DW$67, DW_AT_decl_line(0x33)
    1334                    .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1335            
    1336            $C$DW$68        .dwtag  DW_TAG_member
    1337                    .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$22)
    1338                    .dwattr $C$DW$68, DW_AT_name("UCTXCPTIE")
    1339                    .dwattr $C$DW$68, DW_AT_TI_symbol_name("UCTXCPTIE")
    1340                    .dwattr $C$DW$68, DW_AT_bit_offset(0x04)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   27

    1341                    .dwattr $C$DW$68, DW_AT_bit_size(0x01)
    1342                    .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1343                    .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1344                    .dwattr $C$DW$68, DW_AT_decl_file("..\usart_comms.h")
    1345                    .dwattr $C$DW$68, DW_AT_decl_line(0x34)
    1346                    .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1347            
    1348                    .dwattr $C$DW$T$35, DW_AT_decl_file("..\usart_comms.h")
    1349                    .dwattr $C$DW$T$35, DW_AT_decl_line(0x30)
    1350                    .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    1351                    .dwendtag $C$DW$T$35
    1352            
    1353            $C$DW$T$47      .dwtag  DW_TAG_typedef
    1354                    .dwattr $C$DW$T$47, DW_AT_name("UCA0IE_REG")
    1355                    .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$35)
    1356                    .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1357                    .dwattr $C$DW$T$47, DW_AT_decl_file("..\usart_comms.h")
    1358                    .dwattr $C$DW$T$47, DW_AT_decl_line(0x35)
    1359                    .dwattr $C$DW$T$47, DW_AT_decl_column(0x02)
    1360            
    1361            $C$DW$T$67      .dwtag  DW_TAG_volatile_type
    1362                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$47)
    1363            
    1364            $C$DW$T$68      .dwtag  DW_TAG_pointer_type
    1365                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    1366                    .dwattr $C$DW$T$68, DW_AT_address_class(0x10)
    1367            
    1368            $C$DW$T$69      .dwtag  DW_TAG_const_type
    1369                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1370            
    1371            
    1372            $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1373                    .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1374            $C$DW$69        .dwtag  DW_TAG_member
    1375                    .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$22)
    1376                    .dwattr $C$DW$69, DW_AT_name("UCRXIFG")
    1377                    .dwattr $C$DW$69, DW_AT_TI_symbol_name("UCRXIFG")
    1378                    .dwattr $C$DW$69, DW_AT_bit_offset(0x07)
    1379                    .dwattr $C$DW$69, DW_AT_bit_size(0x01)
    1380                    .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1381                    .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1382                    .dwattr $C$DW$69, DW_AT_decl_file("..\usart_comms.h")
    1383                    .dwattr $C$DW$69, DW_AT_decl_line(0x77)
    1384                    .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1385            
    1386            $C$DW$70        .dwtag  DW_TAG_member
    1387                    .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$22)
    1388                    .dwattr $C$DW$70, DW_AT_name("UCTXIFG")
    1389                    .dwattr $C$DW$70, DW_AT_TI_symbol_name("UCTXIFG")
    1390                    .dwattr $C$DW$70, DW_AT_bit_offset(0x06)
    1391                    .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1392                    .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1393                    .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1394                    .dwattr $C$DW$70, DW_AT_decl_file("..\usart_comms.h")
    1395                    .dwattr $C$DW$70, DW_AT_decl_line(0x78)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   28

    1396                    .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1397            
    1398            $C$DW$71        .dwtag  DW_TAG_member
    1399                    .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$22)
    1400                    .dwattr $C$DW$71, DW_AT_name("UCSTTIFG")
    1401                    .dwattr $C$DW$71, DW_AT_TI_symbol_name("UCSTTIFG")
    1402                    .dwattr $C$DW$71, DW_AT_bit_offset(0x05)
    1403                    .dwattr $C$DW$71, DW_AT_bit_size(0x01)
    1404                    .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405                    .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1406                    .dwattr $C$DW$71, DW_AT_decl_file("..\usart_comms.h")
    1407                    .dwattr $C$DW$71, DW_AT_decl_line(0x79)
    1408                    .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1409            
    1410            $C$DW$72        .dwtag  DW_TAG_member
    1411                    .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$22)
    1412                    .dwattr $C$DW$72, DW_AT_name("UCTXCPTIFG")
    1413                    .dwattr $C$DW$72, DW_AT_TI_symbol_name("UCTXCPTIFG")
    1414                    .dwattr $C$DW$72, DW_AT_bit_offset(0x04)
    1415                    .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1416                    .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1417                    .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1418                    .dwattr $C$DW$72, DW_AT_decl_file("..\usart_comms.h")
    1419                    .dwattr $C$DW$72, DW_AT_decl_line(0x7a)
    1420                    .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1421            
    1422                    .dwattr $C$DW$T$36, DW_AT_decl_file("..\usart_comms.h")
    1423                    .dwattr $C$DW$T$36, DW_AT_decl_line(0x76)
    1424                    .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    1425                    .dwendtag $C$DW$T$36
    1426            
    1427            $C$DW$T$48      .dwtag  DW_TAG_typedef
    1428                    .dwattr $C$DW$T$48, DW_AT_name("UCA0IFG_REG")
    1429                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$36)
    1430                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1431                    .dwattr $C$DW$T$48, DW_AT_decl_file("..\usart_comms.h")
    1432                    .dwattr $C$DW$T$48, DW_AT_decl_line(0x7b)
    1433                    .dwattr $C$DW$T$48, DW_AT_decl_column(0x02)
    1434            
    1435            $C$DW$T$70      .dwtag  DW_TAG_volatile_type
    1436                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$48)
    1437            
    1438            $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    1439                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    1440                    .dwattr $C$DW$T$71, DW_AT_address_class(0x10)
    1441            
    1442            $C$DW$T$72      .dwtag  DW_TAG_const_type
    1443                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    1444            
    1445            
    1446            $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1447                    .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1448            $C$DW$73        .dwtag  DW_TAG_member
    1449                    .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$25)
    1450                    .dwattr $C$DW$73, DW_AT_name("UCIVx")
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   29

    1451                    .dwattr $C$DW$73, DW_AT_TI_symbol_name("UCIVx")
    1452                    .dwattr $C$DW$73, DW_AT_bit_offset(0x00)
    1453                    .dwattr $C$DW$73, DW_AT_bit_size(0x10)
    1454                    .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1455                    .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1456                    .dwattr $C$DW$73, DW_AT_decl_file("..\usart_comms.h")
    1457                    .dwattr $C$DW$73, DW_AT_decl_line(0x72)
    1458                    .dwattr $C$DW$73, DW_AT_decl_column(0x0e)
    1459            
    1460                    .dwattr $C$DW$T$37, DW_AT_decl_file("..\usart_comms.h")
    1461                    .dwattr $C$DW$T$37, DW_AT_decl_line(0x71)
    1462                    .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    1463                    .dwendtag $C$DW$T$37
    1464            
    1465            $C$DW$T$49      .dwtag  DW_TAG_typedef
    1466                    .dwattr $C$DW$T$49, DW_AT_name("UCA0IV_REG")
    1467                    .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$37)
    1468                    .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1469                    .dwattr $C$DW$T$49, DW_AT_decl_file("..\usart_comms.h")
    1470                    .dwattr $C$DW$T$49, DW_AT_decl_line(0x73)
    1471                    .dwattr $C$DW$T$49, DW_AT_decl_column(0x02)
    1472            
    1473            
    1474            $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1475                    .dwattr $C$DW$T$50, DW_AT_byte_size(0x16)
    1476            $C$DW$74        .dwtag  DW_TAG_member
    1477                    .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$38)
    1478                    .dwattr $C$DW$74, DW_AT_name("CTLW0")
    1479                    .dwattr $C$DW$74, DW_AT_TI_symbol_name("CTLW0")
    1480                    .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1481                    .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1482                    .dwattr $C$DW$74, DW_AT_decl_file("..\usart_comms.h")
    1483                    .dwattr $C$DW$74, DW_AT_decl_line(0x7f)
    1484                    .dwattr $C$DW$74, DW_AT_decl_column(0x13)
    1485            
    1486            $C$DW$75        .dwtag  DW_TAG_member
    1487                    .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$39)
    1488                    .dwattr $C$DW$75, DW_AT_name("CLTW1")
    1489                    .dwattr $C$DW$75, DW_AT_TI_symbol_name("CLTW1")
    1490                    .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1491                    .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1492                    .dwattr $C$DW$75, DW_AT_decl_file("..\usart_comms.h")
    1493                    .dwattr $C$DW$75, DW_AT_decl_line(0x80)
    1494                    .dwattr $C$DW$75, DW_AT_decl_column(0x13)
    1495            
    1496            $C$DW$76        .dwtag  DW_TAG_member
    1497                    .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$40)
    1498                    .dwattr $C$DW$76, DW_AT_name("BRW")
    1499                    .dwattr $C$DW$76, DW_AT_TI_symbol_name("BRW")
    1500                    .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1501                    .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1502                    .dwattr $C$DW$76, DW_AT_decl_file("..\usart_comms.h")
    1503                    .dwattr $C$DW$76, DW_AT_decl_line(0x81)
    1504                    .dwattr $C$DW$76, DW_AT_decl_column(0x13)
    1505            
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   30

    1506            $C$DW$77        .dwtag  DW_TAG_member
    1507                    .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$41)
    1508                    .dwattr $C$DW$77, DW_AT_name("MCTLW")
    1509                    .dwattr $C$DW$77, DW_AT_TI_symbol_name("MCTLW")
    1510                    .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1511                    .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1512                    .dwattr $C$DW$77, DW_AT_decl_file("..\usart_comms.h")
    1513                    .dwattr $C$DW$77, DW_AT_decl_line(0x82)
    1514                    .dwattr $C$DW$77, DW_AT_decl_column(0x13)
    1515            
    1516            $C$DW$78        .dwtag  DW_TAG_member
    1517                    .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$42)
    1518                    .dwattr $C$DW$78, DW_AT_name("STATW")
    1519                    .dwattr $C$DW$78, DW_AT_TI_symbol_name("STATW")
    1520                    .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1521                    .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1522                    .dwattr $C$DW$78, DW_AT_decl_file("..\usart_comms.h")
    1523                    .dwattr $C$DW$78, DW_AT_decl_line(0x83)
    1524                    .dwattr $C$DW$78, DW_AT_decl_column(0x13)
    1525            
    1526            $C$DW$79        .dwtag  DW_TAG_member
    1527                    .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$43)
    1528                    .dwattr $C$DW$79, DW_AT_name("RXBUF")
    1529                    .dwattr $C$DW$79, DW_AT_TI_symbol_name("RXBUF")
    1530                    .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1531                    .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1532                    .dwattr $C$DW$79, DW_AT_decl_file("..\usart_comms.h")
    1533                    .dwattr $C$DW$79, DW_AT_decl_line(0x84)
    1534                    .dwattr $C$DW$79, DW_AT_decl_column(0x13)
    1535            
    1536            $C$DW$80        .dwtag  DW_TAG_member
    1537                    .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$44)
    1538                    .dwattr $C$DW$80, DW_AT_name("TXBUF")
    1539                    .dwattr $C$DW$80, DW_AT_TI_symbol_name("TXBUF")
    1540                    .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1541                    .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1542                    .dwattr $C$DW$80, DW_AT_decl_file("..\usart_comms.h")
    1543                    .dwattr $C$DW$80, DW_AT_decl_line(0x85)
    1544                    .dwattr $C$DW$80, DW_AT_decl_column(0x13)
    1545            
    1546            $C$DW$81        .dwtag  DW_TAG_member
    1547                    .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$45)
    1548                    .dwattr $C$DW$81, DW_AT_name("ABCTL")
    1549                    .dwattr $C$DW$81, DW_AT_TI_symbol_name("ABCTL")
    1550                    .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1551                    .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1552                    .dwattr $C$DW$81, DW_AT_decl_file("..\usart_comms.h")
    1553                    .dwattr $C$DW$81, DW_AT_decl_line(0x86)
    1554                    .dwattr $C$DW$81, DW_AT_decl_column(0x13)
    1555            
    1556            $C$DW$82        .dwtag  DW_TAG_member
    1557                    .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$46)
    1558                    .dwattr $C$DW$82, DW_AT_name("IRCTL")
    1559                    .dwattr $C$DW$82, DW_AT_TI_symbol_name("IRCTL")
    1560                    .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   31

    1561                    .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1562                    .dwattr $C$DW$82, DW_AT_decl_file("..\usart_comms.h")
    1563                    .dwattr $C$DW$82, DW_AT_decl_line(0x87)
    1564                    .dwattr $C$DW$82, DW_AT_decl_column(0x13)
    1565            
    1566            $C$DW$83        .dwtag  DW_TAG_member
    1567                    .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$47)
    1568                    .dwattr $C$DW$83, DW_AT_name("IE")
    1569                    .dwattr $C$DW$83, DW_AT_TI_symbol_name("IE")
    1570                    .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1571                    .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1572                    .dwattr $C$DW$83, DW_AT_decl_file("..\usart_comms.h")
    1573                    .dwattr $C$DW$83, DW_AT_decl_line(0x88)
    1574                    .dwattr $C$DW$83, DW_AT_decl_column(0x13)
    1575            
    1576            $C$DW$84        .dwtag  DW_TAG_member
    1577                    .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$48)
    1578                    .dwattr $C$DW$84, DW_AT_name("IFG")
    1579                    .dwattr $C$DW$84, DW_AT_TI_symbol_name("IFG")
    1580                    .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1581                    .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1582                    .dwattr $C$DW$84, DW_AT_decl_file("..\usart_comms.h")
    1583                    .dwattr $C$DW$84, DW_AT_decl_line(0x89)
    1584                    .dwattr $C$DW$84, DW_AT_decl_column(0x13)
    1585            
    1586            $C$DW$85        .dwtag  DW_TAG_member
    1587                    .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$49)
    1588                    .dwattr $C$DW$85, DW_AT_name("IV")
    1589                    .dwattr $C$DW$85, DW_AT_TI_symbol_name("IV")
    1590                    .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1591                    .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1592                    .dwattr $C$DW$85, DW_AT_decl_file("..\usart_comms.h")
    1593                    .dwattr $C$DW$85, DW_AT_decl_line(0x8a)
    1594                    .dwattr $C$DW$85, DW_AT_decl_column(0x13)
    1595            
    1596                    .dwattr $C$DW$T$50, DW_AT_decl_file("..\usart_comms.h")
    1597                    .dwattr $C$DW$T$50, DW_AT_decl_line(0x7e)
    1598                    .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    1599                    .dwendtag $C$DW$T$50
    1600            
    1601            $C$DW$T$73      .dwtag  DW_TAG_typedef
    1602                    .dwattr $C$DW$T$73, DW_AT_name("USART_REGs")
    1603                    .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$50)
    1604                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1605                    .dwattr $C$DW$T$73, DW_AT_decl_file("..\usart_comms.h")
    1606                    .dwattr $C$DW$T$73, DW_AT_decl_line(0x8b)
    1607                    .dwattr $C$DW$T$73, DW_AT_decl_column(0x02)
    1608            
    1609            $C$DW$T$74      .dwtag  DW_TAG_volatile_type
    1610                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    1611            
    1612            $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    1613                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    1614                    .dwattr $C$DW$T$75, DW_AT_address_class(0x10)
    1615            
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   32

    1616            $C$DW$T$76      .dwtag  DW_TAG_const_type
    1617                    .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    1618            
    1619            
    1620            $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1621                    .dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
    1622            $C$DW$86        .dwtag  DW_TAG_member
    1623                    .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$14)
    1624                    .dwattr $C$DW$86, DW_AT_name("__max_align1")
    1625                    .dwattr $C$DW$86, DW_AT_TI_symbol_name("__max_align1")
    1626                    .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1627                    .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1628                    .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
    1629                    .dwattr $C$DW$86, DW_AT_decl_line(0x7b)
    1630                    .dwattr $C$DW$86, DW_AT_decl_column(0x0c)
    1631            
    1632            $C$DW$87        .dwtag  DW_TAG_member
    1633                    .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$18)
    1634                    .dwattr $C$DW$87, DW_AT_name("__max_align2")
    1635                    .dwattr $C$DW$87, DW_AT_TI_symbol_name("__max_align2")
    1636                    .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1637                    .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1638                    .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS/i
    1639                    .dwattr $C$DW$87, DW_AT_decl_line(0x7c)
    1640                    .dwattr $C$DW$87, DW_AT_decl_column(0x0e)
    1641            
    1642                    .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1643                    .dwattr $C$DW$T$51, DW_AT_decl_line(0x7a)
    1644                    .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    1645                    .dwendtag $C$DW$T$51
    1646            
    1647            $C$DW$T$77      .dwtag  DW_TAG_typedef
    1648                    .dwattr $C$DW$T$77, DW_AT_name("__max_align_t")
    1649                    .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$51)
    1650                    .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1651                    .dwattr $C$DW$T$77, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1652                    .dwattr $C$DW$T$77, DW_AT_decl_line(0x7d)
    1653                    .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
    1654            
    1655            $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1656                    .dwattr $C$DW$T$2, DW_AT_name("void")
    1657            
    1658            $C$DW$T$4       .dwtag  DW_TAG_base_type
    1659                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1660                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    1661                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1662            
    1663            $C$DW$T$5       .dwtag  DW_TAG_base_type
    1664                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1665                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1666                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1667            
    1668            $C$DW$T$80      .dwtag  DW_TAG_typedef
    1669                    .dwattr $C$DW$T$80, DW_AT_name("__int8_t")
    1670                    .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$5)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   33

    1671                    .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1672                    .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1673                    .dwattr $C$DW$T$80, DW_AT_decl_line(0x36)
    1674                    .dwattr $C$DW$T$80, DW_AT_decl_column(0x16)
    1675            
    1676            $C$DW$T$81      .dwtag  DW_TAG_typedef
    1677                    .dwattr $C$DW$T$81, DW_AT_name("__int_least8_t")
    1678                    .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    1679                    .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1680                    .dwattr $C$DW$T$81, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1681                    .dwattr $C$DW$T$81, DW_AT_decl_line(0x5a)
    1682                    .dwattr $C$DW$T$81, DW_AT_decl_column(0x12)
    1683            
    1684            $C$DW$T$82      .dwtag  DW_TAG_typedef
    1685                    .dwattr $C$DW$T$82, DW_AT_name("int_least8_t")
    1686                    .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    1687                    .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1688                    .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1689                    .dwattr $C$DW$T$82, DW_AT_decl_line(0x2a)
    1690                    .dwattr $C$DW$T$82, DW_AT_decl_column(0x19)
    1691            
    1692            $C$DW$T$83      .dwtag  DW_TAG_typedef
    1693                    .dwattr $C$DW$T$83, DW_AT_name("int8_t")
    1694                    .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$80)
    1695                    .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1696                    .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1697                    .dwattr $C$DW$T$83, DW_AT_decl_line(0x25)
    1698                    .dwattr $C$DW$T$83, DW_AT_decl_column(0x13)
    1699            
    1700            $C$DW$T$6       .dwtag  DW_TAG_base_type
    1701                    .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1702                    .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1703                    .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1704            
    1705            $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    1706                    .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$6)
    1707                    .dwattr $C$DW$T$52, DW_AT_address_class(0x10)
    1708            
    1709            $C$DW$T$21      .dwtag  DW_TAG_typedef
    1710                    .dwattr $C$DW$T$21, DW_AT_name("__uint8_t")
    1711                    .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$6)
    1712                    .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    1713                    .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1714                    .dwattr $C$DW$T$21, DW_AT_decl_line(0x37)
    1715                    .dwattr $C$DW$T$21, DW_AT_decl_column(0x18)
    1716            
    1717            $C$DW$T$85      .dwtag  DW_TAG_typedef
    1718                    .dwattr $C$DW$T$85, DW_AT_name("__sa_family_t")
    1719                    .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$21)
    1720                    .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1721                    .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1722                    .dwattr $C$DW$T$85, DW_AT_decl_line(0x47)
    1723                    .dwattr $C$DW$T$85, DW_AT_decl_column(0x13)
    1724            
    1725            $C$DW$T$86      .dwtag  DW_TAG_typedef
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   34

    1726                    .dwattr $C$DW$T$86, DW_AT_name("__uint_least8_t")
    1727                    .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$21)
    1728                    .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1729                    .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1730                    .dwattr $C$DW$T$86, DW_AT_decl_line(0x74)
    1731                    .dwattr $C$DW$T$86, DW_AT_decl_column(0x13)
    1732            
    1733            $C$DW$T$87      .dwtag  DW_TAG_typedef
    1734                    .dwattr $C$DW$T$87, DW_AT_name("uint_least8_t")
    1735                    .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    1736                    .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1737                    .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1738                    .dwattr $C$DW$T$87, DW_AT_decl_line(0x2f)
    1739                    .dwattr $C$DW$T$87, DW_AT_decl_column(0x1a)
    1740            
    1741            $C$DW$T$22      .dwtag  DW_TAG_typedef
    1742                    .dwattr $C$DW$T$22, DW_AT_name("uint8_t")
    1743                    .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    1744                    .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    1745                    .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1746                    .dwattr $C$DW$T$22, DW_AT_decl_line(0x3b)
    1747                    .dwattr $C$DW$T$22, DW_AT_decl_column(0x14)
    1748            
    1749            $C$DW$T$7       .dwtag  DW_TAG_base_type
    1750                    .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1751                    .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1752                    .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    1753            
    1754            $C$DW$T$8       .dwtag  DW_TAG_base_type
    1755                    .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1756                    .dwattr $C$DW$T$8, DW_AT_name("short")
    1757                    .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    1758            
    1759            $C$DW$T$9       .dwtag  DW_TAG_base_type
    1760                    .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1761                    .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1762                    .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    1763            
    1764            $C$DW$T$10      .dwtag  DW_TAG_base_type
    1765                    .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1766                    .dwattr $C$DW$T$10, DW_AT_name("int")
    1767                    .dwattr $C$DW$T$10, DW_AT_byte_size(0x02)
    1768            
    1769            $C$DW$T$89      .dwtag  DW_TAG_typedef
    1770                    .dwattr $C$DW$T$89, DW_AT_name("_Mbstatet")
    1771                    .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$10)
    1772                    .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1773                    .dwattr $C$DW$T$89, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1774                    .dwattr $C$DW$T$89, DW_AT_decl_line(0x8f)
    1775                    .dwattr $C$DW$T$89, DW_AT_decl_column(0x0d)
    1776            
    1777            $C$DW$T$90      .dwtag  DW_TAG_typedef
    1778                    .dwattr $C$DW$T$90, DW_AT_name("__mbstate_t")
    1779                    .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    1780                    .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   35

    1781                    .dwattr $C$DW$T$90, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1782                    .dwattr $C$DW$T$90, DW_AT_decl_line(0x92)
    1783                    .dwattr $C$DW$T$90, DW_AT_decl_column(0x13)
    1784            
    1785            $C$DW$T$91      .dwtag  DW_TAG_typedef
    1786                    .dwattr $C$DW$T$91, DW_AT_name("__accmode_t")
    1787                    .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$10)
    1788                    .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    1789                    .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1790                    .dwattr $C$DW$T$91, DW_AT_decl_line(0x3b)
    1791                    .dwattr $C$DW$T$91, DW_AT_decl_column(0x0e)
    1792            
    1793            $C$DW$T$92      .dwtag  DW_TAG_typedef
    1794                    .dwattr $C$DW$T$92, DW_AT_name("__cpulevel_t")
    1795                    .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$10)
    1796                    .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    1797                    .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1798                    .dwattr $C$DW$T$92, DW_AT_decl_line(0x50)
    1799                    .dwattr $C$DW$T$92, DW_AT_decl_column(0x0e)
    1800            
    1801            $C$DW$T$93      .dwtag  DW_TAG_typedef
    1802                    .dwattr $C$DW$T$93, DW_AT_name("__cpusetid_t")
    1803                    .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$10)
    1804                    .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    1805                    .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1806                    .dwattr $C$DW$T$93, DW_AT_decl_line(0x51)
    1807                    .dwattr $C$DW$T$93, DW_AT_decl_column(0x0e)
    1808            
    1809            $C$DW$T$94      .dwtag  DW_TAG_typedef
    1810                    .dwattr $C$DW$T$94, DW_AT_name("__cpuwhich_t")
    1811                    .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$10)
    1812                    .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    1813                    .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1814                    .dwattr $C$DW$T$94, DW_AT_decl_line(0x4f)
    1815                    .dwattr $C$DW$T$94, DW_AT_decl_column(0x0e)
    1816            
    1817            $C$DW$T$95      .dwtag  DW_TAG_typedef
    1818                    .dwattr $C$DW$T$95, DW_AT_name("__ct_rune_t")
    1819                    .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$10)
    1820                    .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    1821                    .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1822                    .dwattr $C$DW$T$95, DW_AT_decl_line(0x69)
    1823                    .dwattr $C$DW$T$95, DW_AT_decl_column(0x0e)
    1824            
    1825            $C$DW$T$96      .dwtag  DW_TAG_typedef
    1826                    .dwattr $C$DW$T$96, DW_AT_name("__rune_t")
    1827                    .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    1828                    .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    1829                    .dwattr $C$DW$T$96, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1830                    .dwattr $C$DW$T$96, DW_AT_decl_line(0x6c)
    1831                    .dwattr $C$DW$T$96, DW_AT_decl_column(0x15)
    1832            
    1833            $C$DW$T$97      .dwtag  DW_TAG_typedef
    1834                    .dwattr $C$DW$T$97, DW_AT_name("__wint_t")
    1835                    .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$95)
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   36

    1836                    .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    1837                    .dwattr $C$DW$T$97, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1838                    .dwattr $C$DW$T$97, DW_AT_decl_line(0x6d)
    1839                    .dwattr $C$DW$T$97, DW_AT_decl_column(0x15)
    1840            
    1841            $C$DW$T$98      .dwtag  DW_TAG_typedef
    1842                    .dwattr $C$DW$T$98, DW_AT_name("__int16_t")
    1843                    .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$10)
    1844                    .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    1845                    .dwattr $C$DW$T$98, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1846                    .dwattr $C$DW$T$98, DW_AT_decl_line(0x38)
    1847                    .dwattr $C$DW$T$98, DW_AT_decl_column(0x0f)
    1848            
    1849            $C$DW$T$99      .dwtag  DW_TAG_typedef
    1850                    .dwattr $C$DW$T$99, DW_AT_name("__int_fast16_t")
    1851                    .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    1852                    .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    1853                    .dwattr $C$DW$T$99, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LTS
    1854                    .dwattr $C$DW$T$99, DW_AT_decl_line(0x57)
    1855                    .dwattr $C$DW$T$99, DW_AT_decl_column(0x13)
    1856            
    1857            $C$DW$T$100     .dwtag  DW_TAG_typedef
    1858                    .dwattr $C$DW$T$100, DW_AT_name("int_fast16_t")
    1859                    .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    1860                    .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    1861                    .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
    1862                    .dwattr $C$DW$T$100, DW_AT_decl_line(0x35)
    1863                    .dwattr $C$DW$T$100, DW_AT_decl_column(0x19)
    1864            
    1865            $C$DW$T$101     .dwtag  DW_TAG_typedef
    1866                    .dwattr $C$DW$T$101, DW_AT_name("__int_fast8_t")
    1867                    .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$98)
    1868                    .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    1869                    .dwattr $C$DW$T$101, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
    1870                    .dwattr $C$DW$T$101, DW_AT_decl_line(0x56)
    1871                    .dwattr $C$DW$T$101, DW_AT_decl_column(0x13)
    1872            
    1873            $C$DW$T$102     .dwtag  DW_TAG_typedef
    1874                    .dwattr $C$DW$T$102, DW_AT_name("int_fast8_t")
    1875                    .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    1876                    .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    1877                    .dwattr $C$DW$T$102, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
    1878                    .dwattr $C$DW$T$102, DW_AT_decl_line(0x34)
    1879                    .dwattr $C$DW$T$102, DW_AT_decl_column(0x18)
    1880            
    1881            $C$DW$T$103     .dwtag  DW_TAG_typedef
    1882                    .dwattr $C$DW$T$103, DW_AT_name("__int_least16_t")
    1883                    .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$98)
    1884                    .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    1885                    .dwattr $C$DW$T$103, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
    1886                    .dwattr $C$DW$T$103, DW_AT_decl_line(0x5b)
    1887                    .dwattr $C$DW$T$103, DW_AT_decl_column(0x13)
    1888            
    1889            $C$DW$T$104     .dwtag  DW_TAG_typedef
    1890                    .dwattr $C$DW$T$104, DW_AT_name("int_least16_t")
MSP430 Assembler PC v21.6.1 Tue Jan  3 09:51:30 2023

Copyright (c) 2003-2018 Texas Instruments Incorporated
usart_comms.asm                                                      PAGE   37

    1891                    .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    1892                    .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    1893                    .dwattr $C$DW$T$104, DW_AT_decl_file("C:/ti/ccs1110/ccs/tools/compiler/ti-cgt-msp430_21.6.1.LT
